{
  "url": "https://habr.com/ru/articles/477920/comments/",
  "article_id": 477920,
  "title": "Практические аспекты ранней пенсии FIRE movement в России",
  "comments": [
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2019-11-29T03:02:40.000Z",
      "text": "А как у Вас макрос организован — с одного или с разных сайтов скачивает?"
    },
    {
      "id": 20944418,
      "author": "empenoso",
      "datetime": "2019-11-29T03:02:40.000Z",
      "text": "А как у Вас макрос организован — с одного или с разных сайтов скачивает?"
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2019-12-02T05:31:16.000Z",
      "text": "Получается как донор один сайт google finance (страничка в поиске)?"
    },
    {
      "id": 20954056,
      "author": "empenoso",
      "datetime": "2019-12-02T05:31:16.000Z",
      "text": "Получается как донор один сайт google finance (страничка в поиске)?"
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 20952798,
      "author": "vis_inet",
      "datetime": "2019-12-01T14:20:18.000Z",
      "text": "Во что инвестируете, можете рассказать?"
    },
    {
      "id": 20952900,
      "author": "empenoso",
      "datetime": "2019-12-01T15:11:47.000Z",
      "text": "В разное, тут индивидуально."
    },
    {
      "id": null,
      "author": "vis_inet",
      "datetime": "2019-12-02T04:09:51.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 20953968,
      "author": "vis_inet",
      "datetime": "2019-12-02T04:09:51.000Z",
      "text": "Спасибо!"
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2019-11-29T03:01:54.000Z",
      "text": "Это сильно для профессионалов, а я пишу с точки зрения частного инвестора. Лично у меня, например, тоже нет доступа к Блумбергскому терминалу"
    },
    {
      "id": 20944416,
      "author": "empenoso",
      "datetime": "2019-11-29T03:01:54.000Z",
      "text": "Это сильно для профессионалов, а я пишу с точки зрения частного инвестора. Лично у меня, например, тоже нет доступа к Блумбергскому терминалу"
    },
    {
      "id": 20945072,
      "author": "VGusev2007",
      "datetime": "2019-11-29T07:51:20.000Z",
      "text": "Михаил, добрый день! Вопрос очень важный имею: Вам удалось решить вопрос с учетом доходностей по облигациям с амортизацией долга (в идеале в KMyMoney)? Я так и не смог понять даже примерно как это можно реализовать. Чтобы было в локальной программе. Почти все муниципальные бумаги с амортизацией долга…"
    },
    {
      "id": 20945166,
      "author": "empenoso",
      "datetime": "2019-11-29T08:14:17.000Z",
      "text": "Это сложный вопрос, но на гугл скриптах вроде удалось сделать — дело в том, что и в отчете брокера это не всегда это корректно отображается :(Вы ведь про отображение выплат номинала бумаги и корректировки начальной стоимости покупки спрашиваете?"
    },
    {
      "id": 20946404,
      "author": "VGusev2007",
      "datetime": "2019-11-29T11:49:36.000Z",
      "text": "Вы ведь про отображение выплат номинала бумаги и корректировки начальной стоимости покупки спрашиваете?Верно. Очень сложно по муниципалам понять, сколько составил реальный доход. Когда часть купона может тратиться на покупку тех же бумаг, или тратиться по своему усмотрению."
    },
    {
      "id": 20946740,
      "author": "empenoso",
      "datetime": "2019-11-29T12:41:32.000Z",
      "text": "Проблема в том, что и в отчете брокера это не всегда корректно отображается по факту (использую разных). У меня автоматический импорт отчета от брокера сделан, но и там часто недостоверно.Думал автоматом сделать уменьшение суммы покупки, но пока не добрался."
    },
    {
      "id": 20946904,
      "author": "VGusev2007",
      "datetime": "2019-11-29T13:07:06.000Z",
      "text": "В общем, это самый сложный и достойный решения вопрос. ИМХО, без решения сложных вопросов с облигациями, говорить о реально годном ПО, пока преждевременно. Был товарищ, который написал конфигурацию 1С с этим функционалом, но он забросил поддержку этого решения."
    },
    {
      "id": 20946982,
      "author": "empenoso",
      "datetime": "2019-11-29T13:17:56.000Z",
      "text": "Ну в статье описываю опыт для частного лица и БЕЗ бухгалтерского учета. Именно управленческий — то есть общая картина и легкость управления данными. А также предстоящие выплаты — очень важно для бюджета — это тоже есть.А выплаты номинала не так уж и сложно учесть — если это на самом деле необходимо — такой функционал можно сделать."
    },
    {
      "id": 20949790,
      "author": "zhulan0v",
      "datetime": "2019-11-30T09:21:27.000Z",
      "text": "Тема интересная, у самого есть небольшие инвестиции и учёт расходов.Самые действенные меры, которые прокачали мое финансовое состояние:— Ограничить ежемесячные расходы, например, максимум 50к или 100к (ваш комфортный уровень) и привыкнуть жить на эту сумму. При этом если ваш доход вырос, то сумма расходов не должна расти, т.е. вы просто начинаете больше направлять на инвестиции.— Учёт расходов, сейчас это можно делать на 99% в автоматическом режиме, если не юзать нал.— Бюджет, хотя бы крупными мазками, приучает мыслить глобально и лучше понимать свои возможности.К этим мерам я пришёл не сразу. Сначала просто стало интересно куда уходят деньги и можно ли наладить автоматизированный учет. Протестировал месяц, второй и привык. Проанализировал расходы, что-то сократил и высвобожденные средства решил направлять в копилку. Как-то так начал вырабатываться осознанный подход к тратам, начал смотреть на ценники, думать действительно ли мне что-то нужно и т.д. Дальше появилось планирование крупных трат и на этой почве простенький бюджет начал складываться сам собой.Потом хорошо подросли доходы и я начал тратить на жизнь значительно больше — кайфовать =) Но это быстро приелось и я понял, что новые расходы не меняют качественно ощущения от жизни, пусть лучше эти деньги копятся. Таким образом появился потолок для расходов.Ну а копилочка всё это время потихоньку росла и появилось желание начать как-то по-умному распоряжаться этими деньгами, может обеспечить себе пенсию, ведь всё просто кричит, что государство меня кинет в самый неподходящий момент.Так что мой совет тем, кто только вступает на эту дорогу: не торопитесь внедрить всё и сразу, начните с малого и всё само сложится если вы действительно этого хотите.Инвестиции учитываю вintelinvest(рефка), в целом пока устраивает, сервис развивается, кое чего не хватает по мелочи, но не критично. Если кому надо промокод, то пишите. Пробовал юзать гугл таблицы, но на моем уровне с ними больше гемороя, чем профита.Учет расходов и ведение бюджета делаю вzenmoney. Как и везде есть небольшие недочёты, но меня устраивает. Для работы с бюджетом юзаю веб-версию, т.к. на большом экране с ним удобней работать. В приложение захожу супер редко, в основном категорию поправить, если что-то неправильно проставилось автоматически."
    },
    {
      "id": 20952202,
      "author": "empenoso",
      "datetime": "2019-12-01T09:58:45.000Z",
      "text": "Спасибо за Ваш комментарийzhulan0v!"
    },
    {
      "id": 21049320,
      "author": "empenoso",
      "datetime": "2019-12-23T07:52:19.000Z",
      "text": "Более подробная инструкция как пользоваться Google Таблицей \"SilverFir: Investment Report\":https://zen.yandex.ru/media/id/5dfb4f5af73d9d00ae13157e/googletablica-pomojet-podschitat-vashi-finansovye-aktivy--5dfb53f91febd400b9d08780"
    },
    {
      "id": 21688114,
      "author": "Femistoklov",
      "datetime": "2020-06-02T02:16:31.000Z",
      "text": "Надо добавить в первый опрос вариант «Уже нет»."
    },
    {
      "id": 21688134,
      "author": "empenoso",
      "datetime": "2020-06-02T02:35:14.000Z",
      "text": "Я понял вас, но в старых статьях даже голосовать нельзя, а этой уже полгода, как она опубликована."
    },
    {
      "id": 21688174,
      "author": "empenoso",
      "datetime": "2020-06-02T03:13:37.000Z",
      "text": "Логическое продолжение статьи:Как я создал собственную гугл-таблицу для учета капитала /После того как 10 лет пользовался разными программами"
    }
  ]
}