{
  "url": "https://habr.com/ru/articles/481566/comments/",
  "article_id": 481566,
  "title": "Красочные адресные светодиоды на новый год без программирования и пайки",
  "comments": [
    {
      "id": 21048642,
      "author": "Gritsuk",
      "datetime": "2019-12-23T03:39:50.000Z",
      "text": "Спасибо за статью, интересно и красиво. Но вот на месяц раньше бы..."
    },
    {
      "id": 21048730,
      "author": "Akon32",
      "datetime": "2019-12-23T04:58:05.000Z",
      "text": "Я на ардуине гирлянду за пару дней (с отладкой) делал, это совсем несложно. Если, конечно, компоненты в наличии."
    },
    {
      "id": 21048762,
      "author": "Gritsuk",
      "datetime": "2019-12-23T05:15:33.000Z",
      "text": "Предновогодние дедлайны на работе, компоненты уже не успеть заказать с али, только тут втридорога, да и то, если найдешь эту ленту… Поставлю напоминалку на следующий ноябрь)"
    },
    {
      "id": 21051270,
      "author": "safari2012",
      "datetime": "2019-12-23T14:02:47.000Z",
      "text": "Я своюсделалза несколько часов. Правда, потом через год ещё несколько часов потратил на v2."
    },
    {
      "id": 21048792,
      "author": "FridayJew",
      "datetime": "2019-12-23T05:27:50.000Z",
      "text": "Псс, парень.https://youtu.be/MgRmiXxYL5g"
    },
    {
      "id": 21048692,
      "author": "Aquahawk",
      "datetime": "2019-12-23T04:19:56.000Z",
      "text": "А я всем настоятельно рекомендую самостоятельно программировать алгоритм работы гирлянды. Прокачаетесь 100% работа с цветом с одной стороны проста как угол дома, с другой стороны сложна для новичка. Сразу придёт понимание зачем HSB и прочие цветовые пространства изобретали. Зачем придумали гамма коррекцию, почему на этих лентах её не получится сделать и т.п."
    },
    {
      "id": 21048734,
      "author": "Akon32",
      "datetime": "2019-12-23T05:02:22.000Z",
      "text": "Гамма коррекцию? Я просто синий канал на понижающий коэффициент домножал, ибо аж слепило. И после этого нормально стало."
    },
    {
      "id": 21048780,
      "author": "Alexeyslav",
      "datetime": "2019-12-23T05:24:03.000Z",
      "text": "там не просто домножить, там нужна степенная функция, после такой коррекции контраст вырастает! без нее последняя треть яркости диодов почти не отличима."
    },
    {
      "id": 21048890,
      "author": "Aquahawk",
      "datetime": "2019-12-23T06:07:33.000Z",
      "text": "Больше всего жалко что на малых даже 1 в одном канале весьма ярко. Мунлайт не сделать"
    },
    {
      "id": 21051080,
      "author": "Akon32",
      "datetime": "2019-12-23T13:29:28.000Z",
      "text": "Не пробовали сделать нечто вроде ШИМ? Или включать светодиоды через один?"
    },
    {
      "id": 21049708,
      "author": "masyaman",
      "datetime": "2019-12-23T09:20:02.000Z",
      "text": "Кстати, согласен. Подключить гирлянду к готовой библиотеке практически не требует каких-то особых знаний и умений. Придумать алгоритм чтоб он был субъективно приятным и нравился результат — отличная разминка для мозгов. Выбрать рандомный цвет, чтобы он был приятен и радовал глаз (не темный, не блеклый) — не тривиальная задача. Банальные бегущие огни тоже могут быть интересными, если задаться целью сделать их плавными и не раздражающими.Плюсом получите уникальный результат, которого нет ни у кого.Кстати, вот мои исходники для AtMega8. Нужны 2 кнопки и переменный резистор для регулировки скорости:https://github.com/masyamandev/LedStrings"
    },
    {
      "id": 21048856,
      "author": "Peter1010",
      "datetime": "2019-12-23T05:56:17.000Z",
      "text": "Где вариант «У меня в этом году нет ёлки :(»?"
    },
    {
      "id": 21048912,
      "author": "empenoso",
      "datetime": "2019-12-23T06:13:44.000Z",
      "text": "Добавил :)"
    },
    {
      "id": 21048860,
      "author": "IRT",
      "datetime": "2019-12-23T05:58:48.000Z",
      "text": "По мощности я не считал, а установил имеющийся и доступный по цене существующий блок питания Mean Well RS-150-5Не, ну если использовать блок как у вас, аж на 26А, то можно и не считать…На самом деле эти ленты потребляют очень много. Один метр ленты с 60 диодами на всю (белый свет) — 3.6 А. 5 метров — все 18 Ампер! Так что надо очень внимательно следить за потребляемой мощностью. С разноцветными эффектами, когда все диоды разным цветом, конечно, будет меньше, но все же. Просто есть люди, которые видят 5В напряжение питания и пытаются использовать зарядки от телефонов для питания ленты…"
    },
    {
      "id": 21051052,
      "author": "Akon32",
      "datetime": "2019-12-23T13:25:46.000Z",
      "text": "Да, если включать на полную яркость, потребление получается серьёзное.В моём варианте гирлянда запитана от слабого БП (какой-то выпрямитель для микродрели, ~ 2A @ 6V), но режим мигания подобран так, чтобы все светодиоды не включались одновременно. Ещё и питание на ленту выведено через стабилизатор 5V ардуино. Работает достаточно надёжно, как ни странно."
    },
    {
      "id": 21048894,
      "author": "trapwalker",
      "datetime": "2019-12-23T06:09:24.000Z",
      "text": "О, сразу вспомнил одногоДиАйВайщика с ютубас егоофигительными эффектами на адресных лентах.И гирлянды у него вот такие:"
    },
    {
      "id": 21048924,
      "author": "empenoso",
      "datetime": "2019-12-23T06:17:42.000Z",
      "text": "С тех пор больше информации по лентам мне кажется появилось"
    },
    {
      "id": 21048982,
      "author": "trapwalker",
      "datetime": "2019-12-23T06:32:24.000Z",
      "text": "Да куда уж больше. И так всё разжевано максимально. Бери и делай."
    },
    {
      "id": 21153848,
      "author": "NIKOSV",
      "datetime": "2020-01-18T23:11:40.000Z",
      "text": "Мы пошли чуть дальше )"
    },
    {
      "id": 21154016,
      "author": "empenoso",
      "datetime": "2020-01-19T03:10:47.000Z",
      "text": "ну это для профессионалов"
    },
    {
      "id": 21154022,
      "author": "empenoso",
      "datetime": "2020-01-19T03:13:01.000Z",
      "text": "А какой контроллер используете?"
    },
    {
      "id": 21158052,
      "author": "NIKOSV",
      "datetime": "2020-01-19T22:40:19.000Z",
      "text": "E.131, а именно Advatek PixLite 16 MkII и Falcon F16v3Вонтутсравнительная таблица всех контролеров"
    },
    {
      "id": 21178292,
      "author": "empenoso",
      "datetime": "2020-01-23T08:19:03.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 21155080,
      "author": "drWhy",
      "datetime": "2020-01-19T11:52:16.000Z",
      "text": "Потрясающе. Достойно выглядело бы не только в посёлке. Разнообразие композиций впечатляет.В видео за 2018 год меньше оснащения, больше внимания уделено ритмике."
    },
    {
      "id": 21155312,
      "author": "drWhy",
      "datetime": "2020-01-19T12:55:52.000Z",
      "text": "Пересмотрел ещё раз видео этого года — с ритмикой всё более чем в порядке, картина настолько насыщенная, что подробности сразу не охватишь."
    },
    {
      "id": 21157788,
      "author": "NIKOSV",
      "datetime": "2020-01-19T21:28:05.000Z",
      "text": "Пересмотрел ещё раз видео этого года — с ритмикой всё более чем в порядкеГлавное смотреть в проводных ушах, в беспроводных задержка хоть и минимальная, но уже создает рассихрон. В прошлом году как раз так и лоханулся, делал все в беспроводных, потом в продакшине в живую включаем, а там не в ритм. Пришлось срочно дорабатывать.картина настолько насыщенная, что подробности сразу не охватишь.В живую эта проблема еще более выражена, из-за того что все близко, чисто физически нельзя одним взглядом все охватить. А передний план и вовсе видят только те, кто стоят впереди. Плюс картинки на матрице (елка) не так различимы как на видео из-за близости пикселей. С другой стороны на видео динамический диапазон не тот, и если много света, особенно белого, засвечивается все остальное и получаются белые пятна вместо картинки. Надо будет в следующем году поиграться с яркостью пикселей."
    },
    {
      "id": 21050616,
      "author": "DeadikG",
      "datetime": "2019-12-23T12:04:56.000Z",
      "text": "а учитывая что e1.31 поддерживается можно еще через xlights намутить крутых эффектов"
    },
    {
      "id": 21050732,
      "author": "MonkeyD",
      "datetime": "2019-12-23T12:33:02.000Z",
      "text": "А можно для совсем тугих ссылочку на готовый проект, что в ардуино иде вставить и прошить? А то на гитхабе столько всего…"
    },
    {
      "id": 21051092,
      "author": "empenoso",
      "datetime": "2019-12-23T13:30:40.000Z",
      "text": "Вся статья про ESP8266..."
    },
    {
      "id": 21499832,
      "author": "MonkeyD",
      "datetime": "2020-04-14T16:48:44.000Z",
      "text": "Угу, но многие используют именно Дуня иде. Даже для ESP. В моем случае для WeMos. Где взять приложение на мобилку? Как зашить и куда? Досадно, и ничего не понятно."
    },
    {
      "id": 21051290,
      "author": "safari2012",
      "datetime": "2019-12-23T14:04:50.000Z",
      "text": "На всякий случай,вот вариантс примерами."
    }
  ]
}