{
  "url": "https://habr.com/ru/articles/482800/comments/",
  "article_id": 482800,
  "title": "Мои поиски физической панели управления умным домом",
  "comments": [
    {
      "id": 21089550,
      "author": "beho1der",
      "datetime": "2020-01-04T04:54:06.000Z",
      "text": "А что за крепление для планшета к монитору?"
    },
    {
      "id": 21090232,
      "author": "empenoso",
      "datetime": "2020-01-04T11:05:03.000Z",
      "text": "тоже с черной пятницы:https://www.amazon.com/gp/product/B07Q6JY5FX/"
    },
    {
      "id": 21089552,
      "author": "extempl",
      "datetime": "2020-01-04T04:55:39.000Z",
      "text": "Панель в действии я тоже снял, но не смог разобраться как на видео замазать все личные данные, а там их получилось достаточно много, поэтому привожу только вид сзади :)А вот лучше бы разобрались и таки выложили результат описанной работы, а не прикрепления планшета к рабочему месту :)"
    },
    {
      "id": 21090234,
      "author": "empenoso",
      "datetime": "2020-01-04T11:06:06.000Z",
      "text": "Да, спасибо. Попробую разобраться как сделать"
    },
    {
      "id": 21089580,
      "author": "HellKaim",
      "datetime": "2020-01-04T05:43:00.000Z",
      "text": "А мне вот интересно как к такому подключить выключатели на рэлекьро-адиаторы. Ок, можно даже через контакторы."
    },
    {
      "id": 21090240,
      "author": "empenoso",
      "datetime": "2020-01-04T11:07:06.000Z",
      "text": "Ну через sonoff например наверное. Это же просто панель управления — не исполнительное устройство."
    },
    {
      "id": 21090640,
      "author": "soir",
      "datetime": "2020-01-04T13:35:33.000Z",
      "text": "Электрорадиаторами можно управлять из Hassio при помощи Sonoff S26 розеток, они более менее симпатичные, нежели остальные Sonoff реле."
    },
    {
      "id": 21089780,
      "author": "slimper",
      "datetime": "2020-01-04T08:10:20.000Z",
      "text": "Забавно, недавно переехал, и начал собирать свой умный дом. У меня выбор тоже пал на чернопятничный Fire, но HD10 2019 =)Камеру вырубил для фото, там парадная.Сборка бэкенда на OpenHab + Raspberry.Этой ночью переводил все на ssl + пароли на все камеры, после скандала с xiaomi камерами озаботился."
    },
    {
      "id": 21090246,
      "author": "empenoso",
      "datetime": "2020-01-04T11:08:33.000Z",
      "text": "А у меня общий выключатель это физическая кнопка :)"
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2020-01-06T04:47:21.000Z",
      "text": "общий выключатель ВЫКЛ всё — просто вопрос удобства"
    },
    {
      "id": 21094774,
      "author": "empenoso",
      "datetime": "2020-01-06T04:47:21.000Z",
      "text": "общий выключатель ВЫКЛ всё — просто вопрос удобства"
    },
    {
      "id": 21090612,
      "author": "Reshat",
      "datetime": "2020-01-04T13:28:29.000Z",
      "text": "А можете ткнуть, о каком скандале речь?"
    },
    {
      "id": 21090746,
      "author": "empenoso",
      "datetime": "2020-01-04T14:35:45.000Z",
      "text": "Тоже интересно"
    },
    {
      "id": 21091006,
      "author": "slimper",
      "datetime": "2020-01-04T16:36:38.000Z",
      "text": "Например, тут можно прочитать —www.androidpolice.com/2020/01/03/uh-oh-xiaomi-camera-feed-showing-random-homes-on-a-google-nest-hub-including-still-images-of-sleeping-peopleА вообще писали на всех гиковских зарубежных сайтах."
    },
    {
      "id": 21090644,
      "author": "soir",
      "datetime": "2020-01-04T13:36:36.000Z",
      "text": "А зачем пароли и ssl, если все камеры и устройства находятся в локальной сети?"
    },
    {
      "id": 21091016,
      "author": "slimper",
      "datetime": "2020-01-04T16:37:32.000Z",
      "text": "Соседей много ;)"
    },
    {
      "id": 21091070,
      "author": "empenoso",
      "datetime": "2020-01-04T16:53:35.000Z",
      "text": "внутри вашей локалки? :)"
    },
    {
      "id": 21091404,
      "author": "slimper",
      "datetime": "2020-01-04T19:02:44.000Z",
      "text": "А вдруг"
    },
    {
      "id": 21089886,
      "author": "AURodionov",
      "datetime": "2020-01-04T09:06:22.000Z",
      "text": "Молодец, у самого панелька на выходе и не только, правда все крутится на iobroker"
    },
    {
      "id": 21090248,
      "author": "empenoso",
      "datetime": "2020-01-04T11:08:45.000Z",
      "text": "а что за панель?"
    },
    {
      "id": 21092570,
      "author": "AURodionov",
      "datetime": "2020-01-05T08:56:39.000Z",
      "text": "Планшеты 10 и 7 дюймов, пока в «автокрепежах» но не нравится. Есть идея как сделать удобно"
    },
    {
      "id": 21985780,
      "author": "Teemon",
      "datetime": "2020-08-22T17:41:42.000Z",
      "text": "Придумали как сделать удобно?"
    },
    {
      "id": 21090208,
      "author": "borisxm",
      "datetime": "2020-01-04T11:02:39.000Z",
      "text": "Наверное традиционный вопрос — а что с питанием? Все время на зарядке?"
    },
    {
      "id": 21090268,
      "author": "empenoso",
      "datetime": "2020-01-04T11:12:43.000Z",
      "text": "Мне кажется вариантов не так много или надо ставитьhttps://play.google.com/store/apps/details?id=com.thanksmister.iot.wallpanel&hl=enплюсhttps://github.com/resoai/TileBoard— из этой связки по MQTT можно заряд получать мне подсказывали, а по мере уменьшения заряда — надо физическое реле включать для зарядки и сответственно потом выключать.Надо это надо заморочиться :)"
    },
    {
      "id": 21096112,
      "author": "ValeriVP",
      "datetime": "2020-01-06T14:07:05.000Z",
      "text": "У меня блок питания через реле sonoff включен, а на девайсе установлен macrodroid, который по уровню заряда управляет реле http запросами"
    },
    {
      "id": 21097894,
      "author": "empenoso",
      "datetime": "2020-01-07T07:26:47.000Z",
      "text": "спасибо"
    },
    {
      "id": 21090270,
      "author": "vintage89",
      "datetime": "2020-01-04T11:12:50.000Z",
      "text": "А я рассматриваю монитор с сенсорной панелью (те, что используются в терминалах типа киви и пр.). На Авито можно купить панель+монитор за 1кЭкран 15\". Можно выводить графики и пр. Единственное и самое главное, что я до сих пор не определился нужен ли мне умный дом и если нужен, то зачем"
    },
    {
      "id": 21090272,
      "author": "empenoso",
      "datetime": "2020-01-04T11:13:50.000Z",
      "text": "Если монитор с сенсорной панелью, то это ведь еще что-то типа Raspberry Pi надо ставить"
    },
    {
      "id": 21090274,
      "author": "ogolslava",
      "datetime": "2020-01-04T11:13:56.000Z",
      "text": "Подскажите, чем обусловлен выбор VLC плеера вместо панели HA с видео потоком?На первый взгляд это удобнее, потому так можно выводить элементы управления и видео с камер на одном экране."
    },
    {
      "id": 21090276,
      "author": "empenoso",
      "datetime": "2020-01-04T11:15:14.000Z",
      "text": "Мне надо было, чтобы HA запустил видео с камеры на весь экран планшета, а потом закрыл все приложения. Но Ваш вариант я не пробовал."
    },
    {
      "id": 21508974,
      "author": "renat85",
      "datetime": "2020-04-17T07:22:13.000Z",
      "text": "Попробуйте Ariela. Она может пушить видеопоток по событию + reverse call. Все в push notification. Допускаю что для планшета может быть не удобно, но при этом не нужно дергать планшет закрыть хром, открыть vlc, закрыть vlc, открыть хром."
    },
    {
      "id": 21508976,
      "author": "empenoso",
      "datetime": "2020-04-17T07:22:28.000Z",
      "text": "А что это — Ariela?"
    },
    {
      "id": 21509036,
      "author": "renat85",
      "datetime": "2020-04-17T07:43:56.000Z",
      "text": "Мобильный клиент для home assistant"
    },
    {
      "id": 21091350,
      "author": "lingvo",
      "datetime": "2020-01-04T18:40:21.000Z",
      "text": "У меня уже года четыре трудятся на стенках обыкновенные 7-дюймовые планшеты на Андроиде за 50 баксов. Питание — USB зарядка Apple за ними в подрозетнике + микроUSB плоский кабель.Не понимаю в чем проблема управления планшетами извне. Любой GUI софт (например я использую Commandfusion) помимо кнопочек и циферек, может выводить картинку RSTP с камер. Делаете эту картинку видимой в зависимости от какой-то переменной, которую вам меняет ваш ioBroker, OpenHAB или Home Assistant по MQTT или через Rest API и вуаля — можете показывать ее на планшете и скрывать в любой момент, хоть по датчику, хоть по автоматизации. И все это без хакинга или каких либо манипуляций на любом планшете — что Ipad, что Андроид.У меня камер нет, но я таким образом внешне меняю яркость экранов на планшетах, переводя их в ночной/дневной режим в зависимости от показаний датчика освещенности. В итоге по ночам они не слепят.Я тоже подумывал взять Fire себе для таких целей, но мне нужен был стандартный Андроид, и перепрошивкой я заморачиваться не хотел, поэтому отказался."
    },
    {
      "id": 21091412,
      "author": "slimper",
      "datetime": "2020-01-04T19:07:18.000Z",
      "text": "А я вот свой даже не прошивал, просто выключил все приблуды амазона и поставил гугл сервисы (ютубчик с рецептами на кухне). Все проги какие недоступны в обычном гугл плее — закинул по адб сайдлоад, все заняло минут 20-30. Не знаю, что все так не любят Fire OS, это тот же андроид."
    },
    {
      "id": 21091536,
      "author": "fougasse",
      "datetime": "2020-01-04T20:02:23.000Z",
      "text": "Страшновато в стену зарядные устройства монтировать.Пока у самого дым не пошел из оригинального One Plus устройства при зарядке iPhone — тоже не заморачивался, что удивительно, задымило через час-полтора после подключения, успело оплавить провод usb."
    },
    {
      "id": 21091778,
      "author": "lingvo",
      "datetime": "2020-01-04T21:25:33.000Z",
      "text": "Поэтому я и сую iPhoneовские зарядки. Там схемотехника хорошая."
    },
    {
      "id": 21093756,
      "author": "fougasse",
      "datetime": "2020-01-05T17:05:59.000Z",
      "text": "Есть основания утверждать, что у быстрых зарядок oneplus плохая схемотехника?"
    },
    {
      "id": 21094182,
      "author": "lingvo",
      "datetime": "2020-01-05T20:32:26.000Z",
      "text": "Я не знаю, какая у Oneplus схемотехника. А у iPhone она известная:http://www.righto.com/2012/05/apple-iphone-charger-teardown-quality.htmlПлюс, не у всех зарядок она одинаковая:http://www.righto.com/2012/10/a-dozen-usb-chargers-in-lab-apple-is.html"
    },
    {
      "id": 21094728,
      "author": "empenoso",
      "datetime": "2020-01-06T03:45:31.000Z",
      "text": "а почему источник такой старый 2012 года?"
    },
    {
      "id": 21095590,
      "author": "lingvo",
      "datetime": "2020-01-06T11:05:58.000Z",
      "text": "Когда я свой умный дом делал, он был еще свежим. Может где есть свежие обзоры?"
    },
    {
      "id": 21095768,
      "author": "empenoso",
      "datetime": "2020-01-06T11:56:36.000Z",
      "text": "8 лет прошло с 2012 года"
    },
    {
      "id": 21097458,
      "author": "juDge",
      "datetime": "2020-01-06T23:22:59.000Z",
      "text": "Одна из причин почему не стал вешать именно ноут это вопрос о способе зарядке и собственно постоянно подключенная литий ионная батарея."
    },
    {
      "id": 21097896,
      "author": "empenoso",
      "datetime": "2020-01-07T07:27:58.000Z",
      "text": "может быть достать можно было?"
    },
    {
      "id": 21092248,
      "author": "empenoso",
      "datetime": "2020-01-05T05:47:34.000Z",
      "text": "Спасибо за описание вашего опыта"
    },
    {
      "id": 21091730,
      "author": "aivs",
      "datetime": "2020-01-04T21:07:01.000Z",
      "text": "После установки умного дома сразу понял, что нужна панель управления у входной двери.Выбором девайса не заморачивался, абсолютно без разницы iOS или Android, главное внешний вид приложения. В итоге после покупки нового телефона остался без дела iphone 4. Уже 6 лет используется.habr.com/ru/post/217765"
    },
    {
      "id": 21092250,
      "author": "empenoso",
      "datetime": "2020-01-05T05:48:22.000Z",
      "text": "Спасибо, как раз вашу статью читал перед написанием своей"
    },
    {
      "id": 21091754,
      "author": "juDge",
      "datetime": "2020-01-04T21:13:14.000Z",
      "text": "В неспешной доработке самодельная панель на Raspberry Pi и тачь скрине. Все потраха уходят в стену. Интерфейс под нее самописный. Отчасти работает поверх Home Assistant и отчасти свой. Например Видео с домофона идет минуя HA. Опять же всплывают окна уведомления и предпросмотра, если домофон замечает движения перед дверью. Был вариант написать свой лаунчер под андроид чтобы запускало веб интерфейс вместо обоев… но пока остановился на таком варианте. Показан не весь функционал но суть понятнаwww.youtube.com/watch?v=92cfxMapaZY… пока больше еще пытаюсь сформировать саму автоматизацию на HA… а на экран выведу уже конкретные задачи… остальная часть будет просто работать в авто режиме."
    },
    {
      "id": 21092252,
      "author": "empenoso",
      "datetime": "2020-01-05T05:49:21.000Z",
      "text": "Спасибо, но не понял — извне можно управлять или нет?"
    },
    {
      "id": 21097470,
      "author": "juDge",
      "datetime": "2020-01-06T23:30:14.000Z",
      "text": "Почему нет. Автоматизация идет через HA… через стандартное их приложение если есть доступ до самого HA. А панель это удобоваримая комбинация разрозненных да и просто функционала с HA. Но при желании интерфейс можно открыть обычном браузере. Но особого смысла в этом нет. Тот же домофон через Астериск принимает вызовы с домофона напрямую в смарт.Но не совсем понятно что там управлять… на то оно и умный дом, чтобы само решало что ему делать. HA Получает координаты от гугла и решает что надо все отключить… и свет и отопление. Либо по приходу хозяев до дома, запустить отопление в рабочий режим. Все остальное просто работает в авторежиме. Единственные выключатели которые по сути могут понадобиться это «Гостевой режим» (включение виртуального хозяина, оживляет дом как будто хозяева дома) и включение выключение автоматизации по датчикам движения (не всегда нужен)"
    },
    {
      "id": 21092082,
      "author": "sisaenkov",
      "datetime": "2020-01-05T01:11:40.000Z",
      "text": "Тоже использовал несколько лет вяло планшет в прихожей, а сейчас отказался от этой идеи, ибо телефон всегда под рукой. При этом, у двух планшетов от такого режима сдохли батареи, пока не добавил отключение зарядки по расписанию."
    },
    {
      "id": 21092158,
      "author": "tmin10",
      "datetime": "2020-01-05T04:02:12.000Z",
      "text": "Подскажите, а почему планшет вверх ногами? Порт зарядки тоже наверху стал."
    },
    {
      "id": 21092176,
      "author": "sisaenkov",
      "datetime": "2020-01-05T04:34:08.000Z",
      "text": "Чтобы провод был равномерно распределен на всю длину от розетки до разъема, и чтобы не вываливался из этого самого разъема."
    },
    {
      "id": 21092258,
      "author": "empenoso",
      "datetime": "2020-01-05T05:52:21.000Z",
      "text": "А я по моему ваши статью про z-wave и кошачий туалет читал лет пять назад, когда только начинал увлекаться умными домами :)"
    },
    {
      "id": 21092262,
      "author": "sisaenkov",
      "datetime": "2020-01-05T05:56:34.000Z",
      "text": "Было дело :)Сейчас иногда в вялотекущем режиме что-то такое делаю:www.youtube.com/watch?v=voNgwWWmwW8"
    },
    {
      "id": 21092526,
      "author": "lingvo",
      "datetime": "2020-01-05T08:40:02.000Z",
      "text": "Может просто неудачно выбрали место расположения планшета? У меня они стоят в комнатах на месте выключателей, поэтому используются постоянно. А в коридоре наоборот нет ни одного."
    },
    {
      "id": 21092538,
      "author": "sisaenkov",
      "datetime": "2020-01-05T08:43:07.000Z",
      "text": "Мне не подошёл сам формат того, что нужно куда-то идти для управления."
    },
    {
      "id": 21093108,
      "author": "buttons",
      "datetime": "2020-01-05T12:37:53.000Z",
      "text": "Когда организовал у себя панель понял, что фиксированное управление ненужно из-за непрактичности. Когда в доме до*** и больше устройств (больше 100), то управление через экран парит. В большинстве ситуации всё равно управляешь голосом или автоматика работает. Поэтому это панели отказался и тупо вывел на неё камеру над входной дверью. Раз уж повесил. Сейчас бы я этого не делал"
    },
    {
      "id": 21093178,
      "author": "Urvdmih",
      "datetime": "2020-01-05T13:04:52.000Z",
      "text": "Блин. На эту роль так и просятся планшеты с E-Ink + тач экраном и питанием через POE/слаботочку/беспроводную зарядку. Жаль таких (готовых) нет, да и цена на E-Ink все еще кусачая."
    },
    {
      "id": 21093208,
      "author": "empenoso",
      "datetime": "2020-01-05T13:16:28.000Z",
      "text": "а камеру на него разве можно вывести?"
    },
    {
      "id": 21107102,
      "author": "antex_dom",
      "datetime": "2020-01-09T14:03:44.000Z",
      "text": "Ух как это давно было, в 2014г. занимались умными домами, ставили вот такие:Панель управления APLEX ARCHMI-710PПрошу прощение за качество картинки, скрин со старого рекламного видео.Под эти панели заранее делали ниши в стене (можно сделать себе при замене обоев) держится эта панель на одной пружине, которая все время тянет панель к стене.APLEX ARCHMI-710P сегодня стоят 70т.р. (30т.р. в 2014г) отдать должное уже пятый год молотят 24\\7. Себе панель не делал, т.к. уже пять лет назад понял, что карманный телефон удобнее, а в стыковке с Apple+HomeKit незаменимая вещьhabr.com/ru/post/476540В то время намучилась с центральным промконтроллером (постоянно зависал) от Российской фирмы, недавно заменили на нашу разработку:Рисунок 3 — Устройство AntexGatehabr.com/ru/post/476686"
    },
    {
      "id": 21107188,
      "author": "empenoso",
      "datetime": "2020-01-09T14:20:31.000Z",
      "text": "Спасибо, но или 1,5 т.р. или 70 т.р. кажется есть большая разница в цене :)А я пользуюсь проводнымMegaD-2561— он тоже российский."
    },
    {
      "id": 21109742,
      "author": "antex_dom",
      "datetime": "2020-01-10T06:26:35.000Z",
      "text": "Для заказчика экономия может обернуться плохой репутацией.Но для себя я думал над следующим вариантом:Заголовок спойлераЭто рамки для выключателей (Итальянский стандарт), для них так-же есть подрозетники, идея в том, чтобы в такую рамку положить Raspberry c сенсорным дисплеем (а может и смартфон)."
    },
    {
      "id": 21109848,
      "author": "lingvo",
      "datetime": "2020-01-10T07:00:25.000Z",
      "text": "На Кикстартере был хороший аналогичный проект, который я поддержал. К сожалению он не набрал нужной суммы.https://www.kickstarter.com/projects/159751026/23-smarthome-touch-display-w-wlan-for-55mm-switch-series/descriptionТам только не итальянский стандарт, а немецкий."
    },
    {
      "id": 21109948,
      "author": "antex_dom",
      "datetime": "2020-01-10T07:21:59.000Z",
      "text": "Ну просто в итальянца можно покрупнее дисплей положить, особенно 3x2 клавиши. А вообще идеально смотрится алюминий, всем кто хочет красиво и не дорого (до 5000р) берите кусок алюминия 3-5мм и к фрезеровщику.Это панель ОВЕН они таких несколько выпустили и закрыли лавку, но в эту рамку потом отлично Ipad затолкали."
    },
    {
      "id": 21110122,
      "author": "lingvo",
      "datetime": "2020-01-10T08:04:45.000Z",
      "text": "Ну просто в итальянца можно покрупнее дисплей положить, особенно 3x2 клавиши.Недостаток в том, что для него надо предусматривать нишу заранее или долбать стену. ИМХО, если уж ставить большой планшет, то крепление должно быть плоским, под стандартный 55мм подрозетник. Но итальянские рамки, скорей всего, с таким подрозетником несовместимы."
    },
    {
      "id": 21112950,
      "author": "antex_dom",
      "datetime": "2020-01-10T14:51:53.000Z",
      "text": "Нет несовместимы, они как единая целая часть, хотя однопостовый такой же. Но для немецкого тоже долбить, тут просто разница в размере отверстия, если аккуратно подойти к вопросу, то на месте выключателя можно аккуратно увеличить отверстие."
    },
    {
      "id": 21110230,
      "author": "empenoso",
      "datetime": "2020-01-10T08:29:23.000Z",
      "text": "вы говорите про коммерческий заказ, но я ведь искал и использовал для себя"
    },
    {
      "id": 21107180,
      "author": "DrIgor",
      "datetime": "2020-01-09T14:18:11.000Z",
      "text": "Может кто-нибудь может поделиться опытом установки планшета в стеклянную стену?Офисная стеклянная перегородка с вертикальными металлическими профилями. Хочетсяэстетичнозакрепить планшет и подвести к нему питание"
    },
    {
      "id": 21107526,
      "author": "lingvo",
      "datetime": "2020-01-09T15:17:17.000Z",
      "text": "Если это офисная перегородка, то она, скорей всего закаленная. Сверлить не получится, надо новую заказывать.А фото профилей есть?"
    },
    {
      "id": 21108082,
      "author": "DrIgor",
      "datetime": "2020-01-09T17:09:59.000Z",
      "text": "Сверлить стекло я не собирался, но думаю, что крепеж к нему можно приклеить. К сожалению, это не решает проблему красивого подведения проводов.Перегородки системы ALUTECH ALT111, профиль металлический, примерно прямоугольного сечения. Дверь устанавливается между двумя вертикальными профилями. Вот как раз рядом с дверью и логично установить планшет.Вдохновившись ссылками из комментариев, нашел такую штуку:https://hecklerdesign.com/multi-mount-for-ipad-mini/Заголовок спойлераНо дороговато, пока что попробуем наколхозить чего-нибудь сами)"
    },
    {
      "id": 21110154,
      "author": "antex_dom",
      "datetime": "2020-01-10T08:12:21.000Z",
      "text": "Вот можно к дизайнерам обратиться, они вам из оргстекла за шапку сухарей такую штуку сделают, просто в центре вырез необходим для дисплея вместо картины.Оргстекло должно быть не прозрачным, чтобы спрятать провода."
    },
    {
      "id": 21143708,
      "author": "Cyl",
      "datetime": "2020-01-16T18:51:18.000Z",
      "text": "Как в воду смотрел и прав был, когда замутил от скуки в позапрошлом году свою идею.Автор поста, равно как и другие ардуинщики, малиноводы и прочие андерталцы.В своих проектах в качестве приборных и прочих панелей применяю планшеты под OC Win 10.Питание переделывается под стационарное ~220/DC 5V, так же соответственно все лишнее вычищается из винды с переводом в режим домашнего ПК.Весь софт строится на LabView с компиляцией инсталянт с *.exe исходником.В качестве драйверов применяются USB ADC/DAC с обращением через UART интерфейс. При желании можно и применить DTMF управление на бренде 8870.Варианты как с ручным управлением с тач панели планшетников, так и полный сценарийный автомат без Вашего участия.Этот проект с перерывами стартовал в 2017 г. и если ничего не помешает, будет публично выставлен к реализации. По ряду организационных соображений, некоторые детали пока скрыты на модерацию. На хабре не делаю публикаций, т.к. не писарь я.https://youtu.be/UQtaQyRavZQ"
    },
    {
      "id": 21145498,
      "author": "empenoso",
      "datetime": "2020-01-17T07:37:00.000Z",
      "text": "Да вы мастер развешивать ярлыки.Win 10 просто увеличивает стоимость всего в том числе за счет аппаратных требований и главное зачем?"
    },
    {
      "id": 21145638,
      "author": "vladkorotnev",
      "datetime": "2020-01-17T08:00:22.000Z",
      "text": "Если я правильно помню цены на лабвьюшные ЦАПы и АЦПы, то винда здесь далеко не самая дорогая компонента :-)"
    },
    {
      "id": 21145850,
      "author": "Cyl",
      "datetime": "2020-01-17T08:33:43.000Z",
      "text": "А зачем на юзеровский комплект заливать среду разработки? Для работы аппликации вполне хватит присутствия в инсталянте Runtime eng.В противовес NI цапам существует масса альтернатив за копейки.Что касается оси, она присутствует со всеми гарантиями и лицензиями на покупаемой железке и в куче это ничуть не дорожа, больше скажу, дешевле в разы, чем голая малина без графики, экрана и т.п. Да и головняка с ней в разы больше по настройке и привязкам."
    },
    {
      "id": 21145824,
      "author": "Cyl",
      "datetime": "2020-01-17T08:29:26.000Z",
      "text": "Для управления шторами, светом, чайником, видеокамерой авторская затея вполне годится. Для более серьезных проектов, без оси никуда, где не на последнем месте мультифункциональность, эргономичность, многоплатформенность и адаптация к меняющимся тенденциям на одних микропроцессорных шилдах Вы никуда не продвинетесь.Продемонстрируйте мне хотя бы 1 отраслевой пример полной локальной многозадачной автоматизации.Я не беру в расчёт разные светящиеся табло, весы, домашнюю автоматику и т.п.Все поиски в гугле, в редких исключениях, дальше умных домов не идут.Здесь где-то на хабре такая дискуссия уже присутствует."
    }
  ]
}