{
  "url": "https://habr.com/ru/articles/485848/comments/",
  "article_id": 485848,
  "title": "Как я 1000 дней пользовался OpenHAB, а затем перешел на Home Assistant",
  "comments": [
    {
      "id": 21207498,
      "author": "3err0",
      "datetime": "2020-01-30T02:22:50.000Z",
      "text": "Разворачиваю у себя в частном доме, систему умного дома изначально смотрел в сторону OpenHab, но купив Raspbery PI B3++, решил сразу поставить HomeAssistant, так как сам в кодинге на питоне (что позволяет писать для него свои автоматизации за счет скриптов), ни сколько не разочаровался в выборе этого продукта."
    },
    {
      "id": 21207530,
      "author": "empenoso",
      "datetime": "2020-01-30T02:42:15.000Z",
      "text": "Да, очень многое можно решить правилами в Home Assistant"
    },
    {
      "id": 21207518,
      "author": "sav13",
      "datetime": "2020-01-30T02:34:19.000Z",
      "text": "А никто не сравнивал HomeAssistant и MajorDoMo?"
    },
    {
      "id": 21207528,
      "author": "empenoso",
      "datetime": "2020-01-30T02:41:39.000Z",
      "text": "Я читал про MajorDoMo, но сам не пробовал"
    },
    {
      "id": 21208360,
      "author": "renat85",
      "datetime": "2020-01-30T07:49:31.000Z",
      "text": "Majordomo более геморойное добавление устройств. Не всегда очивидное. Хотя коммьюнити у них большое."
    },
    {
      "id": 21210248,
      "author": "RomanKu",
      "datetime": "2020-01-30T12:47:18.000Z",
      "text": "Я изначально ставил MajorDoMo — он дикий тормоз и убийца флешек, на старенькой флешке часто отваливался по таймауту генерации страниц, особенно при работе с плагинами, по отзывам может затереть флешку за пару месяцев.Что еще добило, так это то, что он очень тупой в качестве настройки интерфейса, надо быть дизайнером, чтоб нарисовать красивый интерфейс, а потом ты открываешь его на планшете и половина интерфейса не помещается на нем и приходится передвигать элементы. Может быть я просто не умею его готовить и у меня руки не из того места растут, но я от него отказался через неделю.Перешел на связку MQTT + HomeAssistant + Node-REDHomeAssistant ощутимо шустрее за счет Python и SPA + нормальный адаптив под разные типы устройств + красивые карточки для тех, что не хочет заниматься с рисованием плана помещения и попиксельной расстановкой компонентовВ плане сложных автоматизаций HomeAssistant плох и либо писать скрипты на питоне, либо использовать Node-Red.Например, я сделал объект выключателя в HomeAssistant «колыбельная», а в node-red по mqtt событию включается воспроизведение аудиопотока с локального сервера на GoogleHome Mini с возможностью остановить воспроизведение и отслеживанием текущего состояния воспроизведения и прочими синхронизациями этого выключателя в HomeAssistant. Теперь можно Алису голосом попросить «включить колыбельную»Ну иHomeAssistant MQTT Discoveryэто явно киллер-фича проекта, которая рвет остальные проекты в клочья. zigbee2mqtt, tasmota и другие проекты интегрируются с HomeAssistant легко и глубоко."
    },
    {
      "id": 21214296,
      "author": "empenoso",
      "datetime": "2020-01-31T09:07:33.000Z",
      "text": "Спасибо за ваш отзывRomanKu"
    },
    {
      "id": 21207658,
      "author": "arozhankov",
      "datetime": "2020-01-30T04:33:41.000Z",
      "text": "Очень многие, кому требуется продвинутая автоматизация, уходят на node-red.Вы пробовали этот инструмент?"
    },
    {
      "id": 21207756,
      "author": "empenoso",
      "datetime": "2020-01-30T05:11:03.000Z",
      "text": "Слышал, что его используют в связке с OpenHAB, но сам не пробовал."
    },
    {
      "id": 21208376,
      "author": "renat85",
      "datetime": "2020-01-30T07:50:51.000Z",
      "text": "Node-red можно интегрировать в home assistant, если не хватает гибкости его правил. А дальше уже на что хватит фантазии."
    },
    {
      "id": 21207792,
      "author": "sevmax",
      "datetime": "2020-01-30T05:18:16.000Z",
      "text": "А как насчёт Google Home?Сравнивали его с Home Assistant?"
    },
    {
      "id": 21207814,
      "author": "empenoso",
      "datetime": "2020-01-30T05:26:49.000Z",
      "text": "Google Home (мы про динамик?) можно добавить в Home Assistant и отправлять на него голосовые оповещения — я так делал"
    },
    {
      "id": 21210320,
      "author": "RomanKu",
      "datetime": "2020-01-30T12:58:35.000Z",
      "text": "Google Home, Алиса и прочие это просто интерфейс для нормальной системы автоматизации их надо рассматривать не какили, а как совместное использование. Например, у меня в HomeAssistant заведены все устройства и автоматизации, а он уже экспортирует что мне надо в GH и Алису для голосового управления.Английский Google Home умеет запускать автоматизации из HomeAssistant по своим правилам.Google Home, Алиса, Alexa, HomeKit — это не умный дом, это удобные пульты для устройств, но никак не комплексные решения."
    },
    {
      "id": 21214312,
      "author": "empenoso",
      "datetime": "2020-01-31T09:09:21.000Z",
      "text": "Поддерживаю"
    },
    {
      "id": 21210648,
      "author": "lingvo",
      "datetime": "2020-01-30T13:49:06.000Z",
      "text": "Да, лучше считать, что Google Home или Siri — это просто интерфейс взаимодействия с HA, как, например, планшет и телефон.И в этом плане их возможности автоматизации будут скорей вам мешать, чем дополнять систему. То есть если вы зададите какое-то правило или сценарий в Google Home, то оно будет работать только в случае, если вы его активируете тоже голосом или из родного приложения. Но тогда из интерфейса Home Assistant оно будет недоступно. Также усложнится отслеживание текущего состояния устройств (т.е. надо следить, например, что если вы включили какое-то устройство из GH, то оно и в других местах должно отображаться, как включенное и иметь возможность его выключить из другого приложения, а ГХ это должен отследить). HA и другие берут на себя такие действия для простых устройств, но со сценариями это будет гораздо сложнее."
    },
    {
      "id": 21207858,
      "author": "it_pm",
      "datetime": "2020-01-30T05:57:59.000Z",
      "text": "Откуда картинка?"
    },
    {
      "id": 21207866,
      "author": "empenoso",
      "datetime": "2020-01-30T05:59:14.000Z",
      "text": "Какая именно? Все скриншоты мои"
    },
    {
      "id": 21207964,
      "author": "Francyz",
      "datetime": "2020-01-30T06:41:05.000Z",
      "text": "Если вы про гифку в начале, то скорее всего это мульт «Богатенький Ричи»."
    },
    {
      "id": 21208062,
      "author": "aydahar",
      "datetime": "2020-01-30T07:02:17.000Z",
      "text": "А есть ли варианты с широким функционалом, но без написания сотен строк кода?Т.е. сложнее и функциональнее какого-нибудь Mi Home, но проще OpenHub (и подобных)?"
    },
    {
      "id": 21208332,
      "author": "empenoso",
      "datetime": "2020-01-30T07:46:52.000Z",
      "text": "Home Assistant кажется мне довольно таки простым. Но не без своих заморочек конечно"
    },
    {
      "id": 21208076,
      "author": "Materializator",
      "datetime": "2020-01-30T07:06:13.000Z",
      "text": "Можно ли использовать компоненты Xiaomi Smarthome, причём не только с ,wifi интерфейсом, а с ZigBee?Удобно, красиво, популярно — но через облако производителя. А мне нужно в своей инфраструктуре."
    },
    {
      "id": 21208172,
      "author": "pavelpromin",
      "datetime": "2020-01-30T07:25:56.000Z",
      "text": "Да,https://youtu.be/cyxcQS441tc"
    },
    {
      "id": 21208318,
      "author": "empenoso",
      "datetime": "2020-01-30T07:45:26.000Z",
      "text": "вот например:https://habr.com/ru/post/462459/"
    },
    {
      "id": 21208328,
      "author": "empenoso",
      "datetime": "2020-01-30T07:46:07.000Z",
      "text": "или вот еще вариант:https://phoscon.de/en/conbee2"
    },
    {
      "id": 21208400,
      "author": "renat85",
      "datetime": "2020-01-30T07:52:52.000Z",
      "text": "Добавляете шлюз xiaomi в home assistant и дальше он пробрасывает все подключенные к нему zigbee устройства."
    },
    {
      "id": 21208426,
      "author": "empenoso",
      "datetime": "2020-01-30T07:56:02.000Z",
      "text": "просто еще есть вариант что zigbee устройства и без шлюза xiaomi:https://phoscon.de/en/conbee2"
    },
    {
      "id": 21208444,
      "author": "renat85",
      "datetime": "2020-01-30T07:58:05.000Z",
      "text": "Я использую zigbe2mqtt. Conbee координаторы достаточно дорогие. CC2531 дешевле и мне пока хватает."
    },
    {
      "id": 21208488,
      "author": "empenoso",
      "datetime": "2020-01-30T08:02:39.000Z",
      "text": "А CC2531 по надежности как?"
    },
    {
      "id": 21208504,
      "author": "renat85",
      "datetime": "2020-01-30T08:05:07.000Z",
      "text": "Пока статистика только за 4 мес. Работает, отказов нет. Для меня также не маловажно, что стик шьется этим проектом на версию Zigbee 3.0 и спокойно поддерживает все новые устройства, в частности новенькие Aqara Opple."
    },
    {
      "id": 21208556,
      "author": "empenoso",
      "datetime": "2020-01-30T08:10:54.000Z",
      "text": "Спасибо"
    },
    {
      "id": 21210018,
      "author": "levkib",
      "datetime": "2020-01-30T12:09:05.000Z",
      "text": "Зайдите на kvvhost.ru или sprut.ai, там хорошо расписано. У меня работают датчики и выключатели Xiaomi с HomeAssistant через zigbee2mqtt со стиком на CC2531"
    },
    {
      "id": 21210034,
      "author": "empenoso",
      "datetime": "2020-01-30T12:11:13.000Z",
      "text": "kvvhost.ru отличный ресурс"
    },
    {
      "id": 21208334,
      "author": "renat85",
      "datetime": "2020-01-30T07:47:04.000Z",
      "text": "Согласен с резюме автора. Сам также прошел такой путь. Последним триггером перехода на HA стало то что я почти месяц бился с OH 2.1 по затаскиванию шлюза Xoaomi, а тестовый запуск HA сделал это автоматом и за секунду. С тех пор не разу не жалею."
    },
    {
      "id": 21208372,
      "author": "empenoso",
      "datetime": "2020-01-30T07:50:29.000Z",
      "text": "Я тоже"
    },
    {
      "id": 21208336,
      "author": "Alexey_Neonov",
      "datetime": "2020-01-30T07:47:10.000Z",
      "text": "Сразу стал использовать MajorDomo, так как более-менее знал php. Не буду утверждать что он лучше чем другие системы, потому как не юзал больше ничего, но MD как то полюбился свободой действий."
    },
    {
      "id": 21208378,
      "author": "empenoso",
      "datetime": "2020-01-30T07:51:35.000Z",
      "text": "Присматривался тоже, но не смог понять в чем именно для меня будет преимущество MajorDomo."
    },
    {
      "id": 21208490,
      "author": "Tahallus",
      "datetime": "2020-01-30T08:02:40.000Z",
      "text": "Было бы интересно почитать статью где расскажите какое оборудование используете в квартире и как все это устанавливали"
    },
    {
      "id": 21208602,
      "author": "empenoso",
      "datetime": "2020-01-30T08:15:09.000Z",
      "text": "Конкретно в этой квартире:MegaD-2561:https://www.ab-log.ru/smart-house/ethernet/megad-2561Датчики с али для MegaD-2561.Wifi IoT Relay Board Based on ESP8266:https://www.electrodragon.com/product/wifi-iot-relay-board-based-esp8266/Sonoff Basic WiFi Wireless Switch:https://www.itead.cc/smart-home/sonoff-wifi-wireless-switch.htmlЭлектронакладки на краны на воду с али.Конктактор, который отключает всё, кроме роутера."
    },
    {
      "id": 21212160,
      "author": "shadson",
      "datetime": "2020-01-30T19:06:07.000Z",
      "text": "\"Электронакладки на краны на воду с али.\" — а можно пример (ссылку на ali)?Хочу понять что это штука. Вы меряете температуру воды (на скринах есть пара DS18B20)?Мне тоже нужно такое реализовать, а не знаю как подойти к поисковому запросу на али.Спс"
    },
    {
      "id": 21214332,
      "author": "empenoso",
      "datetime": "2020-01-31T09:12:39.000Z",
      "text": "\"лектрический DC8-16V автоматический 1.6MPa манипулятор запорный клапан\"честно говоря не рекомендую их"
    },
    {
      "id": 21216248,
      "author": "shadson",
      "datetime": "2020-01-31T14:44:06.000Z",
      "text": "А, ну это задвижки моторизованные.А как Вы температуру по кранам меряете?У меня пока самая нормальная идея — DS18B20 (в гильзе) через КПТ-8 намертво заклеить чем-то к железной гайке труб, которые входят и выходят из бойлера."
    },
    {
      "id": 21217848,
      "author": "empenoso",
      "datetime": "2020-02-01T03:07:27.000Z",
      "text": "как-то так у меня:"
    },
    {
      "id": 21222098,
      "author": "shadson",
      "datetime": "2020-02-02T19:40:25.000Z",
      "text": "Да, где-то так и придётся, только я бы на Вашем месте как-то теплоизолировал всё это чудо техники.PS: Когда уже весь водопровод был установлен, вот такие штуки на али обнаружились:"
    },
    {
      "id": 21223212,
      "author": "empenoso",
      "datetime": "2020-02-03T07:40:56.000Z",
      "text": "спасибо!"
    },
    {
      "id": 21223276,
      "author": "ksv811212",
      "datetime": "2020-02-03T07:59:20.000Z",
      "text": "А можно ссылку, или ключевые слова по которым искать, пожалуйста."
    },
    {
      "id": 21223300,
      "author": "shadson",
      "datetime": "2020-02-03T08:02:11.000Z",
      "text": "https://www.aliexpress.com/wholesale?SearchText=thermo+well+1%2F2"
    },
    {
      "id": 21208644,
      "author": "empenoso",
      "datetime": "2020-01-30T08:19:52.000Z",
      "text": "а вот с установкой это проблема :)))"
    },
    {
      "id": 21210454,
      "author": "Tahallus",
      "datetime": "2020-01-30T13:18:20.000Z",
      "text": "Вы на этапе строительства/ремонта все закладывали? Или уже в процессе?"
    },
    {
      "id": 21214334,
      "author": "empenoso",
      "datetime": "2020-01-31T09:12:56.000Z",
      "text": "здесь в процессе"
    },
    {
      "id": 21208512,
      "author": "bubble",
      "datetime": "2020-01-30T08:07:03.000Z",
      "text": "Когда я выбирал между OpenHAB и Home Assistant, то прочитал множество тредов на пользовательских форумах. Почерпнул из прочитанного — openHAB стабильно работает, но тяжело настраивается, Home Assistant — наоборот. Меня сложности настройки не отпугнули, и вот уже 3 года у меня дома стабильно работает OH. Аптайм обнуляется только при выключении электричества. Ну или когда я сам перезагружаю комп. А как с аптаймом у HA?"
    },
    {
      "id": 21208576,
      "author": "renat85",
      "datetime": "2020-01-30T08:12:49.000Z",
      "text": "А можно поподронее про стабильность home assistant? Уже почти 2 года использую на rpi3, без каких либо проблем со стабильностью."
    },
    {
      "id": 21208636,
      "author": "empenoso",
      "datetime": "2020-01-30T08:18:25.000Z",
      "text": "От карты памяти на rpi3 тоже зависит"
    },
    {
      "id": 21208656,
      "author": "renat85",
      "datetime": "2020-01-30T08:21:20.000Z",
      "text": "Ну карту я в расчет не беру. Глупо строить систему уд на картах сали за 99 центов )"
    },
    {
      "id": 21208678,
      "author": "empenoso",
      "datetime": "2020-01-30T08:24:43.000Z",
      "text": "да, но в основном проблемы из-за карт памяти возникают — насколько везде читал"
    },
    {
      "id": 21208720,
      "author": "renat85",
      "datetime": "2020-01-30T08:29:57.000Z",
      "text": "Карта вообще зло, у меня уже раз дохла samsung evo+. На выходных надеюсь уже перейду на nuc подобную платформу от gigabyte с нормальным ssd диском."
    },
    {
      "id": 21209930,
      "author": "t3sc0",
      "datetime": "2020-01-30T11:55:56.000Z",
      "text": "есть вариант с адаптером sd to mmc, они вроде подольше живут. а так да, купил под апгрейд УД rpi4, но в последний момент поменял на nuc с ssd"
    },
    {
      "id": 21209974,
      "author": "empenoso",
      "datetime": "2020-01-30T12:04:36.000Z",
      "text": "вариант с адаптером sd to mmc резко дороже?"
    },
    {
      "id": 21210504,
      "author": "t3sc0",
      "datetime": "2020-01-30T13:26:07.000Z",
      "text": "не совсем точно написал название. я имел в видуподобноеработает не быстрее, но дольше"
    },
    {
      "id": 21214338,
      "author": "empenoso",
      "datetime": "2020-01-31T09:13:55.000Z",
      "text": "спасибо"
    },
    {
      "id": 21208846,
      "author": "lingvo",
      "datetime": "2020-01-30T08:49:06.000Z",
      "text": "И блока питания. Нужно брать для RPi с выходом 5.1В и током 2А+"
    },
    {
      "id": 21208892,
      "author": "empenoso",
      "datetime": "2020-01-30T08:53:25.000Z",
      "text": "Да"
    },
    {
      "id": 21208670,
      "author": "bubble",
      "datetime": "2020-01-30T08:23:18.000Z",
      "text": "Я сделал для себя вывод по прочитанному на формуах, это было больше трех лет назад. Вполне возможно, что ситуация с устойчивостью изменилась. Поэтому и спрашиваю, как с аптаймом у HA?"
    },
    {
      "id": 21208690,
      "author": "empenoso",
      "datetime": "2020-01-30T08:26:15.000Z",
      "text": "Все работает. Периодически обновляю на новые версии. Только один раз было что после обновления перестала работать функция — громкость теперь по другому в правилах регулировать надо"
    },
    {
      "id": 21208704,
      "author": "renat85",
      "datetime": "2020-01-30T08:28:06.000Z",
      "text": "Мне сложно судить по аптайму, потому как раз в месяц система стабильно перезапускается мной при апгрейде на новую версию. Но за все время, я не разу не столкнулся с неожиданным зависанием сервера в момент работы."
    },
    {
      "id": 21208738,
      "author": "empenoso",
      "datetime": "2020-01-30T08:32:06.000Z",
      "text": "У меня тоже не было на HA"
    },
    {
      "id": 21208620,
      "author": "empenoso",
      "datetime": "2020-01-30T08:16:41.000Z",
      "text": "openHAB на самом деле у меня последний раз около года наверное без переустановки и вмешательств работал, но и с Home Assistant сейчас тоже нет проблем"
    },
    {
      "id": 21208724,
      "author": "bubble",
      "datetime": "2020-01-30T08:30:45.000Z",
      "text": "Значит, проблемы устойчивости пофиксили. Читал, что в Home Assistant есть таймеры, которые легко можно прикручивать к любому подключенному устройству и программировать их визуально. Это единственное, чего мне не хватает в OpenHAB. В OH для создания таймера нужно писать отдельный скрипт на каждое правило и это бооооль."
    },
    {
      "id": 21208744,
      "author": "empenoso",
      "datetime": "2020-01-30T08:33:41.000Z",
      "text": "В Home Assistant появился конструктор, но на YAML как-то привычнее. И переносить потом проще строчки кода чем из конструктора — как их вообще достать оттуда."
    },
    {
      "id": 21208570,
      "author": "lingvo",
      "datetime": "2020-01-30T08:12:18.000Z",
      "text": "Хмм. У меня почти как у вас, только конец другой. Я остался на OpenHAB.Вкратце — вначале 2016г я с нуля делал умный дом в квартире. Остановился на Rpi2 + Z-wave + Openhab 1.8 + тач-панели на MQTT протоколе. Но с правилами у меня особенность — мне сразу не понравился OpenHAB Rule Engine, так как там отсутствовала нормальная отладка и я сделал все правила в NodeRED. У меня в профилеесть статья по этому поводу. Т.е. Openhab использовался в основном для управления через телефон и Веб и в качестве хаба для конвертации между протоколами MQTT, Z-wave и REST API.Всего за все время добавилось примерно 30 Z-wave устройств, пара Sonoff девайсов и куча правил.В итоге до лета 2019 года все работало без проблем и очень стабильно. В 2019 я решил проапгрейдится на RPI3 и заодно решил обновить и софт, в основном из-за Z-wave — появились новые устройства, поддержка для которых была только в новых биндингах, а с добавлением их в старый я не хотел возиться. Также появились кондиционеры с Вай-фаем, которые я тоже хотел добавить в УД и со старой версией это было проблематично (как оказалось и с новой тоже и в итоге спас опять же NodeRED)Я сразу встал перед выбором — либо переходить на OH2.4, а точнее OpenHABian, так как он работает просто из коробки. Либо глянуть на Home Assistant.Начал я с HomeAssistant, все установил, Z-wave заработал, но я споткнулся об MQTT. В HomeAssistant у меня не заработал вариант, в котором бы все сообщения от Z-wave конвертировалсь в MQTT и наоборот. Поддержки на форуме я не получил и в итоге через двое суток мучений я его снес и поставил OpenHABian.Не скажу, что с OpenHABian миграция прошла намного лучше. Пришлось пересоздать почти все точки и веб-странички, но мне не пришлось переписывать ни одно из правил, и это огромный плюс (с HA, конечно, я б тоже правила не переписывал бы).Также были проблемы со стабильностью, пока я не выяснил, что старая версия MQTT биндинга конфликтовала с новой. Но в итоге все устаканилось и сейчас я на OH2.4.Кстати весело наблюдать, как меняются предпочтения по платфорам для УД. В 2016 году были популярны OpenHAB и MajorDomo. Честно, я думал, что сильно поднимется ioBroker. А в итоге сейчас стал популярен HomeAssistant, про который в 2016-ом никто не знал."
    },
    {
      "id": 21208674,
      "author": "empenoso",
      "datetime": "2020-01-30T08:23:37.000Z",
      "text": "А кто у вас выступает Z-wave контроллером?Вы все устройства после переустановки пере привязывали к контроллеру?"
    },
    {
      "id": 21208692,
      "author": "lingvo",
      "datetime": "2020-01-30T08:26:16.000Z",
      "text": "Z-wave контроллером выступает Aeon Z-wave USB Stick Gen.5Устройства перепривязывать не надо, так как они запоминаются USB стиком и что OpenHAB, что Home Assistant их просто оттуда считывает и распознает по типам. Их только нужно по новой пообзывать типа \"Диммер в Спальне — Люстра\", \"RGB лента на кухне\" и т.д."
    },
    {
      "id": 21208698,
      "author": "empenoso",
      "datetime": "2020-01-30T08:27:02.000Z",
      "text": "Спасибо"
    },
    {
      "id": 21208640,
      "author": "ral",
      "datetime": "2020-01-30T08:19:15.000Z",
      "text": "я думаю в этом году про Gladys Assistant."
    },
    {
      "id": 21208650,
      "author": "empenoso",
      "datetime": "2020-01-30T08:20:46.000Z",
      "text": "а это что?https://yandex.ru/search/?text=Gladyss"
    },
    {
      "id": 21208844,
      "author": "renat85",
      "datetime": "2020-01-30T08:48:45.000Z",
      "text": "Мне кажется это это:https://gladysassistant.com/en/Судя по документации, поддержка устройств минимальна."
    },
    {
      "id": 21208898,
      "author": "empenoso",
      "datetime": "2020-01-30T08:54:24.000Z",
      "text": "Ещё и с платной подпиской 9.99€/month ...."
    },
    {
      "id": 21208970,
      "author": "renat85",
      "datetime": "2020-01-30T09:03:41.000Z",
      "text": "У ha то же есть nabucasa, но при этом никак не лимитируется функциональность без нее."
    },
    {
      "id": 21208984,
      "author": "empenoso",
      "datetime": "2020-01-30T09:06:16.000Z",
      "text": "слышал про nabucasa, но сам не использовал никогда — вроде как nabucasa, если не хочешь заморачиваться, а если хочешь разобраться, то удаленный доступ и самому можно организовать"
    },
    {
      "id": 21209060,
      "author": "renat85",
      "datetime": "2020-01-30T09:22:29.000Z",
      "text": "Ну да, некая облачная платформа для удаленного доступа + частично для интеграции с тем же google assistant."
    },
    {
      "id": 21209322,
      "author": "lingvo",
      "datetime": "2020-01-30T10:07:39.000Z",
      "text": "Ещё и с платной подпиской 9.99€/month ....Все там будем рано или поздно. В принципе я готов на платную подписку за такой софт, так как мне уже не столько интересен opensource, сколько надежная работа и быстрая поддержка в случае проблем. Форумы не всегда помогают, как я узнал при миграции.Сейчас отчисляю donate за OH 1$/месяц — считаю, что справедливо — я им пользуюсь, мейнтейнерам тоже надо на что-то жить."
    },
    {
      "id": 21209980,
      "author": "empenoso",
      "datetime": "2020-01-30T12:05:21.000Z",
      "text": "я кстати и не представляю на чем они зарабатывают..."
    },
    {
      "id": 21210666,
      "author": "lingvo",
      "datetime": "2020-01-30T13:52:16.000Z",
      "text": "Не знаю, насчет, OpenHAB или Home Assistant, но тот же NodeRED успешно работает в коммерческих проектах и там, похоже за поддержку им отстегивают немало.(Что меня, в принципе в NodeRED и прельщает. Риск, что наступит нежданчик из-за отсутствия мейнтенеров, меньше)."
    },
    {
      "id": 21214340,
      "author": "empenoso",
      "datetime": "2020-01-31T09:14:14.000Z",
      "text": "спасибо"
    },
    {
      "id": 21209984,
      "author": "ral",
      "datetime": "2020-01-30T12:05:32.000Z",
      "text": "платная подписка опциональна"
    },
    {
      "id": 21209988,
      "author": "ral",
      "datetime": "2020-01-30T12:05:38.000Z",
      "text": "да, оно"
    },
    {
      "id": 21208726,
      "author": "dalamber_sign",
      "datetime": "2020-01-30T08:30:49.000Z",
      "text": "empenosoкак используете домофон в хомассистенте? Каким-то образом регистрируете вызовы? Интересны детали"
    },
    {
      "id": 21208768,
      "author": "empenoso",
      "datetime": "2020-01-30T08:36:27.000Z",
      "text": "Домофон — только сам факт вызова. Ответить по нему нельзя к сожалению.Это черезU-Sensor (5-310В)за 200 р. :)Но сам факт вызова успешно регистрирует — можно привязать к правилам и дальше использовать."
    },
    {
      "id": 21209010,
      "author": "Melias",
      "datetime": "2020-01-30T09:12:53.000Z",
      "text": "А он бинарный, этот сенсор?"
    },
    {
      "id": 21209016,
      "author": "empenoso",
      "datetime": "2020-01-30T09:14:01.000Z",
      "text": "Да"
    },
    {
      "id": 21209564,
      "author": "dalamber_sign",
      "datetime": "2020-01-30T11:00:23.000Z",
      "text": "Думал что-то более продвинутое, умеющее в MQTT, по которому трубка и взаимодействует с «терминалами» домофонаЕсли есть паяльник, то мониторинг тока/напряжения делается на INA219. Возможно даже на чем-то более простом"
    },
    {
      "id": 21209992,
      "author": "empenoso",
      "datetime": "2020-01-30T12:06:08.000Z",
      "text": "I²C и мега поддерживает"
    },
    {
      "id": 21210000,
      "author": "empenoso",
      "datetime": "2020-01-30T12:06:43.000Z",
      "text": "и этот сенсор за счет меги если надо в MQTT умеет"
    },
    {
      "id": 21210386,
      "author": "NickWinter",
      "datetime": "2020-01-30T13:07:40.000Z",
      "text": "Какая камера используется для просмотра подъезда? Глазок?"
    },
    {
      "id": 21214346,
      "author": "empenoso",
      "datetime": "2020-01-31T09:14:37.000Z",
      "text": "можно и так. вообще на Synology пишет"
    },
    {
      "id": 21214358,
      "author": "NickWinter",
      "datetime": "2020-01-31T09:15:46.000Z",
      "text": "А какое железо используется для глазка и для камеры?"
    },
    {
      "id": 21214380,
      "author": "empenoso",
      "datetime": "2020-01-31T09:18:25.000Z",
      "text": "здесь обычная ip камера купольная в подъезде чтобы попадала дверь и лестница вверх и вниз (лифта в доме нет он 5и этажный) — установлена под потолком"
    },
    {
      "id": 21212522,
      "author": "Teemon",
      "datetime": "2020-01-30T20:30:24.000Z",
      "text": "Расскажи плз поподробнее про устройство умного дома, как что работает"
    },
    {
      "id": 21214350,
      "author": "empenoso",
      "datetime": "2020-01-31T09:15:03.000Z",
      "text": "сложно в одном предложении это сделать..."
    },
    {
      "id": 21217220,
      "author": "Teemon",
      "datetime": "2020-01-31T19:22:25.000Z",
      "text": "Значит, пора писать статью)"
    },
    {
      "id": 21217852,
      "author": "empenoso",
      "datetime": "2020-02-01T03:08:09.000Z",
      "text": ":)))"
    },
    {
      "id": 21218210,
      "author": "lingvo",
      "datetime": "2020-02-01T08:24:52.000Z",
      "text": "Не знаю, нужно ли? По УД уже и так немало написано статей, мануалов и прочих инструкций. Написать, как каждый изобретал свой велосипед и наступал на свои грабли? ИМХО это будет интересно весьма малой аудитории. То, что сейчас каждый реализует как Умный Дом, весьма специфично для конкретной ситуации, и вряд ли другой захочет залазить и изучать эти дебри.Надо смотреть, что стало мейнстримом и тогда есть смысл заморачиваться со статьями."
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 21212612,
      "author": "Doman",
      "datetime": "2020-01-30T20:52:23.000Z",
      "text": "А вы рассматривали проект ioBroker? Если да, то почему выбор пал на Home Assistant?"
    },
    {
      "id": 21214356,
      "author": "empenoso",
      "datetime": "2020-01-31T09:15:39.000Z",
      "text": "ioBroker смотрел на него в 2016 году. в 2019 не рассматривал"
    },
    {
      "id": 21215292,
      "author": "safari2012",
      "datetime": "2020-01-31T11:55:59.000Z",
      "text": "Что-то другое (напишите в комментариях)Много лет сижу на blynk. Не opensource, но меня устраивает. Сервер RPi 3 + БП со встроенным ИБП, uptime несколько лет уже."
    },
    {
      "id": 21217856,
      "author": "empenoso",
      "datetime": "2020-02-01T03:08:41.000Z",
      "text": "я слышал про blynk, но как в нем соединить разные технологии?"
    },
    {
      "id": 21219760,
      "author": "safari2012",
      "datetime": "2020-02-01T18:30:55.000Z",
      "text": "Вопрос слишком общий :)Что конкретно соединить? Blynk — это набор библиотек для Arduino IDE + сервер + клиент под мобильные ОСи.У меня через blynk управляется весь дом — от аквариума до новогодней ёлки."
    },
    {
      "id": 21220456,
      "author": "empenoso",
      "datetime": "2020-02-02T04:49:16.000Z",
      "text": "спасибо"
    },
    {
      "id": 21233220,
      "author": "repon",
      "datetime": "2020-02-05T09:10:21.000Z",
      "text": "а что за счетчик электроэнергии и как вы с него снимаете показания?)"
    },
    {
      "id": 21233224,
      "author": "empenoso",
      "datetime": "2020-02-05T09:10:43.000Z",
      "text": "импульсный выход. без цифрового."
    },
    {
      "id": 21248802,
      "author": "papanin",
      "datetime": "2020-02-08T01:37:49.000Z",
      "text": "Domoticz кто-нибудь сравнивал с HA или OH?"
    },
    {
      "id": 21250478,
      "author": "dalamber_sign",
      "datetime": "2020-02-08T16:30:50.000Z",
      "text": "Года два назад пробовал разворачивать автоматизацию Xiaomi устройств на домотиксе. Не особо впечатлен — веб-интерфейс убогий, из коробки ничего не заводится. Ушел на HA"
    }
  ]
}