{
  "url": "https://habr.com/ru/articles/494210/comments/",
  "article_id": 494210,
  "title": "Установка Ubuntu на Microsoft Surface Pro",
  "comments": [
    {
      "id": 21441074,
      "author": "vrangel",
      "datetime": "2020-03-30T02:27:46.000Z",
      "text": "Спасибо за статью. Стандартный вопрос: Как в линуксе с временем работы от батареи? Есть ли разница с win?"
    },
    {
      "id": 21441076,
      "author": "empenoso",
      "datetime": "2020-03-30T02:29:29.000Z",
      "text": "Я не проводил отдельных тестов, но на глаз как будто плюс минус так же."
    },
    {
      "id": 21441078,
      "author": "empenoso",
      "datetime": "2020-03-30T02:30:27.000Z",
      "text": "Использую этот планшет именно как ноутбук — то есть обычно всегда за столом."
    },
    {
      "id": 21441848,
      "author": "mistergrim",
      "datetime": "2020-03-30T09:36:55.000Z",
      "text": "все функции Microsoft Surface Pro, кроме камер, работают, но фотографировать ведь и на телефон можно?Да, и скайпом тоже через телефон пользоваться.А Krita и под Windows прекрасно работает (а поддержка HDR, например, только в Windows и работает)."
    },
    {
      "id": 21441862,
      "author": "empenoso",
      "datetime": "2020-03-30T09:38:55.000Z",
      "text": "Вы правы насчёт Krita."
    },
    {
      "id": 21441874,
      "author": "empenoso",
      "datetime": "2020-03-30T09:41:02.000Z",
      "text": "Конечно если на планшете есть камеры и они не работают это некий компромисс.Но в моей специфике работы за последние годы я ни разу не пользовался камерой на своём ноутбуке."
    },
    {
      "id": 21442604,
      "author": "DisM",
      "datetime": "2020-03-30T12:37:57.000Z",
      "text": "windows Hello"
    },
    {
      "id": 21442660,
      "author": "empenoso",
      "datetime": "2020-03-30T12:50:20.000Z",
      "text": "Это будет работать, если учетная запись для Windows локальная?"
    },
    {
      "id": 21442944,
      "author": "DisM",
      "datetime": "2020-03-30T14:25:06.000Z",
      "text": "да"
    },
    {
      "id": 21442652,
      "author": "nickbuizzman",
      "datetime": "2020-03-30T12:48:17.000Z",
      "text": "Кстати, использую его, как граф планшет — нереально удобная штука"
    },
    {
      "id": 21442654,
      "author": "empenoso",
      "datetime": "2020-03-30T12:49:06.000Z",
      "text": "А каким граф приложением пользуетесь?"
    },
    {
      "id": 21442748,
      "author": "nickbuizzman",
      "datetime": "2020-03-30T13:15:40.000Z",
      "text": "zbrush, Photoshop"
    },
    {
      "id": 21444496,
      "author": "IntActment",
      "datetime": "2020-03-31T05:26:17.000Z",
      "text": "Тоже как-то купил сюрфейс, думал, буду кодить на нём в пути или где-нибудь вне дома. Однако быстро понял, что, в отличие от ноутбука, его не поставишь на колени: это чертовски неудобно (надо сидеть чуть ли не в позе эмбриона), да и еще можно неловким движением захлопнуть подставку и прищемить что-нибудь. С тех пор он у меня пылился на полке. Тем не менее, как-то решил попробовать установить на него Clip Studio (редактор для рисования комиксов, манги и не только) — создалось такое впечатление, будто сам сюрфейс изначально был создан стать крутым графическим планшетом: то чувство, когда софтина различает касание рукой и стилусом, когда двумя пальцами можно вращать холст или облокотить кисть на экран, рисуя стилусом не боясь случайных ложных распознаваний от прикосновения руки к экрану — незабываемо… Тем не менее, рисую я не часто, и чем реже включаю планшет — тем меньше хочется его вообще включать. А всё из-за того, что за то время, что он пылится на полке, накапливается тонна обновлений, которые при каждом включении норовят установиться, а не могут (виснет на каком-то проценте, а дальше хард-ресет и откат, и так каждый раз). Как я понимаю, у тех, кто пользуется им ежедневно — таких проблем не возникает, но для меня это чуть ли не самый большой минус."
    },
    {
      "id": 21444506,
      "author": "empenoso",
      "datetime": "2020-03-31T05:34:56.000Z",
      "text": "Спасибо за ваш отзыв по опыту реальной эксплуатации."
    },
    {
      "id": 21448216,
      "author": "reUmNIck",
      "datetime": "2020-04-01T07:44:11.000Z",
      "text": "Я вместо сюрфейса выбрал реф HP Elite X2 1013. Обошелся в 500 за i5-8350 +16 Гб ОЗУ и скоростной жесткий с гарантией на 3 года. Честные тандерболты подкупили. Ставится на колени удобнее, клава и стилус в комплекте, но модификация с фуллхд реально ущерб на в плане работы с графикой после 3к экранов.Имхо, из за отсутствия драйверов линукс на таких не слишком эффективен: попытка переехать в убунту выявила проблему управления ядрами. И вайфай через костыли, что не гуд.Да, винхелло работает — только им и пользуюсь, очень удобно. Отчаянно рекомендую."
    },
    {
      "id": 21449834,
      "author": "empenoso",
      "datetime": "2020-04-01T13:48:34.000Z",
      "text": "Первой же строчкой в результатах поиска по названию идёт \"HP Elite x2 1013 G3 Tablet Review — Surface Pro Killer???\" :)Он подороже выходит, но правда и комплектация побогаче: клавиатура и стилус в комплекте. Но у Surface экран большего разрешения.Данный Surface именно как дополнительный компьютер покупал, не основной."
    },
    {
      "id": 21450990,
      "author": "reUmNIck",
      "datetime": "2020-04-01T19:18:15.000Z",
      "text": "Surface с таким процессором и памятью (i5 gen.8 + 16 ) выходит примерно вдвое дороже HP. :) мне обошелся корпоративный в 500 баксов + доставка и пошлина, то есть на уровне Surface Pro 4/5. С подвохом: обычно должен быть 3K экран, а в моей редкой модификации оказалась FullHD панель с приват-фильтром и повышенной яркостью. Впрочем, за эту цену и 3 года гарантии пришлось простить) Разница заметна, если приглядеться.Правда, средняя цена на 1013 в такой комплектации все же 700 — а здесь действительно можно найти Surface Pro 6.А искал я Dell 5290 — модем, 2 слота M.2. (с возможностью установки второго жесткого и загрузки с него), защищенный корпус, куча аксессуаров и комплектующих за копейки — экран по 50, батарейка — 30 баксов. И все это по 400-500 долларов за i5 gen.8 + 8 Гб оперативки, правда только с FullHD-дисплеем, который заметно хуже Surface во всем, кроме рекордной яркости. Ну и разбирается как конструктор двумя отвертками. Но не сложилось, хотя под Linux (точнее Dual-Boot) я думал приобретать именно его.Но я все же не об этом. После 3 месяцев с Win10 и попытки переехать остался с мелкомягкой системой: очень комфортно даже рядом с системами, заточенными под руки — тот же Android в рабочих приложениях оказывается менее удобным. Попробуйте — с Windows Hello полностью отказался от паролей, да и под пальцами сегодня винда лучше, чем была 8я. Я в восторге, если честно. Попробуйте! Пользуюсь в роли единственного ноутбука (дома ПК), шик.У вас комплектация без модема? Пробовали внешние? Как с периферией и в особенности с хабами?Пойду попробую на внешний поставить Deepin."
    },
    {
      "id": 21452040,
      "author": "empenoso",
      "datetime": "2020-04-02T08:25:36.000Z",
      "text": "На самом деле последние несколько лет работал на ноутбуке ASUS ZenBook 13,2\" UX330UAK (3200 x 1800) Intel Core i7-7500U, 8GB Ram, 256GB SSD с подключаемым внешним большим монитором на рабочем месте и без внешнего монитора в других местах. Использовал Manjaro и Mint.Но по итогу с этим монитором на стационарном рабочем месте решил использовать неттоп Ultra Small Tiny Desktop Micro Computer PC под Mint и тоже с амазона.А для поездок хотел купить ноут с сенсорным экраном, но они достаточно дорогие выходили 600-1100$ если не на Chrome OS, но я хотел именно полноценную операционную систему, 10\" экрана мне было мало, 12\" в форм-факторе планшета как раз подошли. По характеристикам и цене подошел восстановленный Microsoft Surface Pro 4. Пришёл в коробке и выглядит как новый. Модем мне был не нужен, потому что телефон с eSIM и можно раздавать с вай-фая, а на самом Surface Pro eSIM только с 5 модели идут.Попробую всё-таки и вместе с Windows попользоваться им — под Linux некоторое неудобство использования как планшетом в первую очередь из-за отсутствия клавиатуры.У меня нет фирменной крышки-клавиатуры, а только отдельная блютус клавиатура ноутбучного формата — пусть и без русских букв.Ну и про Windows Hello многие написали."
    },
    {
      "id": 21518598,
      "author": "SchattenGeist",
      "datetime": "2020-04-20T10:56:20.000Z",
      "text": "А тачскрин у вас стабильно работает под убунтой, не отваливается?"
    },
    {
      "id": 21518684,
      "author": "empenoso",
      "datetime": "2020-04-20T11:15:53.000Z",
      "text": "На самом деле очень неудобно что нет физической клавиатуры. У меня нет фирменной крышки-чехла-клавиатуры и сенсорное управление мягко скажем не на высоте."
    },
    {
      "id": 21519336,
      "author": "SchattenGeist",
      "datetime": "2020-04-20T14:08:06.000Z",
      "text": "Ну да, я с чехлом юзаю, с ним никаких проблем нет, и клавиатура и тачпад работают без нареканий, а вот тачскрин периодически отваливается. Тачскриин протсо удобно использовать вместо/ в дополнение тачпада…"
    }
  ]
}