{
  "url": "https://habr.com/ru/articles/506720/comments/",
  "article_id": 506720,
  "title": "Скрипт выборки российских облигаций по параметрам",
  "comments": [
    {
      "id": 21761028,
      "author": "w3ga",
      "datetime": "2020-06-22T03:25:13.000Z",
      "text": "удивительно, но подобные скрипты есть на всех сайтах «обозревателей»поэтому на работу с ними тратится достаточно много времениединственное время, что там тратится, это в ручную забить параметры в фильтр, как и вашем скрипте.и да самые доходные облигации в вашей выборке — строительные компании, лизинговые и микрофинансовые организации. первые две категории сейчас простаивают, микрофинансы начнут сыпаться когда население, что брало займы в период карантина, не будет расплачиваться. а доходность облигаций тех же крупных банков на уровне депозитов в них +\\-. всё таки иногда лучше погуглить пол часика, чем писать «велосипеды», которые уже написаны до вас"
    },
    {
      "id": 21761044,
      "author": "empenoso",
      "datetime": "2020-06-22T03:38:18.000Z",
      "text": "Ну например, где конкретно? Я искал."
    },
    {
      "id": 21766098,
      "author": "retverd",
      "datetime": "2020-06-23T09:17:31.000Z",
      "text": "Здесь есть кредитный рейтинг и индекс ликвидности —www.dohod.ru/analytic/bonds. Но это, конечно, не гарантирует возможности купить по хорошей цене. Большой плюс своего скрипта в том, что точно знаешь механику расчета и всегда можно скорректировать по необходимости."
    },
    {
      "id": 21766494,
      "author": "empenoso",
      "datetime": "2020-06-23T10:44:03.000Z",
      "text": "Да, но индекс ликвидности — достаточно общее понятие."
    },
    {
      "id": 21761048,
      "author": "empenoso",
      "datetime": "2020-06-22T03:39:59.000Z",
      "text": "Нет смысла обсуждать конкретные результаты поиска — тут каждый решает сам.Сегодня результаты одни, завтра другие — рынок все таки."
    },
    {
      "id": 21761066,
      "author": "empenoso",
      "datetime": "2020-06-22T03:51:45.000Z",
      "text": "Основная \"фишка\" скрипта — учёт ликвидности — вот с этим реально проблемы во всех сервисах, которые перечисляю в статье."
    },
    {
      "id": 21761088,
      "author": "Belking",
      "datetime": "2020-06-22T04:10:20.000Z",
      "text": ">> и да самые доходные облигации в вашей выборке — строительные компании,…Вы даже не представляете, насколько это обидно, когда проведя ресёрч и составив план по покупкам, идёшь на биржу и сталкиваешься с тем, что посчитанная доходность определялась сделкой месячной давности. Так что обозначенноеempenosoрешение, наверное очень круто:>> Основная «фишка» скрипта — учёт ликвидности — вот с этим реально проблемы во всех сервисах, которые перечисляю в статье.Для себя же навострился параллельно с ресёрчем проверять эту ликвидность ручками на бирже."
    },
    {
      "id": 21761110,
      "author": "empenoso",
      "datetime": "2020-06-22T04:22:18.000Z",
      "text": "Да, вот с этим и боролся для себя: чтобы исключить дополнительный ручной поиск."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2020-06-22T12:35:32.000Z",
      "text": "Можно ли их купить только человеку? Какой минимальный лот?альфа-банк евровые облигации"
    },
    {
      "id": 21762890,
      "author": "empenoso",
      "datetime": "2020-06-22T12:35:32.000Z",
      "text": "Можно ли их купить только человеку? Какой минимальный лот?альфа-банк евровые облигации"
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2020-06-22T15:37:00.000Z",
      "text": "С Альфа-директом я прыгал в своё время с еврооблигациями. Можно было купить только через менеджера и ограниченное число, а фактический выбор на бирже был больше."
    },
    {
      "id": 21763648,
      "author": "empenoso",
      "datetime": "2020-06-22T15:37:00.000Z",
      "text": "С Альфа-директом я прыгал в своё время с еврооблигациями. Можно было купить только через менеджера и ограниченное число, а фактический выбор на бирже был больше."
    },
    {
      "id": 21763762,
      "author": "guestl",
      "datetime": "2020-06-22T16:03:47.000Z",
      "text": "с бессрочными есть нюанс, что это суборды. то есть банк их может, например, списать со словами «не шмогла»."
    },
    {
      "id": 21763768,
      "author": "empenoso",
      "datetime": "2020-06-22T16:05:01.000Z",
      "text": "В текущей ситуации я обычно смотрю только самые короткие."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2020-06-23T03:34:18.000Z",
      "text": "Я боюсь что возможно всё, насколько вероятно только."
    },
    {
      "id": 21764980,
      "author": "empenoso",
      "datetime": "2020-06-23T03:34:18.000Z",
      "text": "Я боюсь что возможно всё, насколько вероятно только."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2020-06-23T05:38:00.000Z",
      "text": "Слишком апокалиптически, но «вечные» бонды я бы не стал покупать, но каждый решает сам. ¯\\_(ツ)_/¯"
    },
    {
      "id": 21765132,
      "author": "empenoso",
      "datetime": "2020-06-23T05:38:00.000Z",
      "text": "Слишком апокалиптически, но «вечные» бонды я бы не стал покупать, но каждый решает сам. ¯\\_(ツ)_/¯"
    },
    {
      "id": null,
      "author": "AAAbramenko",
      "datetime": "2020-06-23T06:01:50.000Z",
      "text": "Случай, который был с Открытием, покоя не даёт в таких ситуациях."
    },
    {
      "id": 21765186,
      "author": "AAAbramenko",
      "datetime": "2020-06-23T06:01:50.000Z",
      "text": "Случай, который был с Открытием, покоя не даёт в таких ситуациях."
    },
    {
      "id": null,
      "author": "AAAbramenko",
      "datetime": "2020-06-23T06:15:01.000Z",
      "text": "«Открытие» входил в ТОП-10 банков и был признан системообразующим?ДаЯ подробностей не знаю, по облигациям Открытия всё выплатили?"
    },
    {
      "id": 21765226,
      "author": "AAAbramenko",
      "datetime": "2020-06-23T06:15:01.000Z",
      "text": "«Открытие» входил в ТОП-10 банков и был признан системообразующим?ДаЯ подробностей не знаю, по облигациям Открытия всё выплатили?"
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 21765244,
      "author": "empenoso",
      "datetime": "2020-06-23T06:18:50.000Z",
      "text": "Но с облигациями вроде не всё гладко было."
    },
    {
      "id": null,
      "author": "AAAbramenko",
      "datetime": "2020-06-23T06:30:07.000Z",
      "text": "Проблемы были у Открытие Холдинг (небанк Открытие)rusbonds"
    },
    {
      "id": 21765298,
      "author": "AAAbramenko",
      "datetime": "2020-06-23T06:30:07.000Z",
      "text": "Проблемы были у Открытие Холдинг (небанк Открытие)rusbonds"
    },
    {
      "id": 22406534,
      "author": "sbc2",
      "datetime": "2020-12-10T07:01:50.000Z",
      "text": "суборды открытия обнулили, а банк нет."
    },
    {
      "id": 21764954,
      "author": "maar",
      "datetime": "2020-06-23T02:50:21.000Z",
      "text": "Только эти «бессрочные» облигации могут быть никогда не погашены."
    },
    {
      "id": null,
      "author": "maar",
      "datetime": "2020-06-23T12:35:50.000Z",
      "text": "Всегда можно продать по цене рынка (если ключевая ставка повысится, то цена пойдет вниз).Это доп риски, обычные облиги можно до погашения держать, тут такой опции нет.Цена бессрочных облигаций ниже, чем облигаций с датой погашения не на пустом месте.Кому-то этот риск приемлем, кому-то — нет."
    },
    {
      "id": 21766938,
      "author": "maar",
      "datetime": "2020-06-23T12:35:50.000Z",
      "text": "Всегда можно продать по цене рынка (если ключевая ставка повысится, то цена пойдет вниз).Это доп риски, обычные облиги можно до погашения держать, тут такой опции нет.Цена бессрочных облигаций ниже, чем облигаций с датой погашения не на пустом месте.Кому-то этот риск приемлем, кому-то — нет."
    },
    {
      "id": 21767376,
      "author": "empenoso",
      "datetime": "2020-06-23T14:30:24.000Z",
      "text": "Когда реально всё плохо — покупателей может просто не быть. Одни продавцы."
    },
    {
      "id": 21767936,
      "author": "guestl",
      "datetime": "2020-06-23T17:35:41.000Z",
      "text": "это как-раз было не так давно с фьючерсами на нефть :)"
    },
    {
      "id": 21779972,
      "author": "mrShadow",
      "datetime": "2020-06-26T11:29:28.000Z",
      "text": "Они вроде долларовые, а не евровые:www.rusbonds.ru/ank_obl.asp?tool=138425www.boerse-berlin.com/index.php/Bonds?isin=XS1760786340"
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 21785886,
      "author": "maremman",
      "datetime": "2020-06-28T11:13:42.000Z",
      "text": "«выборке — строительные компании»Строительные компании сейчас в интересном положении. С одной стороны они получили «бронь» от правительства.С другой, покупательная способность населения настолько упала, что притока новых средств (кредитов от банков под строительство) стоит ожидать не скоро.Застройщики защитились от простых людей постановлением правительства №423 от 2 апреля. Теперь они никому не должны. Мало того, это постановление защищает ещё и не пострадавших от введённого карантина застройщиков. Теперь и они защищены буквой закона, от назойливых покупателей недостроенного жилья.youtu.be/_jg6SQEoHN0"
    },
    {
      "id": 21761174,
      "author": "reallord",
      "datetime": "2020-06-22T05:24:00.000Z",
      "text": "Большое спасибо! Отличный инструмент.Тоже попадаю постоянно на ликвидность, после выборки на rusbonds, идешь и руками все проверяешь и материшься."
    },
    {
      "id": 21761180,
      "author": "empenoso",
      "datetime": "2020-06-22T05:26:55.000Z",
      "text": "Да :)"
    },
    {
      "id": 21761240,
      "author": "Segen",
      "datetime": "2020-06-22T06:15:57.000Z",
      "text": "Для себя я также не нашел подходящего готового решения.Я для упрощения выбора облигаций среди всего их множества написал простой Python скрипт, который через API Московской биржи сохраняет несколько CSV файликов, объединяет их, оставляя только нужные столбцы. Затем я вручную импортирую файл в Libre Office Calc и там уже создаю фильтры, делаю сортировки.Ваше решение интересно.Думаю можно ещё много чего полезного добавить, ну это исключительно по моему мнению. Например, столбец уровня листинга (чтобы сразу видеть 1-2 это уровень или 3) и информацию о типе облигации относительно того постоянный или переменный у неё купон и есть ли у нее амортизация (одним столбцом). Вышесказанное можно так же входными параметрами сделать."
    },
    {
      "id": 21761256,
      "author": "empenoso",
      "datetime": "2020-06-22T06:21:05.000Z",
      "text": "Да, это можно. Но для себя как можно проще хотел сделать, чтобы не было перегрузки параметрами."
    },
    {
      "id": 21761280,
      "author": "Segen",
      "datetime": "2020-06-22T06:26:32.000Z",
      "text": "Я так понимаю потом вы проводите окончательный анализ найденных облигаций уже вручную?"
    },
    {
      "id": 21761292,
      "author": "empenoso",
      "datetime": "2020-06-22T06:31:11.000Z",
      "text": "Да, стараюсь посмотреть что за компания. От объема на который покупаю зависит."
    },
    {
      "id": 21761306,
      "author": "Belking",
      "datetime": "2020-06-22T06:37:14.000Z",
      "text": ">> Я так понимаю потом вы проводите окончательный анализ найденных облигаций уже вручную?А без этого никак.Альтернативой этому будет, например, классифицировать их по эмитенту в матрицу «Риск отрасли, риск эмитента», после чего уже по подобранным в ручную коэффициентам соответствующий личным представлениям о Риск/Доходности предлагать портфель. Но для этого нужно вести справочник этих эмитентов, по которому данная классификация будет проставлена. И скорее всего точно также в ручную.Такая автоматизация была бы полезна для существенно бОльших чем ИИС инвестиций. А тут получится, что Расход времени на автоматизацию > Расход времени на «ручной» анализ. А писать подобный скрипт ради статьи — то всё внимание читающих и комментирующих будет сосредоточено на проставленных коэффициентах."
    },
    {
      "id": 21761376,
      "author": "empenoso",
      "datetime": "2020-06-22T06:55:00.000Z",
      "text": "Я согласен. Мне просто часто приходится с этим сталкиваться и я решил упростить себе жизнь. Ну а раз я пишу всякие статьи, то тоже решил скрипт опубликовать. То есть конечно, это не ради статьи было написано."
    },
    {
      "id": 21761558,
      "author": "Belking",
      "datetime": "2020-06-22T07:38:12.000Z",
      "text": ">> Я согласен. Мне просто часто приходится с этим сталкиваться и я решил упростить себе жизнь. Ну а раз я пишу всякие статьи, то тоже решил скрипт опубликовать.Ну а раз я пишу всякие статьи, то тоже решил скрипт опубликовать. То есть конечно, это не ради статьи было написано.Я имел ввиду писать статью про автоматизацию «окончательного анализа найденных облигаций», а что касается именно этой статьи, то Я искренне надеюсь, что Вашу статью прочитают близкие к тем сервисам (русбондс, смартлаб) люди и доработают свои формы ликвидностью.ОффтопКстати, интересным сервисом для ИИС был бы «Алгоритм минимальных вложений». Т.е., механизм ИИС подразумевает под собой, что получение дивидендов и купонного дохода не требует зачисления на ИИС. И теоретически, приобретая цб до выплаты купона, продавая её после его выплаты и покупая другую цб с купоном, наступающим в ближайшее время, можно необходимые для вычета 400 000 рублей начислений за год обеспечить существенно меньшей суммой.>> С классификацией кстати большая проблема — часто даже невозможно найти категорию бумаги в готовом виде.Поэтому и получается, что проще и быстрее «наметать» глаз, чтобы понимать о ком речь и прикинуть какой % портфеля может данная бумага составить без рисков, нежели вести дополнительные справочники и классификаторы. Да и отрасль мало что подскажет — та же торговля торговле рознь и чтобы найти недооцененные компании нырять нужно в каждую с головой."
    },
    {
      "id": 21761760,
      "author": "empenoso",
      "datetime": "2020-06-22T08:39:09.000Z",
      "text": "Я имел ввиду писать статью про автоматизацию «окончательного анализа найденных облигаций», а что касается именно этой статьи, то Я искренне надеюсь, что Вашу статью прочитают близкие к тем сервисам (русбондс, смартлаб) люди и доработают свои формы ликвидностью.Они кажется уже лет 15 не могут собраться добавить учёт ликвидности. Может просто сами не пользуются ;)"
    },
    {
      "id": 21766116,
      "author": "retverd",
      "datetime": "2020-06-23T09:20:49.000Z",
      "text": "Для ВДО список есть:docs.google.com/spreadsheets/d/19bQnYtfJfDKZD72CUykJ-NjIzUe1C84D028nBgZl5GE/edit?usp=drive_web&ouid=108619459978526897465. По более консервативном можно сделать привязку к эмитенту, а по эмитентам структурированной информации больше. Недостаток «наметанного глаза» — новые компании периодически выходят на рынок, про них тоже придется искать информацию."
    },
    {
      "id": 21766500,
      "author": "empenoso",
      "datetime": "2020-06-23T10:44:49.000Z",
      "text": "Этот адрес как раз два дня назад узнал :)"
    },
    {
      "id": 21761386,
      "author": "empenoso",
      "datetime": "2020-06-22T06:57:03.000Z",
      "text": "С классификацией кстати большая проблема — часто даже невозможно найти категорию бумаги в готовом виде.Для себя я ищу ИНН компании, а по нему уже основной род их деятельности — и это в какой-то мере является классификацией."
    },
    {
      "id": 21761412,
      "author": "AAAbramenko",
      "datetime": "2020-06-22T07:02:48.000Z",
      "text": "Была идея сделать что-то аналогичное для личного пользования, ибо процедура поиска различных облигаций утомительна (приходится одновременно открывать и moex, и rusbonds, и smart-lab). Хотелось предусмотреть удобные фильтры, предусмотреть дополнительный критерий наличия бумаги вЛомбардном списке ЦБ, но всё руки не доходят."
    },
    {
      "id": 21761436,
      "author": "empenoso",
      "datetime": "2020-06-22T07:09:47.000Z",
      "text": "А наличие бумаги в Ломбардном списке ЦБ что даёт?"
    },
    {
      "id": 21761526,
      "author": "Segen",
      "datetime": "2020-06-22T07:32:15.000Z",
      "text": "Похоже, что это дополнительная гарантия надежности компании и ликвидности ее ценных бумаг."
    },
    {
      "id": 21761530,
      "author": "AAAbramenko",
      "datetime": "2020-06-22T07:32:31.000Z",
      "text": "Просто дополнительный критерий надёжности бумаги, раз ЦБ не брезгует брать её в залог."
    },
    {
      "id": 21761560,
      "author": "empenoso",
      "datetime": "2020-06-22T07:39:49.000Z",
      "text": "На доходности тогда это сказывается скорее отрицательно."
    },
    {
      "id": 21761590,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-22T07:51:09.000Z",
      "text": "Спасибо за статью. Много лет назад ушел с рынка ЦБ, а некоторое время назад пришел к выводу, что пора вернуться. Как раз думал о том, что стоит написать какой-нибудь алгоритм под себя. Не знаю, воспользуюсь ли я Вашими наработками, но толчок в нужном направлении получил.Плюс для себя буду добавлять возможность условного арбитража по облигациям. То есть у меня будет список облигаций, которые бот сможет покупать и продавать для получения чуть большей доходности. Это на самом деле достаточно простой алгоритм, но тут действительно вопрос ликвидности очень важен."
    },
    {
      "id": 21761604,
      "author": "empenoso",
      "datetime": "2020-06-22T07:57:29.000Z",
      "text": "Могли бы Вы уточнить подробнее про арбитраж?"
    },
    {
      "id": 21761676,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-22T08:22:58.000Z",
      "text": "Как я и сказал раньше, это условный арбираж (то есть не классический), возможно кто-то скажет это не арбираж вовсе. Так что прошу сразу не критиковать жестко :)В чем суть. Допустим мы составили список из 10 облигаций, которые, как мы считаем равнозначны между собой в соотношениях (например как пары евро/доллар, евро/рубль, доллар/рубль). Затем мы выбрбали наиболее доходную бумагу, пусть это будет бумага №7 и купили ее. Теперь мы ждем, когда какая-нибудь другая бумага из списка будет показывать большую доходность или же наша бумага просто подоражет относительно других. И вот здесь наступает момент, когда нам требуется быстро переложиться из бумаги №7 в более доходную.Основная проблема с облигациями — низкая ликвидность. Поэтому не факт, что если одну бумагу из списка легко будет купить (более доходную), то другую, также легко можно будет продать из-за отсутствия предложения. А сделать то это нужно одновременно.Но это очень упрощенный подход, на практике всегда возникает куча нюансов. Надеюсь к концу лета пройти весь этот путь, после чего тоже смогу написать статью :)"
    },
    {
      "id": 21761768,
      "author": "empenoso",
      "datetime": "2020-06-22T08:42:23.000Z",
      "text": "А вы читали? Они арбитражом с огромными плечами занимались :)"
    },
    {
      "id": 21761866,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-22T09:06:44.000Z",
      "text": "не читал :)я для себя давно еще решил не торговать в кредит, да и производные бумаги меня тоже настораживают"
    },
    {
      "id": 21761892,
      "author": "empenoso",
      "datetime": "2020-06-22T09:14:33.000Z",
      "text": "Как история — довольно захватывающе описано."
    },
    {
      "id": null,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T07:18:01.000Z",
      "text": "Не уловил сарказма.Предлагаю не вырывать текст из контекста. В самом начале комментария я обозначил, что есть список равнозначных бумаг, мы с ним и работаем. Что это значит?Например у нас в списке облигации только эмитентов с наивысшим кредитным риском, которые находятся еще и в ломбардном списке ЦБ. Вероятность банкротства таких эмитентов крайне низкая, еще ниже риск их непогашения. Соответственно задача бота ловить разницу изменений стоимости таких облигаций и на этом зарабатывать дополнительно к облигационному доходу.Ну или еще один Вам пример — облигации разного выпуска одного эмитента. Не знаю как сейчас, а раньше, лет 10-15 назад были и такие варианты. Понятно, что разные бумаги одного эмитента могут быть по разному защищены, однако мы с самого начала договорились иметь ввиду равнозначные бумаги.Повторюсь, в этой схеме наиболее значимым является ликвидность бумаг.И да, еще раз, прошу не вырывать слова из контекста. У меня нет бота, который будет что-то предсказывать и создавать такой бот я не намерен. Вообще заниматься предсказаниями на рынке бумаг дело на благодарное."
    },
    {
      "id": 21765450,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T07:18:01.000Z",
      "text": "Не уловил сарказма.Предлагаю не вырывать текст из контекста. В самом начале комментария я обозначил, что есть список равнозначных бумаг, мы с ним и работаем. Что это значит?Например у нас в списке облигации только эмитентов с наивысшим кредитным риском, которые находятся еще и в ломбардном списке ЦБ. Вероятность банкротства таких эмитентов крайне низкая, еще ниже риск их непогашения. Соответственно задача бота ловить разницу изменений стоимости таких облигаций и на этом зарабатывать дополнительно к облигационному доходу.Ну или еще один Вам пример — облигации разного выпуска одного эмитента. Не знаю как сейчас, а раньше, лет 10-15 назад были и такие варианты. Понятно, что разные бумаги одного эмитента могут быть по разному защищены, однако мы с самого начала договорились иметь ввиду равнозначные бумаги.Повторюсь, в этой схеме наиболее значимым является ликвидность бумаг.И да, еще раз, прошу не вырывать слова из контекста. У меня нет бота, который будет что-то предсказывать и создавать такой бот я не намерен. Вообще заниматься предсказаниями на рынке бумаг дело на благодарное."
    },
    {
      "id": 21765568,
      "author": "empenoso",
      "datetime": "2020-06-23T07:45:38.000Z",
      "text": "Соответственно задача бота ловить разницу изменений стоимости таких облигаций и на этом зарабатывать дополнительно к облигационному доходу.Не уловил. Это как получается?"
    },
    {
      "id": 21765708,
      "author": "Belking",
      "datetime": "2020-06-23T08:11:58.000Z",
      "text": "Предположу, что есть 10 бумаг, каждый день цены по ним меняются. Допустим все они были куплены по номиналу (1000 рублей), а уже на следующий день они стоят 999,9; 1000,1; 999,8; 1000,2 и т.д. Соответственно, те которые стоят 999,8 и 1000,2 продаются и покупаются те, которые стоят 999,9 и 999,8. На следующий день, ситуация меняется, и покупается всё уже в соответствии с ней. Условие, что это будет идеально работать — продаваться и покупаться должно в один момент, чтобы соотношения не успели поменяться. Ну и другое условие — облигации должны быть равноценными. Оба выполнимы с трудом."
    },
    {
      "id": 21765778,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T08:25:18.000Z",
      "text": "именно это и имелось ввидупо старой памяти, основным препятствием для проведения таких сделок раньше была низкая ликвидность. Как сейчас — не знаюВ июле/августе буду входить на рынок спустя более чем 10 летнего перерыва. Может что-то изменилось"
    },
    {
      "id": 21765936,
      "author": "empenoso",
      "datetime": "2020-06-23T08:54:10.000Z",
      "text": "ОФЗ только по настоящему ликвидные. Но там никакой скрипт для поиска не нужен :)А корпоративные — иногда бывают."
    },
    {
      "id": 21765754,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T08:20:05.000Z",
      "text": "так за счет курсовых изменений стоимости облигаций и условно гарантированного доходаНу например, это чисто теоритическая ситуация, Вы считаете, что бумаги Роснефти и Газпрома равнозначны с точки зрения риска банкротства и неплатежей и сроки погашения облигация плюс/минус одинаковые. Но когда, Вы решились на покупку, по Роснефти был доход 5%, по Газпрому 4,7%. Вы берете Роснефть, так как она дает Вам большую доходность.Предлагаю на этом этапе внести уточнение — эти облигации с купонным доходом, то есть доход выплачивается раз допустим в квартал.Прошел допустим месяц с момента сделки. Никаких финансовых потрясений не происходило, спекулятивных новостей не было, а значит за месяц цены на облигации Роснефти и Газпрома в общем случае должны были немного вырасти, так чтобы сохранить доходность для других покупателей бумаг на том же уровне: 4,7% и 5%.Но!!! Допустим в какой-то момент, какой-то фонд решил затариться бумагами Роснефти и они начали расти в цене. Доходность бумаг в таком случае будет падать. Допустим она упала до 3,5%. А бумаги газпрома показывают такую же доходность как и месяц назад — 4,7%. В этот момент бот и действует: он продает Роснефть, и покупает Газпром.Что Вы получите в итоге? 4,7% годовых по купону от Газпрома плюс курсовая разница в (5-3,5) 1,5% от сделки с Роснефтью.Безусловно это очень упрощенная модель и мысли о таком боте у меня были более 10 лет назад. Тогда мне казалось это возможным, но торговал в то время я ручками."
    },
    {
      "id": 21765948,
      "author": "empenoso",
      "datetime": "2020-06-23T08:55:11.000Z",
      "text": "Сейчас технологических возможностей несомненно больше."
    },
    {
      "id": null,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T08:47:00.000Z",
      "text": "Если из-за одной новости о начале выпуска какого-то неудачного продукта компания может допустить технический дефолт или совсем обанкротиться, то скорее всего эта компания вряд ли имеет высшие кредитные оценки и ее бумаги вряд ли находится в ломбардном списке ЦБ. И торговля такими бумагами изначально считается высокорискованной. Я же говорил о торговле облигациями, которые заменяют банковские депозиты, так как посыл статьи был именно в альтернативе депозитов, а не в погоне за сверх доходами. А это в первую очередь надежность эммитентов.За последние 10 лет в России я не припомню банкротств эмитентов т.н.голубых фишек или субъектов РФ из-за одного неудачного решения. Так что мне такой фильтр о котором Вы говорите не нужен. Здесь важнее всего будет фильтр на отсев не надежных эмитентов, у которых есть риск банкротства/не выполнения обязательств.Насчет тарифов. Уже не в первый раз пишу о том, что более 10 лет назад вышел с РЦБ и как раз статья меня побудила к возвращению. Про тарифы еще предстоит узнать. Но когда я торговал, тарифы не были уж больно грабительскими, сейчас по логике они должны быть еще ниже. Но здесь могу ошибаться."
    },
    {
      "id": 21765904,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T08:47:00.000Z",
      "text": "Если из-за одной новости о начале выпуска какого-то неудачного продукта компания может допустить технический дефолт или совсем обанкротиться, то скорее всего эта компания вряд ли имеет высшие кредитные оценки и ее бумаги вряд ли находится в ломбардном списке ЦБ. И торговля такими бумагами изначально считается высокорискованной. Я же говорил о торговле облигациями, которые заменяют банковские депозиты, так как посыл статьи был именно в альтернативе депозитов, а не в погоне за сверх доходами. А это в первую очередь надежность эммитентов.За последние 10 лет в России я не припомню банкротств эмитентов т.н.голубых фишек или субъектов РФ из-за одного неудачного решения. Так что мне такой фильтр о котором Вы говорите не нужен. Здесь важнее всего будет фильтр на отсев не надежных эмитентов, у которых есть риск банкротства/не выполнения обязательств.Насчет тарифов. Уже не в первый раз пишу о том, что более 10 лет назад вышел с РЦБ и как раз статья меня побудила к возвращению. Про тарифы еще предстоит узнать. Но когда я торговал, тарифы не были уж больно грабительскими, сейчас по логике они должны быть еще ниже. Но здесь могу ошибаться."
    },
    {
      "id": 21765958,
      "author": "empenoso",
      "datetime": "2020-06-23T08:56:48.000Z",
      "text": "А ЮКОС когда был?"
    },
    {
      "id": 21766032,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T09:07:43.000Z",
      "text": "ну это в начале 2000-х было, то есть почти 20 лет назадда и что уж говорить, все-таки ЮКОС — исключение, нежели закономерностьплюс и новость там была не о выпуске какой-то неудачной продукции, а это было политическое решение"
    },
    {
      "id": 21777382,
      "author": "esemi",
      "datetime": "2020-06-25T18:24:19.000Z",
      "text": "А как с «Трансаэро» было в 2014?)"
    },
    {
      "id": 21766142,
      "author": "retverd",
      "datetime": "2020-06-23T09:27:21.000Z",
      "text": "А вы считали? Мне кажется, комиссии больше съедят. Мне кажется, выгоднее ботом на предторгах выставлять заявки на продажу в расчете на «толстые пальцы», иногда прострелы в обе стороны бывают на 2%-5%."
    },
    {
      "id": 21766508,
      "author": "empenoso",
      "datetime": "2020-06-23T10:46:31.000Z",
      "text": "Поддерживаю."
    },
    {
      "id": 21766624,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T11:24:24.000Z",
      "text": "Комиссии не считал, так как давно не торгую. Этим летом, если получится, то вернусь на рынок. По результатам, вероятно, напишу статью. И на случай «толстых пальцев» тоже посмотрим :)«Толстые пальцы» это же из казуса с Самсунг или какая-то специфичная терминология?"
    },
    {
      "id": 21766824,
      "author": "retverd",
      "datetime": "2020-06-23T12:06:20.000Z",
      "text": "Точно не скажу, но мне кажется этот термин уже давно в обиходе, в том числе и в англоязычном."
    },
    {
      "id": 21767386,
      "author": "empenoso",
      "datetime": "2020-06-23T14:31:24.000Z",
      "text": "«Толстые пальцы» типа проскальзывание получается?"
    },
    {
      "id": 21768452,
      "author": "retverd",
      "datetime": "2020-06-23T20:12:42.000Z",
      "text": "Не типа, а именно оно, так сказать, следствие «толстых пальцев». Хотя теперь это может быть ошибка не человека-трейдера, а сбоя или неожиданного поведения алгоритма в боте."
    },
    {
      "id": 21769020,
      "author": "empenoso",
      "datetime": "2020-06-24T02:05:12.000Z",
      "text": "Да, современная интерпретация."
    },
    {
      "id": 21767390,
      "author": "empenoso",
      "datetime": "2020-06-23T14:32:01.000Z",
      "text": "Комиссии и проскальзывание могут убить любую идею."
    },
    {
      "id": 21767438,
      "author": "AlexanderPetrenko",
      "datetime": "2020-06-23T14:45:41.000Z",
      "text": "Теперь мне вот захотелось как можно быстрее реализовать на РЦБ свой алгоритм, чтобы сказать «Да все работает! Просто надо немного проявить гибкость мышления», ну или на крайний случай — «Да Вы были правы, черт подери! Лютые комиссии губят на корню все благие намерения.» :)Спасибо за поднятую тему, оказалось очень актуальноТолстые пальцы, это в общем случае, когда какие-то трейдеры крупных фондов, допускают ошибки в заявках (цены, количество), в т.ч.из-за своих толстых пальцев :))ru.qwe.wiki/wiki/Fat-finger_error"
    },
    {
      "id": 21767512,
      "author": "empenoso",
      "datetime": "2020-06-23T15:04:26.000Z",
      "text": "Обычно правда работающими торговыми идеями не делятся. Но вы хоть пошлите телеграмуполучилось или нет."
    },
    {
      "id": 22716406,
      "author": "empenoso",
      "datetime": "2021-02-22T11:25:06.000Z",
      "text": "Получилось спустя полгода?"
    },
    {
      "id": 21762216,
      "author": "empenoso",
      "datetime": "2020-06-22T10:14:28.000Z",
      "text": "Docker support. Пользовательsupaflysterсделалфорк с Docker версией."
    },
    {
      "id": 21762616,
      "author": "slava_k",
      "datetime": "2020-06-22T11:44:59.000Z",
      "text": "Спасибо за статью.Возможно было бы интересным:— видеть дюрацию также и в целых днях (где это возможно), а не в месяцах;— оценивать также и общую годовую доходность с учетом изменения стоимости облигации с даты сделки;— выражать объём сделок не только одной цифрой, но и видеть небольшой график объема сделок в прошлом, не глубже двух дюраций либо года, что больше;— видеть «возраст» размещения компании, количество месяцев/лет с момента начала размещений облигаций (либо конкретного их типа);— видеть также объем размещений долга компании (либо его полный исторический график), либо общий по всем типам облигаций, либо по каким-то конкретным;— видеть соотношение объемов облигаций ко всему существующему долгу, включая акции и все виды деривативов;— видеть топ-10 список компаний из той же отрасли, у кого имеются кросс-покупки облигаций (обе компании владеют долгами друг друга);Дюрация в днях может помочь в управлении портфелями облигаций на границах размещений отдельных облигаций.Общая годовая доходность может помочь точнее расчитывать доходность портфеля облигаций и оценивать поведение доходности по времени и ее вклад в доходность портфеля. По этому показателю можно расчитать «токсичность» облигации, т.е. насколько сильно она влияет на общую доходность портфеля, как долго находится в минусе по времени нахождения в портфеле и прочие варианты.Вид графика объемов сделок может помочь с выявлением возможной сезонности в характере сделок и помочь предсказывать моменты больших/максимальных объемов для входа/выхода из сделок, упрощая в целом этот процесс.Возраст размещения долгов это больше как маркер стабильности компании, насколько давно компания занимает на рынке и какие у этих займов возможные цели, кроме экономии.Объём размещения долга в облигациях (и не только) и его характер может помочь с пониманием что происходит с компанией, не идет ли она «вразнос» или же большие объемы займов связаны с чем-то естественным/сезонным.Соотношение объема облигаций ко всему существующему долгу может помочь понять популярность инструмента (облигации) и примерно «предсказывать» общие объемы займов по облигациям. Может быть полезным, если у компании имеется сезонность в займах.Топ список компаний-конкурентов может помочь с пониманием отрасли в целом, насколько она растет и насколько она склонна к конкуренции. Когда компании-конкуренты достаточно сильно влияют через владение долгами друг на друга, то это может привести к высокой корелляции движения облигаций таких компаний. И это также может быть полезным в определенных случаях (начало проблем у одной из таких компаний может дать возможность работы на расширяющихся спредах между облигациями компаний-конкурентов)."
    },
    {
      "id": 21762782,
      "author": "empenoso",
      "datetime": "2020-06-22T12:18:15.000Z",
      "text": "Это интересно, но требует весьма глубокой проработки, а второй пункт это вообще к учету портфеля относится.видеть дюрацию также и в целых днях (где это возможно), а не в месяцах;оценивать также и общую годовую доходность с учетом изменения стоимости облигации с даты сделки;выражать объём сделок не только одной цифрой, но и видеть небольшой график объема сделок в прошлом, не глубже двух дюраций либо года, что больше;видеть «возраст» размещения компании, количество месяцев/лет с момента начала размещений облигаций (либо конкретного их типа);видеть также объем размещений долга компании (либо его полный исторический график), либо общий по всем типам облигаций, либо по каким-то конкретным;видеть соотношение объемов облигаций ко всему существующему долгу, включая акции и все виды деривативов;видеть топ-10 список компаний из той же отрасли, у кого имеются кросс-покупки облигаций (обе компании владеют долгами друг друга);Мне очень понравилось, но на мой взгляд это всё сильно усложняет — интересных и ликвидных облигаций на российском рынке и так не особо много. А если такой глубинный анализ проводить боюсь вообще может оказаться, что ничего покупать и и не следует, а стоит смотреть в сторону облигационных ETF."
    },
    {
      "id": 21762830,
      "author": "AAAbramenko",
      "datetime": "2020-06-22T12:25:00.000Z",
      "text": "Наводки интересные, но это уже не скрипт, а полноценное приложение."
    },
    {
      "id": 21762926,
      "author": "empenoso",
      "datetime": "2020-06-22T12:41:40.000Z",
      "text": "Слишком специализированное на мой взгляд."
    },
    {
      "id": 21762966,
      "author": "slava_k",
      "datetime": "2020-06-22T12:47:19.000Z",
      "text": "С ETF тоже свои заморочки, те же проблемы с ликвидностью.Это были больше мысли вслух, чем пожелания по доработкам. Естественно, для полноценного анализа нужен сложный софт, который в одного довольно сложно/долго реализовать. Ну и нет смысла ограничиваться только российским рынком, софт можно аккуратно разделить на специфические и универсальные части. Это как работа с брокерами/биржами: у кого-то FIX/FAST, а у кого-то… PLAZA :) Но со всем этим можно жить и работать тем не менее. Условия торговли у всех разные и рано или поздно лидеры по таким условиям меняются, зачастую они связаны с конкретной страной. Потому ограничивать себя чем-то одним черевато. Самый правильный вариант — в еще большем усложнении и работе в разных юриздикциях с разными поставщиками услуг, постоянно оценивая риск/ликвидность по инструментам и источникам услуг, имея под рукой наиболее корелированные инструменты для возможности переключения на них при необходимости (при запрете/невозможности торговли по каким-то конкретным из-за различных ограничений).Всё это сложно, это постоянный «геморрой» и неопределенность с ожиданием результата. Но тем не менее очень интересно и вариантов самореализации гораздо больше, чем просто работа на дядю. Нужны как всегда — хорошие мозги и терпение. Много терпения."
    },
    {
      "id": 21762996,
      "author": "empenoso",
      "datetime": "2020-06-22T12:54:37.000Z",
      "text": "Вот и он примерно о том же:"
    },
    {
      "id": 21762928,
      "author": "sergs79",
      "datetime": "2020-06-22T12:41:58.000Z",
      "text": "Отличное решение, сам таким пользуюсь. Всегда есть куда расти, и куда развиваться. Еще бы присобачить к этому делу графику, так организм наш лучше воспринимает информацию, и цены не будет. И приготовьтесь к жесткой критике, многие товарищи откровенно завидуют таким штукам, поэтому начинают всячески «нахваливать», начиная от «этот метод не работает», и заканчивая «не грузиться». халявщиков всегда у нас в избытке, они всегда «убьют» и волю, и желание, ну и конечно сам продукт."
    },
    {
      "id": 21762936,
      "author": "empenoso",
      "datetime": "2020-06-22T12:42:45.000Z",
      "text": "Мне кажется конкретно в моём случае графики вроде как ни к чему? Что на них должно быть?"
    },
    {
      "id": 21763062,
      "author": "sergs79",
      "datetime": "2020-06-22T13:11:47.000Z",
      "text": "графика — это визуализация информации, любую табличку можно вывести в граф. Какой параметр использовать — это может быть ожидаемая доходность%, срок работы, либо какой коэф. Использовать или не использовать тут графику — конечно дело вкуса."
    },
    {
      "id": 21763770,
      "author": "guestl",
      "datetime": "2020-06-22T16:07:27.000Z",
      "text": "FR. может добавить в фильтры и вывод или только в вывод такой показатель как «отрасль»? чтоб было легче отсеять лизинги, застройщиков и микрофинансистов?"
    },
    {
      "id": 21763892,
      "author": "AAAbramenko",
      "datetime": "2020-06-22T16:52:06.000Z",
      "text": "API Мосбиржи не предоставляет такую информацию как \"отрасль\"."
    },
    {
      "id": 21764314,
      "author": "guestl",
      "datetime": "2020-06-22T19:29:45.000Z",
      "text": "печально. я для своей таблицы отрасль дергаю из finviz, но у меня нет российских облиг. думал, что есть сервисы где можно по тикеру узнать."
    },
    {
      "id": 21763898,
      "author": "empenoso",
      "datetime": "2020-06-22T16:54:40.000Z",
      "text": "Биржа не предоставляет подобную информацию."
    },
    {
      "id": 21764316,
      "author": "guestl",
      "datetime": "2020-06-22T19:29:49.000Z",
      "text": "печально. я для своей таблицы отрасль дергаю из finviz, но у меня нет российских облиг. думал, что есть сервисы где можно по тикеру узнать."
    },
    {
      "id": 21764924,
      "author": "empenoso",
      "datetime": "2020-06-23T02:03:55.000Z",
      "text": "По облигациям есть вроде категории в black терминал, но и то не для всех."
    },
    {
      "id": 21763792,
      "author": "bolnikh",
      "datetime": "2020-06-22T16:13:06.000Z",
      "text": "А какая стратегия работы с акциями? Покупаете и ждете закрытия? или как?"
    },
    {
      "id": 21763910,
      "author": "empenoso",
      "datetime": "2020-06-22T16:57:09.000Z",
      "text": "Конкретно это только по облигациям.Над акциями думаю.Никаких фундаментальных параметров биржа не предоставляет."
    },
    {
      "id": null,
      "author": "guestl",
      "datetime": "2020-06-22T19:31:39.000Z",
      "text": "Доходность рынка выше, согласен. Но рисков в акциях больше. И можно попасть на тот временной диапазон, когда тренд медвежий. Поэтому, как мне кажется, лучше все же по классике — часть в акции или фонды, часть в облигации."
    },
    {
      "id": 21764322,
      "author": "guestl",
      "datetime": "2020-06-22T19:31:39.000Z",
      "text": "Доходность рынка выше, согласен. Но рисков в акциях больше. И можно попасть на тот временной диапазон, когда тренд медвежий. Поэтому, как мне кажется, лучше все же по классике — часть в акции или фонды, часть в облигации."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2020-06-23T02:06:04.000Z",
      "text": "Asset allocation тоже забывать не следует."
    },
    {
      "id": 21764928,
      "author": "empenoso",
      "datetime": "2020-06-23T02:06:04.000Z",
      "text": "Asset allocation тоже забывать не следует."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2020-06-23T10:48:21.000Z",
      "text": "А есть издание книги на русском?"
    },
    {
      "id": 21766516,
      "author": "empenoso",
      "datetime": "2020-06-23T10:48:21.000Z",
      "text": "А есть издание книги на русском?"
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2020-06-23T14:32:48.000Z",
      "text": "А вы и практически применяете эту теорию?"
    },
    {
      "id": 21767396,
      "author": "empenoso",
      "datetime": "2020-06-23T14:32:48.000Z",
      "text": "А вы и практически применяете эту теорию?"
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 21764926,
      "author": "empenoso",
      "datetime": "2020-06-23T02:04:49.000Z",
      "text": "Разумно, ну ситуации разные бывают — облигации нельзя сбрасывать со счетов."
    },
    {
      "id": 21867236,
      "author": "Andrey_Epifantsev",
      "datetime": "2020-07-20T11:39:35.000Z",
      "text": "А подскажите пожалуйста, как в вашем скрипте отфильтровать облигации по валюте номинала? Хочется посмотреть какие есть наиболее ликвидные облигации в евро и долларах."
    },
    {
      "id": 21871996,
      "author": "empenoso",
      "datetime": "2020-07-21T12:48:03.000Z",
      "text": "Такого функционала в нём нет."
    },
    {
      "id": 21925272,
      "author": "empenoso",
      "datetime": "2020-08-05T10:11:05.000Z",
      "text": "Если не хотите заморачиваться с Node.js, тоТ—Ж опубликовал мой другой вариант этого скрипта для поиска ликвидных облигаций на Московской бирже— на этот раз внутри гугл таблиц (реализация через Google Apps Script)."
    }
  ]
}