{
  "url": "https://habr.com/ru/articles/515316/comments/",
  "article_id": 515316,
  "title": "Как стать экспертом для поисковых систем",
  "comments": [
    {
      "id": 21961438,
      "author": "remzalp",
      "datetime": "2020-08-17T05:23:48.000Z",
      "text": "Стоит как минимум регистрировать домен на себя, чтобы в случае неправильного поведения сервиса (стал притеснять, упал, сменился владелец и правила) просто взять и поднять у другого сервиса. При этом раскрученное доменное имя все еще с вами и оно не изменилось."
    },
    {
      "id": 21961458,
      "author": "empenoso",
      "datetime": "2020-08-17T05:40:49.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 21961548,
      "author": "itsoft",
      "datetime": "2020-08-17T06:22:54.000Z",
      "text": "Вот я себя также вбилyandex.ru/search/?text=%D0%98%D0%B3%D0%BE%D1%80%D1%8C%20%D0%A2%D0%B0%D1%80%D0%B0%D1%81%D0%BE%D0%B2%20%D0%B8%D1%82-%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D1%81%D1%82&lr=213И яндекс про меня всё выдаёт. Гугл выдаёт не только про меня. Но там проблема, что я не один айтишник с таким именем и фамилией.Не понял я всё же достигнутый результат в условиях того, что есть и другие специалисты с таким же именем. А если их нет, то поисковики вас и так будут выдавать.Куда эффективнее какой-нибудь никнейм или узкая специализация, тогда и проблем не будет. И даже подсказка в поисковой строке яндекса появляется.Но и непонятно зачем. Ищут же не автора обычно, а тему, проблему. На автора всем пофиг. Никто не запоминает даже автора книги по айтишной тематике. Кому он нафиг нужен это автор? Он же не Булгаков, чтобы его запоминать. В ИТ нет Булагаковых. Те классики, что есть — выпустили по одной книге. Брукс, Керниган, Ритчи, Кодд, Страуструп, Кнут, Шилд, Котеров. Толку от знания этих фамилий немного, только дань уважения к самим авторам. Новое издание их книги будет на 90% совпадать с предыдущем."
    },
    {
      "id": 21961578,
      "author": "empenoso",
      "datetime": "2020-08-17T06:38:25.000Z",
      "text": "Мне кажется что тут дело в акцентах — когда у человека есть проблема он ищет про неё — тут неважно кто про неё пишет.Но если человек хочет узнать кто этот автор, чем он занимается — он ищет по фамилии автора — и вот это уже тот самый случай."
    },
    {
      "id": 21961700,
      "author": "podde",
      "datetime": "2020-08-17T07:20:37.000Z",
      "text": "На мой взгляд, вы подменили понятия: вы говорите про поиск нужной информации \"по теме\", а автор говорит о личном бренде и экспертности, о своём сетевом реноме. Впрочем, именно это и указано в заголовке статьи."
    },
    {
      "id": 21961900,
      "author": "aio350",
      "datetime": "2020-08-17T08:26:06.000Z",
      "text": "Хорошая статья. Спасибо"
    },
    {
      "id": 21961928,
      "author": "empenoso",
      "datetime": "2020-08-17T08:31:55.000Z",
      "text": ""
    }
  ]
}