{
  "url": "https://habr.com/ru/articles/533016/comments/",
  "article_id": 533016,
  "title": "Поиск замены депозита в облигациях с учетом того, что с 1 января 2021 года все выплаты облагаются налогами",
  "comments": [
    {
      "id": 22494238,
      "author": "edogs",
      "datetime": "2021-01-04T03:03:28.000Z",
      "text": "Для тех кто совсем не в теме, мы бы сделали ремарка:а) облигации ничем и никак не застрахованы (в отличии от вкладов), если фирма скопытится — шансов что-то получить почти ноль, кредитор третьей очереди что-ли.б) по облигациям кроме купонного дохода могут быть и другие внезапные условия (например, условие при которых купон не выплачивается, или при которых фирма может выкупить свои купоны по номиналу), т.е. достаточно часто оказывается что процент не гарантированныйв) статистика по ликвидности это наука о прошлом, хочется продать — не факт что будет покупатель, ведь даже при ликвидности спрэд на облигации куда больше чем на акции.г) цена облигаций меняется, сегодня купил за 100р с 6% доходв, завтра она стоит 80р, после завтра 120р. Второе приятно, первое не оченьПо факту, покупая без анализа самой фирмы можно попасть в «идеальный шторм». Показатели какие-то от которых зависит выплата дохода падают, падает цена облигаций, купон не выплачивается из-за условий по выплате, риски банкротства возрастают, ликвидность никакая, страхования от государства нет — и резко приплываешь без шанса выскочить.А вообще, если бы речь шла не о россии, а о стране где народ всё время пытаются обмануть, мы бы вспомнили вот этот анекдотанекдотЖенщина лежит в постели с любовником. Вдруг раздаетсязвонок в дверь, она понимает, что пришел муж и в порыве отчаяниявосклицает:— Господи, сделай так, чтобы он ничего не заметил!Разверзаются небеса и господь говорит:— Хорошо, я так сделаю, но ты умрешь от воды.Она говорит:— Хорошо.Проходит год, два года. Женщина не купается, моется только под душем, стараетсяпо возможности любыми путями избегать воды. Проходит 3 года, онанеожиданно выигрывает путевку в морской круиз.Посомневалась-посомневалась, и решила поехать. Плывет она на шикарномлайнере, вдруг ночью начинается шторм, все в панике корабль тонет. Онаопять в порыве отчаяния восклицает:— Господи, ну ты же не можешь из-за меня одной потопить весь корабль!Разверзаются небеса и господь говорит:— Да я вас, *****, на этот корабль три года собиралПотому что как-то уж очень сильно народ привлекается (понижением ставок по вкладам) то в бетониум (слишком льготными ставками по ипотеке и всякими дотациями военным и т.д.), то в фондовый рынок (вычетами по ИИС, облигациями и так далее), в общем куда угодно, кроме кэша или хотя бы относительно ликвидного безнала."
    },
    {
      "id": 22494242,
      "author": "empenoso",
      "datetime": "2021-01-04T03:10:15.000Z",
      "text": "Вы абсолютно правы — в инвестициях никто и ничего не может гарантировать.Всё может неожиданно поменяться и от человека это никак не зависит."
    },
    {
      "id": 22494246,
      "author": "empenoso",
      "datetime": "2021-01-04T03:13:46.000Z",
      "text": "Именно с облигациями можно брать не более 5% в каждую от всех денег которые направили в облигации и держать до погашения — тогда текущие курсы не так уж и важны."
    },
    {
      "id": 22494282,
      "author": "Getequ",
      "datetime": "2021-01-04T03:57:38.000Z",
      "text": "а) облигации ничем и никак не застрахованы (в отличии от вкладов), если фирма скопытится — шансов что-то получить почти ноль, кредитор третьей очереди что-ли.так не покупайте бумаги рандомных компаний, или чего-то вроде быстроденег. Вклады тоже не шибко застрахованы если у вас больше 1.4ККг) цена облигаций меняется, сегодня купил за 100р с 6% доходв, завтра она стоит 80р, после завтра 120р.ну это вы загнули, это вам не акции что бы были такие колебания. бывают просадки со 105% до 99% или 115% до 101% в периоды очередных санкций, но, как правило, возвращаются к прежним значениям. Если это конечно не дефолт по бумаге и аривидерчи))"
    },
    {
      "id": 22494296,
      "author": "empenoso",
      "datetime": "2021-01-04T04:17:55.000Z",
      "text": "Этот лимит уже поменяли для особых случаев:МОСКВА, 1 октября. /ТАСС/. Лимит страхового возмещения по банковским депозитам, который составляет 1,4 млн руб., был повышен до 10 млн руб. для случаев особых жизненных обстоятельств. Сумма возмещения увеличивается в соответствии с федеральным законом №163, вступающем в силу с 1 октября.В список особых жизненных обстоятельств входят продажа вкладчиком жилого помещения или земельного участка, на котором расположен жилой, садовый дом, иные строения, также получение наследства, возмещение ущерба, причиненного жизни, здоровью или личному имуществу, получение социальных выплат, пособий, исполнение решения суда, получение грантов в форме субсидий. При этом, если вкладчик имеет несколько счетов эскроу в одном банке на общую сумму более 10 млн рублей, возмещение выплачивается по каждому вкладу, но в целом не более 10 млн рублей. Вкладчик имеет право получить возмещение в повышенном размере в течение трех месяцев, с момента поступления средств на счет."
    },
    {
      "id": 22494322,
      "author": "edogs",
      "datetime": "2021-01-04T05:05:19.000Z",
      "text": "так не покупайте бумаги рандомных компаний, или чего-то вроде быстроденегЭпик-фэилы бывают у всех с одной стороны (дойч-банк упавший в 10 раз в германии, обанкротившийся мастербанк в россии, а с другой стороны у надежных компаний ставка по облигациям окажется в целом не выше депозитной, ибо рынок-с.А пример с transocean (RIG тикер), в 2008 году стоила 150, сейчас 2. А компания из категории нефти, солидная европейская фирма. В 75 раз падение, Карл:)Вклады тоже не шибко застрахованы если у вас больше 1.4ККЭто лимит на один банк. 10 банков уже 14кк и так далее.это вы загнули, это вам не акции что бы были такие колебания. бывают просадки со 105% до 99% или 115% до 101% в периоды очередных санкцийПо поводу «завтра и послезавтра» конечно загнули, но 14 год вполне себе показал, что на 30% облигации упасть могут легко. И тут вопрос в том, когда больше шанс на ее падение, а когда на рост.Тут ведь в чем дело — цена облигации зависит от ее доходности относительно других инструментов.Возьмем тот же 2014 год, ставки в банках до 22% по депозитам на 3 года (т.е. за 3 года со 100р будет 166р), облигация дающая 6% даст за 3 года 118р с той же сотни, т.е. для равной доходости (рынок-с) облигация должна упасть примерно до 71р — 29% падение.При этом с депозитом у Вас есть относительная свобода выбора. Выросли ставки — переложились в более выгодный депозит, упали ставки — продолжаете держать на старом выгоднее текущих ставок — в любом случае в плюсе. А с облигациями — выросли ставки — облигации подешевели и считаем убытки, упали ставки — облигации подорожали но всего лишь до уровня доходности депозита… итого или минус или ноль."
    },
    {
      "id": 22494476,
      "author": "sshikov",
      "datetime": "2021-01-04T07:10:53.000Z",
      "text": ">По факту, покупая без анализа самой фирмыНу вы все правильно говорите, но разве кто-то такую фигню предлагал? Автор как раз пытается автоматизировать отбор — ну как минимум по доходности и ликвидности (понятно, что ликвидность на сегодня, но ничего лучше придумать все равно нельзя)."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2021-01-06T02:01:55.000Z",
      "text": "Да, это быстрое и простое решение."
    },
    {
      "id": 22501798,
      "author": "empenoso",
      "datetime": "2021-01-06T02:01:55.000Z",
      "text": "Да, это быстрое и простое решение."
    },
    {
      "id": 22502046,
      "author": "sshikov",
      "datetime": "2021-01-06T06:49:50.000Z",
      "text": "Ну да, это не анализ компании, конечно. Это такой хак, если угодно.Но вы сами сказали — можно был бы предугадать — а можно было бы и нет, точного критерия не придумали.>Так что если деньги жгут карман и надо потратить их вот прямо супер-срочно, тогда да.Не, ну скорее не так. Такой скрипт нужно просто выполнять периодически. Вас же никто не заставляет прямо сегодня тратить все свои деньги — мы можем такой же анализ повторить завтра."
    },
    {
      "id": 22502118,
      "author": "empenoso",
      "datetime": "2021-01-06T07:18:14.000Z",
      "text": "А зачем выполнять скрипт, если ничего не собираетесь покупать?"
    },
    {
      "id": 22502154,
      "author": "sshikov",
      "datetime": "2021-01-06T07:31:13.000Z",
      "text": "Ну, я работал три года с хвостиком на FI Desk, и наши алгоритмы вообще оценивали каждую бумагу после каждой сделки по ней на рынке (понятно, что для этого нужно немного больше, чем для работы такого скрипта, как тут описан — нужна подписка на все события от биржи, и это просто будет не бесплатно).И понятно, что индивидуальному инвестору выполнять скрипт раз в час нет смысла — все равно у вас нет столько времени на анализ результата, если для вас это не основная работа. Но если вы анализируете ту же ликвидность за неделю — выполнить скрипт раз в сутки совершенно не помешает, чтобы хотя бы понимать, что неликвидная вчера и отброшенная скриптом бумага стала ликвидной сегодня — что плохого в таком плане?"
    },
    {
      "id": 22502200,
      "author": "empenoso",
      "datetime": "2021-01-06T07:43:46.000Z",
      "text": "Я согласен с вами, но этот скрипт как раз и нужен чтобы не запускать его каждый день — в нём проверяется количество сделок в каждый из дней за последние две недели. Если за хотя бы один день нет сделок бумага выпадает из списка. Хотя этот параметр можно в самом коде отключить например, если зачем то это надо."
    },
    {
      "id": 22502214,
      "author": "sshikov",
      "datetime": "2021-01-06T07:46:10.000Z",
      "text": "Ну, если на то пошло, я и не предлагал каждый день. Я предлагал периодически :)"
    },
    {
      "id": 22504418,
      "author": "gotch",
      "datetime": "2021-01-06T17:30:09.000Z",
      "text": "Страхование депозита это тоже частично фикция. Посмотрите судебную практику отказа АСВ в выплате страхового возмещения, проникнитесь.Кроме того, в случае глобального кризиса, из-за которого суверенный долг пойдет по наклонной, вклады физиков первые пойдут под нож. Не будет у АСВ денег.Нет, будет конечно. Мне ведь Сбербанк заплатил 130 рублей примерно от вклада времен СССР (одна-две среднененьких зарплаты того времени). Такси дороже стоило."
    },
    {
      "id": 22505666,
      "author": "empenoso",
      "datetime": "2021-01-07T04:37:46.000Z",
      "text": "Справедливости ради надо заметить что я сам лично получил несколько выплат от АСВ несколько лет назад. Когда вклады были под большие %."
    },
    {
      "id": 22506180,
      "author": "gotch",
      "datetime": "2021-01-07T09:01:43.000Z",
      "text": "Да, в большинстве случаев это работает, но можно попасть под раздачу вместе с недобросовестными вкладчиками. Знаю людей, которых вместо вклада при продлении договора на вексель развели (за 2 недели до отзыва лицензии), но это, конечно, совсем другая история.Здесь вопрос больше что надежнее — суверенный долг, или АСВ? По мне так одна контора.Остается банкротство брокера. Я немного напрягся при санации Открытия, но брокера в итоге это никак не затронуло (кроме стрижки с клиентов комиссии)."
    },
    {
      "id": 22506458,
      "author": "empenoso",
      "datetime": "2021-01-07T10:22:44.000Z",
      "text": "По вашим комментариям к статье видно что вы опытный человек"
    },
    {
      "id": 22494302,
      "author": "empenoso",
      "datetime": "2021-01-04T04:24:19.000Z",
      "text": "У облигаций тоже курс меняется иногда будь здоров, но если держишь до погашения, то это неважно."
    },
    {
      "id": 22494596,
      "author": "xxxkms",
      "datetime": "2021-01-04T08:12:15.000Z",
      "text": "А тут бац и ЦБ начинает последовательно ужесточать ДКП, по прежнему не важно и держим до погашения? :)"
    },
    {
      "id": 22494600,
      "author": "empenoso",
      "datetime": "2021-01-04T08:12:41.000Z",
      "text": "По ситуации смотрим."
    },
    {
      "id": 22496698,
      "author": "gotch",
      "datetime": "2021-01-04T18:37:32.000Z",
      "text": "Это, кстати, мне кажется, тоже в своем роде заблуждение. Вот вы купили облигацию (абсолютно надёжную, типа ОФЗ) с купоном 4.5% годовых. Тут раз, ключевая ставка 8%, депозиты в банках аж по 10% — кризис. И смысл держать подешевевшее тело? Продали с убытком, уменьшили налог, тут же переложились в бумагу с большей доходностью или депозит."
    },
    {
      "id": 22497764,
      "author": "empenoso",
      "datetime": "2021-01-05T03:00:04.000Z",
      "text": "С такой низкой доходностью через этот скринер он не найдёт, если только конечно специально не задавать при поиске."
    },
    {
      "id": 22497766,
      "author": "empenoso",
      "datetime": "2021-01-05T03:01:06.000Z",
      "text": "Но тогда возникает вопрос зачем этим скринером пользоваться если выбирать такие низкодоходные инструменты."
    },
    {
      "id": 22498050,
      "author": "gotch",
      "datetime": "2021-01-05T07:05:08.000Z",
      "text": "Почему, 4.5% рыночная вполне ставка.Ключевая ставка — ориентир для абсолютно надёжных бумаг, банальная общепринятая стоимость денег в экономике. Всё, что сверху — премия за риск.Ну и наша задача найти переоцененный риск, или допустимый уровень повышенного риска. Таким, например, были субфедеральные бумаги, или сейчас бумаги госбанков ВТБ, ГПБ, РСХБ. Премия есть, а повышенного риска (если это не субординированный выпуск для банковской) по сути нет.Поэтому сразу в quik можем ставить доходность от 4.5%.Если стоимость денег в экономике станет 5%, то у вас тело просядет на эти 0.5% умноженное на срок. Вы можете продать тело и перевложиться, по сути ничего не потеряв.Только дальше пошли нюансы — комиссии, налоги, амортизация, срок погашения и т.д."
    },
    {
      "id": 22498068,
      "author": "empenoso",
      "datetime": "2021-01-05T07:20:05.000Z",
      "text": "Ну например я не готов покупать облигации с доходностью 5% в рублях. Я совершенно точно знаю что можно подобрать бумаги с такой же доходностью и выше, но в долларах, к тому же которые платят ежемесячно. И их рейтинг будет выше.Если говорим о доходности ОФЗ, то вот график:"
    },
    {
      "id": 22498114,
      "author": "gotch",
      "datetime": "2021-01-05T07:31:42.000Z",
      "text": "можно подобрать бумаги с такой же доходностью и выше, но в долларах, к тому же которые платят ежемесячно. И их рейтинг будет выше.Для развития кругозора, можете подсказать пару таких бумаг?И, например, пару российских.Понимаю, что выдавать рыбные места не все готовы, поэтому если нет, то нет.Что же касается кривой ОФЗ, то доходность растет для пятилетних бумаг. Если у вас нет острого желания быть инвестором в ОФЗ-26218-ПД до 2031 года под 6.2% годовых, то и выбор невелик. На таком длинном периоде риски возрастают кратно. От термоядерной войны, до второго в новейшей истории дефолта с гораздо менее приятными вариантами реструктуризации, чем в 1998. Ну и логично, что продажа подешевевшего тела без дальнейшего реинвестирования принесет существенный убыток."
    },
    {
      "id": 22498192,
      "author": "empenoso",
      "datetime": "2021-01-05T07:52:18.000Z",
      "text": "Вот пожалуйста в моей статье«Куда вложить 100 000 $ на пять лет?»есть примеры подобных бумаг, которые дают доходность в долларах и ежемесячно."
    },
    {
      "id": 22498198,
      "author": "empenoso",
      "datetime": "2021-01-05T07:53:31.000Z",
      "text": "Ну, ОФЗ сейчас я и не покупаю…"
    },
    {
      "id": 22494354,
      "author": "KestNT",
      "datetime": "2021-01-04T05:37:38.000Z",
      "text": "Ого, мощно. Спасибо"
    },
    {
      "id": 22494356,
      "author": "empenoso",
      "datetime": "2021-01-04T05:38:12.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 22494412,
      "author": "Named",
      "datetime": "2021-01-04T06:34:42.000Z",
      "text": "Отличная работа, спасибо за скрипт"
    },
    {
      "id": 22494432,
      "author": "empenoso",
      "datetime": "2021-01-04T06:42:26.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 22494612,
      "author": "gotch",
      "datetime": "2021-01-04T08:19:18.000Z",
      "text": "Вот скажите, этот скриптдействительнопринципиально лучше пары фильтров в Quik?Доходность последней сделки, обороты, все это есть, а риск изменения купона в будущем, оферты или дефолта скрипт все рано предсказать не может.Всё это кончается выбором приемлемого эмитента и стоянием в стакане в ожидании продавца/покупателя. Кто-то переходит на новый уровень, и берёт с размещения."
    },
    {
      "id": 22494708,
      "author": "empenoso",
      "datetime": "2021-01-04T09:02:42.000Z",
      "text": "Этот скрипт принципиально отличается от фильтров в QUIK тем, что что скрипт проверяет каждый торговый день за две недели — было количество сделок больше заданного лимита или нет. А не просто не складывает нарастающим итогом то что в какой то день много, а в какой то вообще ничего.То есть фильтрует более тщательно.И сейчас стал отображать месяцы выплат."
    },
    {
      "id": 22494830,
      "author": "gotch",
      "datetime": "2021-01-04T09:42:17.000Z",
      "text": "Но смысл этого какой? Ликвидность была, ликвидность будет, сейчас ликвидности нет.Особенно ликвидность стимулирует свежая новость о внезапном траурном финансовом состоянии эмитента или техническом дефолте.Если вы выбрали, предположим, 10 интересующих бумаг, то на графике можете легко и за минуты посмотреть сделки за последние две недели. Кроме того, можете за секунду просчитать корреляцию цены/объема на прошлых сделках и встать в стакан по нужной цене.Скрипты, дело, конечно, хорошее, но проще можно сделать."
    },
    {
      "id": 22495088,
      "author": "empenoso",
      "datetime": "2021-01-04T11:05:21.000Z",
      "text": "Мне часто требовалось искать подобные варианты, которые можно купить прямо сейчас и в какой-то момент мне надоела эта ручная работа — так родился скрипт."
    },
    {
      "id": 22494706,
      "author": "Black_Spirit",
      "datetime": "2021-01-04T09:00:28.000Z",
      "text": "Это конечно все красиво, облигации и все такое. Но рублёвые активы это так себе удовольствие. Потеря покупательской способности рубля не компенсируется никакими купонами и процентами по вкладам. И на горизонте виднеется только усиление данной тенденции. Можно поиграть в угадайку и из валюты уйти частично в рублёвые облигации в периоды роста цен на нефть."
    },
    {
      "id": 22494712,
      "author": "empenoso",
      "datetime": "2021-01-04T09:03:14.000Z",
      "text": "Здесь вариант именно с рублёвой доходностью."
    },
    {
      "id": 22494752,
      "author": "Black_Spirit",
      "datetime": "2021-01-04T09:14:18.000Z",
      "text": "Годы 2011-13. Думал, дам рублю шанс, все вроде бы шло ничего себе. Часть активов была в рублёвых депозитах и облигациях. До сих пор помню то чувство, когда видишь декабрьским вечером 2014 года график с ценой доллара под 80. Эта беспомощность и самолинчевание: ну тыж видел политические события, они же должны были сработать, надо выходить из рубля. Но жирный купонный доход шептал: не ссы, прорвёмся. Ну я о том, что это все не работает. Вернее, работает до первого \"черного лебедя\". За период активного инвестирования таких лебедей можно поймать несколько."
    },
    {
      "id": 22494780,
      "author": "empenoso",
      "datetime": "2021-01-04T09:21:44.000Z",
      "text": "Я нигде не предлагал в статье вложить все деньги в рублёвые облигации.Это для целей, чтобы получать повышенный доход в рублях."
    },
    {
      "id": 22494786,
      "author": "Black_Spirit",
      "datetime": "2021-01-04T09:23:42.000Z",
      "text": "Вам спасибо, конечно! Интересный срипт"
    },
    {
      "id": 22494790,
      "author": "empenoso",
      "datetime": "2021-01-04T09:27:26.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 22494782,
      "author": "empenoso",
      "datetime": "2021-01-04T09:22:25.000Z",
      "text": "Я о том, что классов активов гораздо больше — надо использовать их все."
    },
    {
      "id": 22494836,
      "author": "gotch",
      "datetime": "2021-01-04T09:44:14.000Z",
      "text": "Инфляция в США ненулевая, а ставки — близки к нулю. И там потеряете легко. Нет золотой пилюли."
    },
    {
      "id": 22494756,
      "author": "Tolyanderv",
      "datetime": "2021-01-04T09:14:54.000Z",
      "text": "держу до последнего и всё ок"
    },
    {
      "id": 22494808,
      "author": "empenoso",
      "datetime": "2021-01-04T09:33:48.000Z",
      "text": "Да"
    },
    {
      "id": 22494844,
      "author": "gotch",
      "datetime": "2021-01-04T09:47:00.000Z",
      "text": "Вот из этого списка классно держать:www.rusbonds.ru/def.aspЕсть такая стратегия, покупать облигации третьесортного эмитента с доходностью *2 к рынку, и сливать в середине срока, пока он не дефолтнулся. Много есть способов ловли рыбы в мутной водице. )"
    },
    {
      "id": 22495094,
      "author": "empenoso",
      "datetime": "2021-01-04T11:06:30.000Z",
      "text": "Ну этот способ определенно не для всех."
    },
    {
      "id": 22495092,
      "author": "Vacheslanov",
      "datetime": "2021-01-04T11:05:36.000Z",
      "text": "Покупаю с расчетом на долгосрок. Иногда мониторю результаты, если взлетают-продаю, упали-докупаю. Всегда остаюсь в плюсе"
    },
    {
      "id": 22495096,
      "author": "empenoso",
      "datetime": "2021-01-04T11:07:16.000Z",
      "text": "Разумная стратегия."
    },
    {
      "id": 22495574,
      "author": "gotch",
      "datetime": "2021-01-04T13:11:46.000Z",
      "text": "Какими критериями руководствуетесь?Надежная бумага чувствительна к ключевой ставке, ненадежная — к финансовому состоянию эмитента. Если вы не арбитражите бумаги, то просто кидаете монетку, изменится ключевая ставка или нет."
    },
    {
      "id": 22498070,
      "author": "89vitaliklyadkin",
      "datetime": "2021-01-05T07:20:33.000Z",
      "text": "Интересно какой временной интервал может проанализировать и выдать результат такой скрипт"
    },
    {
      "id": 22498074,
      "author": "empenoso",
      "datetime": "2021-01-05T07:21:26.000Z",
      "text": "Любой, вы сами можете задать в настройках или переписать как вам надо — это ведь Open Source."
    },
    {
      "id": 22498078,
      "author": "89vitaliklyadkin",
      "datetime": "2021-01-05T07:22:23.000Z",
      "text": "Спасибо"
    },
    {
      "id": 22503440,
      "author": "Ilias",
      "datetime": "2021-01-06T13:25:45.000Z",
      "text": "Не очень понятно почему это замена депозита и причем тут налог. Вроде бы нет никаких попыток выбрать облигации с доходностью = (доход от депозита + 13% нового налога) или найти какие-то хитрые возможности не платить налог."
    },
    {
      "id": 22503698,
      "author": "empenoso",
      "datetime": "2021-01-06T14:30:09.000Z",
      "text": "Замена депозита потому поток стабильный."
    },
    {
      "id": 22503706,
      "author": "empenoso",
      "datetime": "2021-01-06T14:30:46.000Z",
      "text": "А хитрых возможностей не платить налог скорее всего просто нет."
    },
    {
      "id": 22504300,
      "author": "Ilias",
      "datetime": "2021-01-06T16:55:47.000Z",
      "text": "Насколько я слышал, он вроде бы на какие-то отдельные типы ETF не платится, нет?"
    },
    {
      "id": 22504328,
      "author": "empenoso",
      "datetime": "2021-01-06T17:03:49.000Z",
      "text": "Это как? Российские ETF не выплачивают дивиденды вообще."
    },
    {
      "id": 22504408,
      "author": "gotch",
      "datetime": "2021-01-06T17:25:21.000Z",
      "text": "ETF (БПИФ) на облигации не платят налог на купоны. Однако, когда вы продадите тело, с его роста придется заплатить налог, если у вас не вычет типа ИИС Б. Аналогично по инфляционным облигациям, по которым купоны не платятся, а индексируется тело."
    },
    {
      "id": 22505672,
      "author": "empenoso",
      "datetime": "2021-01-07T04:38:53.000Z",
      "text": "Смысл покупать актив и не получать текущих поступлений? Лично мне так не нравится."
    },
    {
      "id": 22553222,
      "author": "3aBulon",
      "datetime": "2021-01-17T06:03:44.000Z",
      "text": "Я думаю в прошлой статье стоит добавить вверху ссылку на более новую, и/или указать, что она менее актуальна."
    },
    {
      "id": 22553382,
      "author": "empenoso",
      "datetime": "2021-01-17T08:01:32.000Z",
      "text": "Хорошее замечание, с компьютера изменю."
    },
    {
      "id": 23047696,
      "author": "empenoso",
      "datetime": "2021-05-18T09:21:46.000Z",
      "text": "Сделал версию на гугл скриптах и опубликовал вТ—Ж (Тинькофф журнале)."
    }
  ]
}