{
  "url": "https://habr.com/ru/articles/577052/comments/",
  "article_id": 577052,
  "title": "Правила умного дома",
  "comments": [
    {
      "id": 23467220,
      "author": "putnik",
      "datetime": "2021-09-10T00:07:05.000Z",
      "text": "Видимо, я пропустил момент, когда квартиры на 46 метров с отдельной спальней стали называть однокомнатными. Хорошо живём.По статье остались несколько вопросов:Можно чуть подробнее про бюджет? 100 тысяч — это вообще всё, включая бризер, кондиционер, пылесос, колонку и т. д.? Есть ли какие-то ещё значимые статьи расходов?Как живётся хозяевам с электронным замком? В доме есть дополнительная защита вроде консьержа и камер на этажах, или всё отдано на откуп замку? Исхожу из того, что мне было плохо спалось с таким замком.Что используется для управления шторами? Удобно ли вообще с рулонными шторами?"
    },
    {
      "id": 23467246,
      "author": "edogs",
      "datetime": "2021-09-10T00:53:05.000Z",
      "text": "На счёт электронного замка на словах Евгений и Екатерина были очень довольны. Они ведь люди молодые и руки свободны когда подходишь к двери - ключ не надо доставать - прямо как бесключевой доступ в авто."
    },
    {
      "id": 23467286,
      "author": "empenoso",
      "datetime": "2021-09-10T02:11:43.000Z",
      "text": "На счёт электронного замка на словах Евгений и Екатерина были очень довольны. Они ведь люди молодые и руки свободны когда подходишь к двери - ключ не надо доставать - прямо как бесключевой доступ в авто."
    },
    {
      "id": 23471972,
      "author": "shaggyone",
      "datetime": "2021-09-11T08:25:33.000Z",
      "text": "Боюсь что ниша очень узкая - мало кому это интересно из широкой общественности."
    },
    {
      "id": 23472164,
      "author": "empenoso",
      "datetime": "2021-09-11T09:33:19.000Z",
      "text": "Боюсь что ниша очень узкая - мало кому это интересно из широкой общественности."
    },
    {
      "id": 23472832,
      "author": "edogs",
      "datetime": "2021-09-11T13:48:23.000Z",
      "text": "Будет стоить копейки, маржа низкая."
    },
    {
      "id": 23472918,
      "author": "empenoso",
      "datetime": "2021-09-11T14:30:30.000Z",
      "text": "Будет стоить копейки, маржа низкая."
    },
    {
      "id": 23473386,
      "author": "shaggyone",
      "datetime": "2021-09-11T18:06:12.000Z",
      "text": "Датики на окна как то продаются."
    },
    {
      "id": 23467288,
      "author": "empenoso",
      "datetime": "2021-09-10T02:14:22.000Z",
      "text": "Да, 100 тысяч вообще за все позиции автоматизации.Этот дом современный - закрытый двор, камеры везде. Консьержа в самом подъезде нет, но пункт охраны один на дом есть.На счёт штор уточню - всё таки не я там живу :)"
    },
    {
      "id": 23467672,
      "author": "empenoso",
      "datetime": "2021-09-10T06:19:52.000Z",
      "text": "Уточнения:Тут момент по вопросу:Можно чуть подробнее про бюджет? 100 тысяч — это вообще всё, включая бризер, кондиционер, пылесос, колонку и т. д.? Есть ли какие-то ещё значимые статьи расходов?не включил кондиционер, потому что сам по себе он тупой. Остальное - бризер, пылесос, замок включены.Кондиционер обошелся в 25 тысяч"
    },
    {
      "id": 23467444,
      "author": "empenoso",
      "datetime": "2021-09-10T04:48:09.000Z",
      "text": "На счёт штор: у штор горизонтальный привод, рулонных штор нет."
    },
    {
      "id": 23479182,
      "author": "shaggyone",
      "datetime": "2021-09-13T15:08:33.000Z",
      "text": "Да, но это конечнонаемаркетинг."
    },
    {
      "id": 23481362,
      "author": "empenoso",
      "datetime": "2021-09-14T08:11:34.000Z",
      "text": "Да, но это конечнонаемаркетинг."
    },
    {
      "id": 23467318,
      "author": "Uris",
      "datetime": "2021-09-10T02:55:36.000Z",
      "text": "Еще бы климатический мониторинг, контроль СО2 и управление влажностью, чтобы в отопительный сезон было бы комфортнее. Бризер хорошо, но может этого мало? Колонка с Алисой тоже очень хорошо, было бы интересно посмотреть как реализованы цифровые помощники. 100 тыс рублей звучит оптимистично. Вряд ли так, но воодушевляет, еще не понятно, как ведется мониторинг расхода ресурсов (счётчики воды, тепла, света) и как обеспечивается безопасность (охранная сигнализация, датчики протечек воды и задымления). Ну а в целом - очень хорошо. Автор молодец. Взгляд на некий стандарт умного дома и само его определение, это уже не малая работа. Я так и не пойму, по каким четким критериям можно назвать жилище умным домом. Здесь предпринята попытка это обобщить, что лично мне понравилось."
    },
    {
      "id": 23467322,
      "author": "empenoso",
      "datetime": "2021-09-10T03:06:46.000Z",
      "text": "Насколько я знаю показания счётчиков воды и электричества передаются автоматически. Такое есть в некоторых новых домах в Перми. Внешне это выглядит как счётчик воды без табло, от которого тянется проводок, который уходит в подъезд."
    },
    {
      "id": 23469040,
      "author": "gekkkon",
      "datetime": "2021-09-10T10:54:53.000Z",
      "text": "Москва давно ставит электросчетчики с централизованным съёмом информации (в счете за электричество пишут \"Показания передаются автоматически\"), в подмоскве электросчётчики на столбах ещё умнее -- стучат на базу и про потребление, и про превышение мощности, и отключают по радиокоманде. Какие счетчики сейчас ставят на столбах в деревнях, я хз, но сбытовикам эти счетчики с радиоканалом очень выгодны.Счетчики для воды тоже предлагают со встроенными модулями IoT, с симкой и батарейкой, российского производства, и сервис для приёма этих показаний тоже вроде есть."
    },
    {
      "id": 23469566,
      "author": "empenoso",
      "datetime": "2021-09-10T12:36:09.000Z",
      "text": "Я считаю что это отлично и не надо бегать с бумажками, но в Перми это единицы домов ¯\\_ʘ‿ʘ_/¯"
    },
    {
      "id": 23467532,
      "author": "DistortNeo",
      "datetime": "2021-09-10T05:34:56.000Z",
      "text": "Да, и здесь на хабре где-то была отличная статья про это."
    },
    {
      "id": 23467540,
      "author": "empenoso",
      "datetime": "2021-09-10T05:37:36.000Z",
      "text": "Да, и здесь на хабре где-то была отличная статья про это."
    },
    {
      "id": 23468794,
      "author": "empenoso",
      "datetime": "2021-09-10T09:59:43.000Z",
      "text": "CO2 датчик встроен в бризер. Был Увлажнитель воздуха XIAOMI Smartmi Air Humidifier, но отказались т.к. очень неудобно каждый день заливать по около 5 литров в него. Сейчас хозяева думают об увлажнителе который мог бы подключиться к водопроводу напрямую."
    },
    {
      "id": 23470342,
      "author": "Nikitian",
      "datetime": "2021-09-10T16:27:50.000Z",
      "text": "У этого бризера автоматический режим считает нормой уровень CO2 в 1000 мг/м3, что вообще многовато. У меня такие же, прописал им автоматику в home assistant с отключением при достижении минимального уровня в 400 на час. Так фильтры чуть эффективнее используется и бризеры не работают, когда дома никого нет. Так же подогрев в авторежиме не включается, но про его автоматизацию написали"
    },
    {
      "id": 23467324,
      "author": "ShadowMaster",
      "datetime": "2021-09-10T03:09:31.000Z",
      "text": "А зачем вообще выключать свет в ванной и туалет? Лампочки едят копейки. Автоматизация же никогда не окупится.И зачем выключать кондиционер? У меня инвертер. Когда становится жарко я его включаю на 27. Если на улице выше 30-32, то повышаю на 1-2 температуру, иначе становится некомфортно. Выключаю через несколько недель-месяц (жаркий сезон у нас недолгий). Он просто тихо поддерживает температуру на автомате, инвертер же. Когда целевая температура достигнута он практически бесшумно дует слегка холодным воздухом. Вообще не мешает чтобы его выключать."
    },
    {
      "id": 23467534,
      "author": "DistortNeo",
      "datetime": "2021-09-10T05:36:40.000Z",
      "text": "Практично (•‿•)"
    },
    {
      "id": 23467542,
      "author": "empenoso",
      "datetime": "2021-09-10T05:39:27.000Z",
      "text": "Практично (•‿•)"
    },
    {
      "id": 23468706,
      "author": "empenoso",
      "datetime": "2021-09-10T09:49:00.000Z",
      "text": "На ночь все равно нужно выключать, чтобы не мешал сну. Почему бы тогда не выключить раньше ʘ‿ʘПлюс классный спецэффект когда свет тебя приветствует в помещении своим включением."
    },
    {
      "id": 23469058,
      "author": "gekkkon",
      "datetime": "2021-09-10T10:56:35.000Z",
      "text": "\"А зачем вообще выключать свет в ванной и туалет? \" -- тяжелое наследие тотальных ламп накаливания;)"
    },
    {
      "id": 23469568,
      "author": "empenoso",
      "datetime": "2021-09-10T12:37:13.000Z",
      "text": "(◠‿◕)"
    },
    {
      "id": 23473208,
      "author": "LynXzp",
      "datetime": "2021-09-11T16:49:27.000Z",
      "text": "А зачем вообще выключать свет в ванной и туалет? Лампочки едят копейки. Автоматизация же никогда не окупится.Ну не знаю, у меня по 60Вт светодиодных на небольшую комнату.В ванной еще не сделал, но примерно так же будет. Свет хороший, на много лучше одной лампы на 12Вт. Особенно хорош при работе с мелкими деталями и при нанесении макияжа.Правда у меня нет умного дома, небольшой свет включается автоматически по датчику движения за пару долларов, а основной только вручную. Яркий свет всегда не нужен, особенно ночью."
    },
    {
      "id": 23467378,
      "author": "vitecd",
      "datetime": "2021-09-10T04:09:17.000Z",
      "text": "Lonsonho Tuya Smart Zigbee в квадратном подрозетникеа пластиковых стаканов в стене нет?"
    },
    {
      "id": 23467438,
      "author": "empenoso",
      "datetime": "2021-09-10T04:46:59.000Z",
      "text": "Видимо не смогли купить, пластиковых стаканов в стене нет."
    },
    {
      "id": 23467408,
      "author": "AADogov",
      "datetime": "2021-09-10T04:32:39.000Z",
      "text": "Меня слегка удивляет, люди так беспокоятся о конфиденциальности, но при этом отдают обработку данных о своём умном доме сторонним сервисам."
    },
    {
      "id": 23467440,
      "author": "empenoso",
      "datetime": "2021-09-10T04:47:38.000Z",
      "text": "Ну в целом я согласен. Здесь в квартире не всё полностью замкнуто на локальный home assistant."
    },
    {
      "id": 23470348,
      "author": "Nikitian",
      "datetime": "2021-09-10T16:29:56.000Z",
      "text": "Сам home assistant локален настолько, насколько это допускает владелец. Даже от mihome можно отвязать устройства"
    },
    {
      "id": 23470544,
      "author": "tmin10",
      "datetime": "2021-09-10T17:30:04.000Z",
      "text": "Сам mi home можно локально использовать в HA и не пускать в интернет ещё."
    },
    {
      "id": 23467436,
      "author": "VVG965",
      "datetime": "2021-09-10T04:46:34.000Z",
      "text": "Можете показать скрипт плавного увеличения яркости лампы?Спасибо!"
    },
    {
      "id": 23467630,
      "author": "empenoso",
      "datetime": "2021-09-10T06:04:29.000Z",
      "text": "Скрипт был взят у блогера Ивана Бессарабоваhttps://ivan.bessarabov.com/slowly_turn_on_lamp:\n  sequence:\n    - repeat:\n        count: 60\n        sequence:\n          - service: light.turn_on\n            data:\n              entity_id:\n              - light.dimmable_light_26\n              - light.dimmable_light_24\n              brightness: \"{{ 200 / (60-1) * (repeat.index-1) + 1 }}\"\n          - delay:  00:00:30"
    },
    {
      "id": 23468300,
      "author": "VVG965",
      "datetime": "2021-09-10T08:38:27.000Z",
      "text": "Отлично! Спасибо! Я делал давненько плавное увеличение яркости ночью в туалете через автоматизацию. Скриптом будет лучше и правильнее."
    },
    {
      "id": 23477192,
      "author": "diaskzn",
      "datetime": "2021-09-13T08:32:52.000Z",
      "text": "А не попадался ли вам скрипт для диммирования люстры с не диммируемыми лампами?Есть классическая 5 ламповая люстра подключенная к двухклавишному выключателю (sonoff dualr3). Один канал 2 лампы, второй канал 3 лампы. хотелось бы реализовать несколько режимов: минимум (2 лампы), средний (3 лампы), максимум (5 ламп)."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2021-09-10T05:53:40.000Z",
      "text": "Ну это вы просто недостаточно знакомы с тематикой. Даже если брать KNX стандарт, тогда было бы не 100 тысяч затрат, а умножить на 10 и функционал точно такой же."
    },
    {
      "id": 23467588,
      "author": "empenoso",
      "datetime": "2021-09-10T05:53:40.000Z",
      "text": "Ну это вы просто недостаточно знакомы с тематикой. Даже если брать KNX стандарт, тогда было бы не 100 тысяч затрат, а умножить на 10 и функционал точно такой же."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2021-09-10T06:05:10.000Z",
      "text": "Тогда не понял о чём вопрос."
    },
    {
      "id": 23467632,
      "author": "empenoso",
      "datetime": "2021-09-10T06:05:10.000Z",
      "text": "Тогда не понял о чём вопрос."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2021-09-10T06:19:11.000Z",
      "text": "Я согласен, но покажите мне, где это не так. Обычно к этому всегда всё и сводится."
    },
    {
      "id": 23467668,
      "author": "empenoso",
      "datetime": "2021-09-10T06:19:11.000Z",
      "text": "Я согласен, но покажите мне, где это не так. Обычно к этому всегда всё и сводится."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2021-09-10T09:50:27.000Z",
      "text": "Ой, ой, ой ⊙.☉"
    },
    {
      "id": 23468718,
      "author": "empenoso",
      "datetime": "2021-09-10T09:50:27.000Z",
      "text": "Ой, ой, ой ⊙.☉"
    },
    {
      "id": 23468334,
      "author": "NAI",
      "datetime": "2021-09-10T08:43:57.000Z",
      "text": "Как пиливший автоматизацию дома, скажу что \"минимум можно включить утром хлебопечку и кофемашину\" разбивается о кучу нюансов и банальное управление лампочкой превращается в скрипт на пару экранов.Возьмем для примера - включить кофемашину. Казалось бы - выставить таймер на 8:10 утра и все. Но!Расписание.Окей, разделим будни и выходные (первое ветвление). По будням запускаемся в 8:10 по выходным в 10:00. Зашибись, все работает ровно месяц, а потом у нас случаются гос. праздник и вот ты, разбужен кофе-машиной в свой выходной. Окей, забиваем список праздничных и выходных дней (второе ветвление). Снова живем нормально, круто, кайфово, привычно, но ровно до того момента как наступил отпуск. Да-да т.е. в первый день нас снова сутра разбудит кофе-машина. Ок, садимся и забиваем график отпусков (это если вы его составляете). Живем... но тут дедлайн и надо выйти в выходной или отпуск перенесся. Список дедлайнов заранее не составишь, по этому во время таких нежданчиков запускать кофемашину вручную, но тогда кофемашина отработает по скрипту уже после ухода, т.е. нужна ручная блокировка мол \"Спасибо, я уже приготовил кофе сам.\"Где-то тут, обычно, посещает светлая идея - нафига нам все эти страдания, если можно привязаться к будильнику! Мол, начинаем готовить кофе через 10 минут после срабатывания. Правда иногда мы (человеки) любим поспать днем и кофе после 15 дня ну такое себе, кому-то зайдет кому-то нет. Или скажем можем поставить будильник для напоминания о событии. Окей, значит мы должны разделить будильники на два типа - \"с\" кофе и \"без\".А еще бывает состояние \"проспал и нет времени на кофе\".БлокировкиНужен датчик воды - что делать если воды нет? (не включать и напоминать когда?)Нужен датчик кофе - что делать если нет кофе? (не включать и напоминать когда?)Нужен датчик чашки - что делать если нет чашки? (не включать и напоминать когда?)Жена тоже любит кофе и обычно встает в другое время, но тут звезды сошлись так что наши будильники сработали с разницей в +- 10 минут. Нужна блокировка от повторного срабатывания.А еще есть состояние - будильник сработал, а нас нет дома (уехали с ночевкой). Т.е. нужен маркер присутствия."
    },
    {
      "id": 23468798,
      "author": "dravor",
      "datetime": "2021-09-10T10:00:21.000Z",
      "text": "Поддерживаю."
    },
    {
      "id": 23468836,
      "author": "empenoso",
      "datetime": "2021-09-10T10:05:08.000Z",
      "text": "Поддерживаю."
    },
    {
      "id": 23469084,
      "author": "gekkkon",
      "datetime": "2021-09-10T11:01:57.000Z",
      "text": "к устройству с вайфай можно (почти бесплатно для производителя) подключить очень развитый пульт управления в виде приложения в смартфоне;). у меня такая мишная электроплитка, на ней одна очень умная ручка, и в некоторые вкусные режимы вход только через вайфай. тёмелебедеву это в голову не пришло -- он художник, он так не видит;)."
    },
    {
      "id": 23469262,
      "author": "NAI",
      "datetime": "2021-09-10T11:31:12.000Z",
      "text": "Эргономика интерфейсов штука такая. Кнопка\\крутилка была бы в 10 раз быстрее чем:-Достать телефон-Разблокировать-Запустить приложение-Подождать загрузки-Подождать подключения-Пробраться по меню до нужного пунктаНу и про стоимость с вами тоже не согласен, цена крутилки сииильно ниже чем аренда серверов и ЗП программистов и тех.поддержки. Если бы было иначе, то все производители давно бы продавали технику с wi-fi дешевле чем технику без."
    },
    {
      "id": 23470362,
      "author": "Nikitian",
      "datetime": "2021-09-10T16:32:30.000Z",
      "text": "Умный дом вообще не про управление с телефона. Это больше про автоматизации, чтобы вообще не требовались элементы управления"
    },
    {
      "id": 23473950,
      "author": "gekkkon",
      "datetime": "2021-09-12T00:04:10.000Z",
      "text": "Ага. Вот у меня МИшная плитка с экранчиком на три иероглифа и управление эргономичной крутилкой. А в плитке кучка каких-то нах не нужных \"программ приготовления\" и прибранные подальше от юзеров фичи типа поддержания температуры (не мощности, как обычно, а именно температуры) днища посуды. Ну и таймер. С вебаным интерфейсом можно было бы просто выстроить кривую нагрева/охлаждения с выдержками, как в нормальном печном контроллере -- но нет, несмотря даже на вайфай такой возможности нету. Реализовывать такое на крутилке можно, но кмк очень неудобно (а мы же про эргономику, да?).За необходимость аренды не уверен -- всё-таки есть вайфай-директ (хз, что это, но название красивое;).А чего я хотел бы от расширенного управления стиральной машиной, лучше писать не буду -- точно примут за извращенца."
    },
    {
      "id": 23469582,
      "author": "empenoso",
      "datetime": "2021-09-10T12:38:15.000Z",
      "text": "А это к чему?"
    },
    {
      "id": 23473958,
      "author": "gekkkon",
      "datetime": "2021-09-12T00:07:32.000Z",
      "text": "к комментарию dravor'а про wifi-чайник.не вся эта заумь одинаково бесполезна. я чуть выше написал, где управление быттехникой через wifi может пригодиться по делу."
    },
    {
      "id": 23468808,
      "author": "empenoso",
      "datetime": "2021-09-10T10:01:43.000Z",
      "text": "Вот! Обстоятельный подход!"
    },
    {
      "id": 23469150,
      "author": "Komrus",
      "datetime": "2021-09-10T11:13:00.000Z",
      "text": "Хм, я бы начал с ещё более приземлённых вещей.Нужна кофеварка с подключением к водопроводу и канализации. Чтобы сама умела доливать воду, выкидывать отработанный помол кофе и промываться...Согласен даже без дальнейшей автоматизации. Но! Почему-то модели с такими возможностями числятся уж сооовсем профессиональными и стоят раз в десять дороже бытовых..."
    },
    {
      "id": 23476398,
      "author": "Goryanin",
      "datetime": "2021-09-13T04:24:55.000Z",
      "text": "Есть вполне себе рядовые встраиваемые домашние кофеварки. Которые имеют холодильник для молока, большой контейнер для кофе (кстати, интересный вариант когда их два, один герметичный большой, открывается редко чтоб наполнить меньший - раздаточный, с которого идёт на мельницу), подключаются к водопроводу, и канализации. Сами себя пропаривают, и сливают гущу в канализацию."
    },
    {
      "id": 23476500,
      "author": "NAI",
      "datetime": "2021-09-13T05:45:07.000Z",
      "text": "Ну да... бывают, с ценником от 50к. (а норм вариант будет уже около 100к). Плюс габариты у нее такие, что не на всякую кухню влезут.В общем, сомнительно все это - из-за лени нажать полторы кнопки, городить такое. Тем более, что остальные вопросы остаются актуальными."
    },
    {
      "id": 23470850,
      "author": "bankir1980",
      "datetime": "2021-09-10T19:19:25.000Z",
      "text": "Вот читал статью и точно так же думал про банальное освещение и автоматизацию штор. Много думаю думаю, стоит ли это всё делать по графикам или всё таки исходить из того, что всё должно подстраиваться в ручном режиме под человека, а не наоборот, человек под график работы штор, освещений, кофе по графику, ванн по графику и тд и тп"
    },
    {
      "id": 23468408,
      "author": "tmin10",
      "datetime": "2021-09-10T08:54:50.000Z",
      "text": "Боюсь что целевая аудитория может быть слишком узкая."
    },
    {
      "id": null,
      "author": "tmin10",
      "datetime": "2021-09-10T09:09:39.000Z",
      "text": "Боюсь что целевая аудитория может быть слишком узкая."
    },
    {
      "id": 23468468,
      "author": "tmin10",
      "datetime": "2021-09-10T09:09:39.000Z",
      "text": "Боюсь что целевая аудитория может быть слишком узкая."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2021-09-10T10:02:47.000Z",
      "text": "Боюсь что целевая аудитория может быть слишком узкая."
    },
    {
      "id": 23468820,
      "author": "empenoso",
      "datetime": "2021-09-10T10:02:47.000Z",
      "text": "Боюсь что целевая аудитория может быть слишком узкая."
    },
    {
      "id": 23468492,
      "author": "3epg",
      "datetime": "2021-09-10T09:13:56.000Z",
      "text": "Почему это не простоят. В первые пару месяцев после покупки хлебопечки всегда закидывал всё необходимое в ХП и запускал, чтобы готово было к утру. Потом надоело, стало лень загружать с вечера, стало лень мыть, хлеб приелся, вобщем куча всего. Уже года два не пользуюсь ей. ))Настолько я помню программа там так устроена что тесто замешивается сразу, за ночь поднимается и грубо в 6 утра начинает жарится."
    },
    {
      "id": 23483172,
      "author": "Gutt",
      "datetime": "2021-09-14T16:14:53.000Z",
      "text": "По-разному. В моей супердешёвой при откладывании приготовления замес тоже откладывается (что логично, иначе в неё придётся встраивать холодильник, чтобы потом не собирать тесто с пола). Но хлебопечка -- одно из лучших приобретений за последние годы (после электрического гриля). Я брал её просто как супердешёвый тестомес, чтобы делать тесто для пиццы, а в итоге она прижилась как исполнитель своей основной функции."
    },
    {
      "id": 23471958,
      "author": "shaggyone",
      "datetime": "2021-09-11T08:21:15.000Z",
      "text": "Это как именно?"
    },
    {
      "id": 23472168,
      "author": "empenoso",
      "datetime": "2021-09-11T09:33:40.000Z",
      "text": "Это как именно?"
    },
    {
      "id": 23484668,
      "author": "shaggyone",
      "datetime": "2021-09-15T06:23:13.000Z",
      "text": "Грубо говоря подпаять управляемые реле параллельно к кнопкам."
    },
    {
      "id": 23467724,
      "author": "AADogov",
      "datetime": "2021-09-10T06:37:43.000Z",
      "text": "— утром, разбудив, подаст кофе в постель со свежеиспечёнными булочками,Тут лучше жену завести, или на крайний случай личного повара, дешевле будет."
    },
    {
      "id": 23468086,
      "author": "SomebodyElse",
      "datetime": "2021-09-10T07:51:04.000Z",
      "text": "Владелец дома очевидно."
    },
    {
      "id": 23470660,
      "author": "TheRikipm",
      "datetime": "2021-09-10T18:24:55.000Z",
      "text": "Владелец дома очевидно."
    },
    {
      "id": 23468842,
      "author": "empenoso",
      "datetime": "2021-09-10T10:06:13.000Z",
      "text": "Боюсь повар дешевле обойдется, если только ради этого."
    },
    {
      "id": 23468224,
      "author": "Komrus",
      "datetime": "2021-09-10T08:19:55.000Z",
      "text": "Такие решения для умного дома существовали только в XIX веке. Система \"горничная\"К настоящему времени секрет их массового использования утерян :)))"
    },
    {
      "id": 23468574,
      "author": "3epg",
      "datetime": "2021-09-10T09:30:21.000Z",
      "text": "Вот тоже самое мнение. Сколько раз не читал про умный дом, везде только лишь управление светом, да отоплением/охлаждением. А про туже интеграцию с бытовой техникой ничего. Я согласен, что целиком весь процесс приготовления завтрака не автоматизировать. Но тот же чайник с подключением к водопроводу и датчиком уровня воды можно реализовать на простецкой ардуине, также как и кофеварку, которая вечером напомнит досыпать зёрен, если их нет. Да и таже хлебопечка вполне поддаётся автоматизации, нужен лишь отдельный диспансер для муки, соли, сахара, дрожжей и также подключение водопровода. С мультиваркой и какими нибудь молочными кашами та же история. Но их почему то нет.А ещё лучше интеграцию с каким нибудь сбермаркетом, чтобы кофеварка сама заказала кофе из магазина, чай, сахар, ту же муку, да дрожжи. Вот это будет умный дом, а не голосовое управление фонариками."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2021-09-10T09:51:47.000Z",
      "text": "Так ведь есть уже."
    },
    {
      "id": 23468726,
      "author": "empenoso",
      "datetime": "2021-09-10T09:51:47.000Z",
      "text": "Так ведь есть уже."
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 23512798,
      "author": "Komrus",
      "datetime": "2021-09-23T08:45:39.000Z",
      "text": "Что-то я не знаю роботов-пылесосов, у которых база подключена к воде/канализации и которые могут годами (ну ладно, хотя бы месяцами) поддерживать чистоту в доме полностью автономно, не требуя внимания хозяина.PS. И вообще подумалось - нужен не smart house. Нужен unattended house (дом, не требующий внимания, где автоматика годами выполняет рутинные операции без вмешательства человека)"
    },
    {
      "id": 23513000,
      "author": "Exchan-ge",
      "datetime": "2021-09-23T09:35:12.000Z",
      "text": "Нужен unattended house (дом, не требующий внимания, где автоматика годами выполняет рутинные операции без вмешательства человека)«Все уже придумано до нас» (с) — см. «Будет ласковый дождь» Рэя Бредбери(там, в общих чертах, описана вполне вероятная реализация)Сегодня в городе Эллендейле, штат Калифорния, четвертое августа две тысячи двадцать шестого года, — произнес другой голос, с потолка кухниА вот конкретно меня вполне бы устроил человекообразный робот-слуга :)"
    },
    {
      "id": null,
      "author": "Exchan-ge",
      "datetime": "2021-09-27T18:59:56.000Z",
      "text": "В форме кошко-девочки? ^^Не, что-нибудь нейтральное, в стиле хай-тек:"
    },
    {
      "id": 23527496,
      "author": "Exchan-ge",
      "datetime": "2021-09-27T18:59:56.000Z",
      "text": "В форме кошко-девочки? ^^Не, что-нибудь нейтральное, в стиле хай-тек:"
    },
    {
      "id": 23468710,
      "author": "DaemonGloom",
      "datetime": "2021-09-10T09:49:38.000Z",
      "text": "Кофеварки и чайники такие и так есть. С хлебопечкой сложнее — там в любом случае нужна ручная загрузка каждый раз, иначе размеры устройства вырастают значительно. Каша в мультиварке — тоже не проблема, но опять же нужна ручная загрузка."
    },
    {
      "id": 23471388,
      "author": "tommyangelo27",
      "datetime": "2021-09-10T23:28:48.000Z",
      "text": "целиком весь процесс приготовления завтрака не автоматизироватьЯ заказываю готовый в кейтеринге, привозят примерно в 5-6 утра, оставляют пакет под входной дверью.Я встаю в 7.30, просто беру пакет из-за двери и иду завтракать ?"
    },
    {
      "id": 23469898,
      "author": "VVG965",
      "datetime": "2021-09-10T14:02:02.000Z",
      "text": "Барин, жениться вам надо!))На самом деле в Home Assistant можно много чего автоматизировать. Я контролирую процесс зарядки АКБ, контролирую влажность в ванной комнате и вентилирую при необходимости. Контролирую процесс сушки овощей-фруктов. Контролирую температуру на балконе зимой, чтобы не растаяли продукты при оттепели. Включаю-выключаю рекламу на своем магазине и освещение на даче в зависимости от восхода, заката и облачности. В общем, все зависит от вашей фантазии и потребностей."
    },
    {
      "id": 23470840,
      "author": "bankir1980",
      "datetime": "2021-09-10T19:16:08.000Z",
      "text": "Чисто разогреть ужин и наполнить ванну вообще не проблема автоматизировать. Вот приготовить ужин - это уже да, проблема :)"
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2021-09-10T06:20:55.000Z",
      "text": "Тут я согласен, но это же так круто - управлять собственным голосом физическими объектами (◔‿◔)"
    },
    {
      "id": 23467678,
      "author": "empenoso",
      "datetime": "2021-09-10T06:20:55.000Z",
      "text": "Тут я согласен, но это же так круто - управлять собственным голосом физическими объектами (◔‿◔)"
    },
    {
      "id": null,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T07:30:10.000Z",
      "text": "обычным выключателем можно хоть морзянку проморгатьА вамчастовообще бывает нужно морозянку проморагть? Я о том, что быстродействие голосового упраления точно такое, которое от него и требуется.Вообще на все недостатки, которые вы перечислили, один универсальный ответ - голосовое управление не отменяет другие способы. Не знаете что нужно сказать? Можете помешать домочадцам или боитесь, что прямо сейчас подслушивают в какой конате вы свет включить собиреатесь? Используете приложение на телефоне или электронный выключатель. Или даже обычный (если сохранили), с ним умные лампы имитирут обычные.А с точки зрения достоинств. Айтишники же не только на диване сидят, но и другими делами занимаются. Да и дома не всегда бывают. И вот например готовите вы ужин, стемнело, до выключателя буквально руку протянуть, а руки в масле, соке, и т.д. В итоге у вас три опции, елси вы дома не один:Прерваться, помыть руки, вытереть нусухо (я, например, не люблю мокруми руками следы на выключателе оствалять), включить свет выключателем.Попросить кого-то в доме включить вам свет (мне кажется это довольно типичнвй сценарий). Тут есть недостаток, человек может быть тоже занят.Попросить голосового ассистента включить вам свет.И много подобных сценариев, еогда к вас руки заняты, а свет вы заранее не включили."
    },
    {
      "id": 23467990,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T07:30:10.000Z",
      "text": "обычным выключателем можно хоть морзянку проморгатьА вамчастовообще бывает нужно морозянку проморагть? Я о том, что быстродействие голосового упраления точно такое, которое от него и требуется.Вообще на все недостатки, которые вы перечислили, один универсальный ответ - голосовое управление не отменяет другие способы. Не знаете что нужно сказать? Можете помешать домочадцам или боитесь, что прямо сейчас подслушивают в какой конате вы свет включить собиреатесь? Используете приложение на телефоне или электронный выключатель. Или даже обычный (если сохранили), с ним умные лампы имитирут обычные.А с точки зрения достоинств. Айтишники же не только на диване сидят, но и другими делами занимаются. Да и дома не всегда бывают. И вот например готовите вы ужин, стемнело, до выключателя буквально руку протянуть, а руки в масле, соке, и т.д. В итоге у вас три опции, елси вы дома не один:Прерваться, помыть руки, вытереть нусухо (я, например, не люблю мокруми руками следы на выключателе оствалять), включить свет выключателем.Попросить кого-то в доме включить вам свет (мне кажется это довольно типичнвй сценарий). Тут есть недостаток, человек может быть тоже занят.Попросить голосового ассистента включить вам свет.И много подобных сценариев, еогда к вас руки заняты, а свет вы заранее не включили."
    },
    {
      "id": null,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T07:51:17.000Z",
      "text": "как начало темнеть, свет должен сам включитьсяИменно! Но иногда хорошо иметь возможность этому дому \"подсказать\", что от него требуется в данный момент. Идеально, конечно, если дом \"видит\"  и понимает, что кто-то находится на кухне, ему возможно темно и нужно подсветить рабочую зону.В том комментарии я пытался сказать, что это всё опционально и используется тот метод, который наиболее оптимален в момент времени."
    },
    {
      "id": 23468090,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T07:51:17.000Z",
      "text": "как начало темнеть, свет должен сам включитьсяИменно! Но иногда хорошо иметь возможность этому дому \"подсказать\", что от него требуется в данный момент. Идеально, конечно, если дом \"видит\"  и понимает, что кто-то находится на кухне, ему возможно темно и нужно подсветить рабочую зону.В том комментарии я пытался сказать, что это всё опционально и используется тот метод, который наиболее оптимален в момент времени."
    },
    {
      "id": null,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T09:43:40.000Z",
      "text": "Ну так ко всему \"прогрессу\" есть вопросы. Автомобиль вот другие способы  перемещения тоже не отменяет, например пешие прогулки, значит ли это что у него есть \"неустранимые недостатки\"? Ну или плита для готовки, её с собой в поход не возьмешь, вы жто тоже в недостатки запишете или как? Плита еще и позволяет за дровами не ходить, тоже сказывается на подвижности и как следсвтвие болезням и перееданию :-)"
    },
    {
      "id": 23468678,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T09:43:40.000Z",
      "text": "Ну так ко всему \"прогрессу\" есть вопросы. Автомобиль вот другие способы  перемещения тоже не отменяет, например пешие прогулки, значит ли это что у него есть \"неустранимые недостатки\"? Ну или плита для готовки, её с собой в поход не возьмешь, вы жто тоже в недостатки запишете или как? Плита еще и позволяет за дровами не ходить, тоже сказывается на подвижности и как следсвтвие болезням и перееданию :-)"
    },
    {
      "id": null,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T11:35:18.000Z",
      "text": "Батон белого или ржаной хлеб это же лучше чем только ржаной хлеб? Или вы тоже будете говорит, что батон белого имеет только недостатки, потому что не видите как другие используют возможность выбора для улучшения качества жизни?Кстати, как быстро вы сможете включить свет, не ли вы лежите в кровати, а к вам зашёл «чужой кот»? Вам нужно ещё дойти/добежать до выключателя, а я, например, смогу включить его прямо с тумбочки на которой лежит беспроводной выключатель, или со шторки в телефоне или голосом."
    },
    {
      "id": 23469282,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T11:35:18.000Z",
      "text": "Батон белого или ржаной хлеб это же лучше чем только ржаной хлеб? Или вы тоже будете говорит, что батон белого имеет только недостатки, потому что не видите как другие используют возможность выбора для улучшения качества жизни?Кстати, как быстро вы сможете включить свет, не ли вы лежите в кровати, а к вам зашёл «чужой кот»? Вам нужно ещё дойти/добежать до выключателя, а я, например, смогу включить его прямо с тумбочки на которой лежит беспроводной выключатель, или со шторки в телефоне или голосом."
    },
    {
      "id": 23469334,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T11:43:05.000Z",
      "text": "И я даже не говорю про возможность задать яроксть, тон или цвет освещения не используя спйиальных пультов или не имя под рукой телефона с крутилками"
    },
    {
      "id": null,
      "author": "gekkkon",
      "datetime": "2021-09-12T00:11:44.000Z",
      "text": "к голосовому управлению можно добавить тональную координату-другую, и рулить там скоростью нарастания, спектром и чем придумается.а потом запутаться в структуре команд управления;)"
    },
    {
      "id": 23473962,
      "author": "gekkkon",
      "datetime": "2021-09-12T00:11:44.000Z",
      "text": "к голосовому управлению можно добавить тональную координату-другую, и рулить там скоростью нарастания, спектром и чем придумается.а потом запутаться в структуре команд управления;)"
    },
    {
      "id": 23469596,
      "author": "empenoso",
      "datetime": "2021-09-10T12:39:46.000Z",
      "text": "Если голосовое управление работает нормально, то мне кажется это интересно."
    },
    {
      "id": 23468504,
      "author": "3epg",
      "datetime": "2021-09-10T09:16:14.000Z",
      "text": "Можно включить свет коленкой))"
    },
    {
      "id": 23471912,
      "author": "YMakeev",
      "datetime": "2021-09-11T08:03:00.000Z",
      "text": "Это же почти магия... ????Произнес \"заклинание\" и включился свет... Оказывается книги про магию - на самом деле про IoT с голосовым управлением ?"
    },
    {
      "id": 23477382,
      "author": "lmapro",
      "datetime": "2021-09-13T08:51:10.000Z",
      "text": "Lumus maxima!"
    },
    {
      "id": 23477386,
      "author": "empenoso",
      "datetime": "2021-09-13T08:51:38.000Z",
      "text": "Заклинание, которое освещает большие помещения?"
    },
    {
      "id": 23488430,
      "author": "shaggyone",
      "datetime": "2021-09-16T03:01:34.000Z",
      "text": "\"Экспеллиармус\" и в районе входной двери включается  охрененно мощный электромагнит )."
    },
    {
      "id": 23467818,
      "author": "AotD",
      "datetime": "2021-09-10T07:04:00.000Z",
      "text": "В современных ремонтах выключатели проектируются и так чтобы не вставать с дивана, а управление голосом просто удобно"
    },
    {
      "id": 23467686,
      "author": "wtigga",
      "datetime": "2021-09-10T06:22:35.000Z",
      "text": "Расскажите в двух словах про голосовое управление: какой девайс слушает, обработка в облаке или HA.У меня тоже на HA всё крутится, но во главу угла поставлена автономная работа без интернет-сервисов, поэтому голосовых помощников никогда не рассматривал."
    },
    {
      "id": 23467698,
      "author": "empenoso",
      "datetime": "2021-09-10T06:27:22.000Z",
      "text": "Используется Яндекс колонка Мини в основном. Еще подключена Google Home колонка, но она полтора года назад перестала поддерживать русский язык. Обе колонки работают через облако. Задержки в работе не существенные, очень удобно использовать.Так же подключена Siri через Homkit, ее удобно использовать когда под рукой телефон или надеты Airpods."
    },
    {
      "id": 23467734,
      "author": "wtigga",
      "datetime": "2021-09-10T06:40:28.000Z",
      "text": "Ясно, понятно. Спасибо. Не мой вариант :-)"
    },
    {
      "id": 23467830,
      "author": "putnik",
      "datetime": "2021-09-10T07:07:07.000Z",
      "text": "Если весь функционал дублируется, и без интернета можно включить/выключить руками, то на мой взгляд можно использовать любого ассистента просто как удобное дополнение (ну, если не критичен вопрос приватности)."
    },
    {
      "id": 23467732,
      "author": "Godless",
      "datetime": "2021-09-10T06:40:21.000Z",
      "text": "Home Assistant на каком железе живет ?Конфиденциальность и правила хорошо, но все таки технопорно не хватает... железки, протоколы, хоть бы схему подключения девайсов нарисовали. Был бы сразу понятен масштаб. + появилась бы возможность более адекватно оценить затраты/результат."
    },
    {
      "id": 23468488,
      "author": "DaemonGloom",
      "datetime": "2021-09-10T09:13:25.000Z",
      "text": "Стик — Conbee IIА можете в двух словах про стик рассказать? Смотерть альтернативы или всё плюс минус ОК? Он у меня в списке покупок на амазоне висит, но смущают некоторые отзывы о стабильности работы и проблемами с прошивкой, особенно полседний апдейт."
    },
    {
      "id": 23468900,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T10:19:33.000Z",
      "text": "Стик — Conbee IIА можете в двух словах про стик рассказать? Смотерть альтернативы или всё плюс минус ОК? Он у меня в списке покупок на амазоне висит, но смущают некоторые отзывы о стабильности работы и проблемами с прошивкой, особенно полседний апдейт."
    },
    {
      "id": 23469026,
      "author": "DaemonGloom",
      "datetime": "2021-09-10T10:51:26.000Z",
      "text": "У меня — спокойно работает с Home Assistant. Я в качестве софта использую deconz от разработчиков этого стика, установлен в качестве аддона через сам Home Assistant. Можно использовать с ним zigbee2mqtt, если есть желание. На хабре в комментариях проскакивали и другие владельцы, у них проблем тоже не было особых."
    },
    {
      "id": 23469140,
      "author": "shaggyone",
      "datetime": "2021-09-10T11:11:52.000Z",
      "text": "Хорошо когда есть место в щитке, обычно там места нет."
    },
    {
      "id": 23469600,
      "author": "empenoso",
      "datetime": "2021-09-10T12:40:40.000Z",
      "text": "Хорошо когда есть место в щитке, обычно там места нет."
    },
    {
      "id": 23469648,
      "author": "shaggyone",
      "datetime": "2021-09-10T12:53:03.000Z",
      "text": "Уже не так тру."
    },
    {
      "id": 23469926,
      "author": "empenoso",
      "datetime": "2021-09-10T14:11:23.000Z",
      "text": "Уже не так тру."
    },
    {
      "id": 23467880,
      "author": "Earthsea",
      "datetime": "2021-09-10T07:13:51.000Z",
      "text": "Занятное хобби, или кому-то на работе не хватает проектов.Но с практической точки зрения, даже если уходя из дома постоянно забывать включенные в санузле современные 4-5 Вт светодиодные лампочки, не так уж много электроэнергии на это уйдет. Даже примитивный дешевый патрон-датчик за 500 рублей окупится только через пару лет, если не позже."
    },
    {
      "id": 23468010,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T07:34:29.000Z",
      "text": "Для нас, живем как и герои статьи вдвоем, основное это не выключать свет из экономии, а включать (и выключать) для удобства. Вот тут про один из сценариев я ответил уже -https://habr.com/ru/post/577052/comments/#comment_23467990"
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 23468244,
      "author": "Komrus",
      "datetime": "2021-09-10T08:25:17.000Z",
      "text": "1) Вентиляция, забирающая воздух с застекленного балкона (по сути - теплицы) - не будет ли перегревать квартиру летом в отсутствие хозяев?2) Я правильно понял, что не реализована увязка в единую систему управления кондиционером, приточкой и тёплым полом? Каждый из них - имеет свои настройки и свой алгоритм работы?3) Ну и взломостойкость умного замка (просто перед механическим взломом) - кто-нибудь тестировал?"
    },
    {
      "id": 23468452,
      "author": "Harwest",
      "datetime": "2021-09-10T09:05:54.000Z",
      "text": "Неплохо.Еще бы добавить пару датчиков протечки (в санузел и кухонную зону). Датчики температуры и влажности, СО2. Добавить умный увлажнитель воздуха (или встроить что то типа ESP в существующий)."
    },
    {
      "id": 23470386,
      "author": "Nikitian",
      "datetime": "2021-09-10T16:38:30.000Z",
      "text": "Датчик CO2 есть в бризере. Там же есть датчик внешней температуры."
    },
    {
      "id": 23470558,
      "author": "Harwest",
      "datetime": "2021-09-10T17:34:22.000Z",
      "text": "Этого же мало.Однушка 36кв - поставил датчики температуры и влажности в кухонной зоне, санузле, в спальне (там плюс СО2 и запыление). Вытяжка в санузле и электро-полотенцесушитель работают по сценарию: кто-то был (PIR) повысилась влажность (помылся) - вкл вытяжка и сушилка полотенец.В спальне увлажнитель с ESP (прошит Tasmota) сценарий: если в НА включено автоматическое поддержание влажности + текущая влажность менее 40% + закрыто окно + есть вода в бачке то PWM на драйвер ультразвука =100% и вкл бловер."
    },
    {
      "id": 23468540,
      "author": "Exchan-ge",
      "datetime": "2021-09-10T09:21:51.000Z",
      "text": "Как бы да ¯\\_(ツ)_/¯"
    },
    {
      "id": 23468742,
      "author": "empenoso",
      "datetime": "2021-09-10T09:53:17.000Z",
      "text": "Как бы да ¯\\_(ツ)_/¯"
    },
    {
      "id": 23468848,
      "author": "empenoso",
      "datetime": "2021-09-10T10:07:50.000Z",
      "text": "Херлуф Бидструп?"
    },
    {
      "id": 23468978,
      "author": "Exchan-ge",
      "datetime": "2021-09-10T10:37:29.000Z",
      "text": "Херлуф Бидструп?Да.Верность замеченного им наблюдаю уже на примере трех поколений :)"
    },
    {
      "id": 23468746,
      "author": "Lapland_Man",
      "datetime": "2021-09-10T09:53:20.000Z",
      "text": "пускать в квартиру родственников, когда хозяев нет домасвет погаснет автоматически во всей квартире через 10 минут.Немного не понял. Если родственник придет в квартиру в отсутствие хозяев, то света не будет?"
    },
    {
      "id": 23468752,
      "author": "empenoso",
      "datetime": "2021-09-10T09:53:54.000Z",
      "text": "Зависит от степени родства ┐( ∵ )┌"
    },
    {
      "id": 23468954,
      "author": "Maximuzzz",
      "datetime": "2021-09-10T10:30:25.000Z",
      "text": "Обычно такая автоматизация настраивается на событие последний девайс покинул сеть. Т.е. если включить свет уже после то триггер не сработает и свет (или другой девайс) останется всключенным.Единственное неудобство, если кто-то остается в помещении когда хозяева уходят, свет будет выключен и понадобится его включить снова. Решается чуть более сложной логикой - напрмер датчик присутствия, ну или банальный переключатель в приложении или активируемый голосом отменяющий автоматическое отключение (мамо собой главное не забытьть переключить)."
    },
    {
      "id": 23469456,
      "author": "netmaniac",
      "datetime": "2021-09-10T12:11:07.000Z",
      "text": "Автоматизации лучше писать от обратного.Зажглась лампа, включился таймер на выключение. Т.е. ДД включает лампу, а уже по включению идёт таймер на отключение. С розетками и остальным так же.По самой статье ничего не раскрыто. Это почти все даётся в михом в пару кликов."
    },
    {
      "id": 23469638,
      "author": "empenoso",
      "datetime": "2021-09-10T12:51:06.000Z",
      "text": "Статья для начинающих - просто как пример того, что может быть, если глубоко не лезть и сколько это может стоить."
    },
    {
      "id": 23469636,
      "author": "shaggyone",
      "datetime": "2021-09-10T12:50:51.000Z",
      "text": "Удалил дубликат"
    },
    {
      "id": 23470956,
      "author": "ginkage",
      "datetime": "2021-09-10T19:59:53.000Z",
      "text": "О, а подскажите, пожалуйста, что за кнопки стоят перед диммерами в подрозетнике? Я как ни начну искать, всегда попадаются кнопки для установки в подрозетник, а у вас они выглядят вполне себе плоскими. Где такие можно найти?"
    },
    {
      "id": 23477738,
      "author": "empenoso",
      "datetime": "2021-09-13T10:03:58.000Z",
      "text": "Если речь про выключиатели, то  стоят legrand."
    },
    {
      "id": 23471746,
      "author": "trak",
      "datetime": "2021-09-11T06:59:31.000Z",
      "text": "Хотел узнать, насколько шумный бризер, не со слов продаванов, а тех кто с ним спит в комнате. есть какие-то мнения?"
    },
    {
      "id": 23472486,
      "author": "Nikitian",
      "datetime": "2021-09-11T11:40:31.000Z",
      "text": "На минимальной скорости не слышно. А если сравнивать с даже приоткрытым на микропроветривание окном, то бризер однозначно тише."
    },
    {
      "id": 23472934,
      "author": "trak",
      "datetime": "2021-09-11T14:35:21.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 23473034,
      "author": "Nikitian",
      "datetime": "2021-09-11T15:16:05.000Z",
      "text": "Надо ещё понимать, что у бризера звук равномерный, в отличие от открытого окна"
    },
    {
      "id": 23477732,
      "author": "empenoso",
      "datetime": "2021-09-13T10:03:27.000Z",
      "text": "Бризер не шумный, спать комфортно. Для особо чувствительных есть режим ночной, там совсем тихо работает."
    },
    {
      "id": 23482558,
      "author": "putnik",
      "datetime": "2021-09-14T13:02:43.000Z",
      "text": "Про Xiaomi ничего не скажу, но у нас стоит Tion Lite, и по чужим отзывам, он самый тихий у производителя. Так вот, из шести скоростей только первые две можно считать фоновым шумом, а ближе к шестой он напоминает вытяжку на кухне. Ночью, в том числе из-за того, что окна закрыты, он остаётся единственным источником шума, так что можно смело умножать на два. В итоге он почти всегда работает на минимальной скорости, иногда на второй. При этом лично я его всё равно слышу.При этом всё равно могу порекомендовать бризер к покупке. Но если будете брать в спальню, то лучше придирчивее подойти к выбору и выбрать максимально тихий. В другие комнаты, скорее всего, не критично.Ещё конкретно у нашего нет вообще никакой возможности управления через умный дом, хотя приложение для управления есть. Так что тоже обращайте внимание."
    },
    {
      "id": 23482698,
      "author": "trak",
      "datetime": "2021-09-14T13:41:37.000Z",
      "text": "Почему-то тоже так воспринимал бризеры, там указываются децибелы, которые явно не имеют отношения к \"библиотечной тишине\", спасибо большое!"
    },
    {
      "id": 23488440,
      "author": "shaggyone",
      "datetime": "2021-09-16T03:12:03.000Z",
      "text": "Я бы не брал Тионы в спальню. Могу спать при включённом кондиционере, мойке воздуха и т.п. но Тион 3S по сравнению с ними даже в самом тихом режиме -- пылесос."
    },
    {
      "id": 23504808,
      "author": "Nikitian",
      "datetime": "2021-09-21T07:22:34.000Z",
      "text": "Если есть возможность управления ик-пультом, то можно через эмулятор завести бризер в умный дом. Разумеется, обратной связи от бризера не будет (как и при управлении с пульта), но как минимум команды ему можно отправлять."
    },
    {
      "id": 23505206,
      "author": "putnik",
      "datetime": "2021-09-21T08:51:10.000Z",
      "text": "К сожалению, там всё сложнее: конкретно в этой модели не ИК-порт, а Bluetooth и приложение. Был бы был просто ИК, то я бы уже давно подключил. Но при покупке не обратил внимание на этот момент.Наверно, можно отреверсить и BT-интерфейс, запустив приложение через эмулятор, но так как это не моя компетенция, то займёт это времени на порядок больше, чем я потрачу, переключая его руками.UPD: Сразу после написания комментария нашёл пост на Хабре, где автор как раз эмулирует протокол для более старшей модели Tion S3:https://habr.com/ru/post/457670/. Как-нибудь на досуге попробую повторить для своего."
    },
    {
      "id": 23472172,
      "author": "jjkrot",
      "datetime": "2021-09-11T09:34:22.000Z",
      "text": "Я всегда отношусь с подозрением, к статьям, в которых \"умный дом\", преподносится без кавычек. Сразу снижает, уровень доверия к адекватному восприятию реальности, авторами.Правда, раньше, этой альтернативной реальностью, отличались в основном, пиарщики яндекса. Но это похоже заразно.И я, отнюдь не граммар наци. Но и в топике, не художественная литература."
    },
    {
      "id": 23472176,
      "author": "empenoso",
      "datetime": "2021-09-11T09:34:50.000Z",
      "text": "Немного не понял - о чем вы конкретно спрашиваете?"
    },
    {
      "id": 23474726,
      "author": "v1vendi",
      "datetime": "2021-09-12T11:10:09.000Z",
      "text": "У меня 2 вопроса:1) Правильно ли я предполагаю, что везде используется датчик движения без датчика освещенности, и свет в условном коридоре включается всегда независимо от времени суток? Я понимаю, что это чаще всего подходит, но хочется подтвердить предположение2) Что ещё полезного, на ваш взгляд, стоило бы добавить в систему?"
    }
  ]
}