{
  "url": "https://habr.com/ru/articles/694116/comments/",
  "article_id": 694116,
  "title": "Тестовый запуск системы видеонаблюдения Synology на 8 камер",
  "comments": [
    {
      "id": 25403266,
      "author": "neowisard",
      "datetime": "2023-04-03T15:35:08.000Z",
      "text": "Да , но так как это сомнительный вариант то  стабильностью он не отличается.На текщий момент в новых версиях Synоlogy уже идет проверка серийника и метод выше стработает только с серийником вида 2060UBRXXXXXX и на версиях до9.0.2-10061_openvino.spkДля старых(8ых) версий есть лицензия на 40 камер , раз в 6-12 месяцев надо восстанавливать из бэкапа конфигурацию."
    },
    {
      "id": 25456320,
      "author": "neowisard",
      "datetime": "2023-04-17T16:54:05.000Z",
      "text": "а вот соврал, стабильная работа и нормальная запись если отключить обновления.Некоторые собирают специально компа\\регистраторы под эту систему и есть несколько версий-  с видеокартами GTX1650-1080 (DSM32xx) и указанная выше DVA1622 которая при наличии встроенной видюхи еще даст вам немного аналитики по типу посчитать количество машин въехавших\\выехавших, разпознавалки лиц, и небольшую автоматизацию по типу умного дома.Кто собирает виртуалки в виртуалках например поставить DVA, включить в ней VirtualMachineManager и в нем запускает еще пару DVA которые с с ипользованием CMS в видеоstation передают свои 8 лицензий в головную машину. Итого бесконечность ).Но все это работает только на версиях указанных выше. Обновиться не выйдет- потеряются лицензии и софт все сотрет."
    },
    {
      "id": 25456378,
      "author": "empenoso",
      "datetime": "2023-04-17T17:16:28.000Z",
      "text": "У меня аналитика не заработала."
    },
    {
      "id": 25463234,
      "author": "empenoso",
      "datetime": "2023-04-19T09:31:10.000Z",
      "text": "А ещё надо обязательно отключить модуль local display - иначе он место сжирает."
    },
    {
      "id": 25466334,
      "author": "empenoso",
      "datetime": "2023-04-20T06:05:32.000Z",
      "text": "Да, как в статье на апрель 2023 года уже не работает - этот баг пофиксили. Любую историческую версию можно тут скачать:https://archive.synology.com/download/Package/SurveillanceStation"
    },
    {
      "id": 25794376,
      "author": "n_bogdanov",
      "datetime": "2023-07-27T13:09:20.000Z",
      "text": "Рабочая схема такая - DVA1622 - 7.1.1-42962 + SurveillanceStation 9.0.2-10057"
    }
  ]
}