{
  "url": "https://habr.com/ru/articles/710584/comments/",
  "article_id": 710584,
  "title": "Автоматизация в путевых листах через гугл таблицы и скрипты в 2023 году",
  "comments": [
    {
      "id": 25121648,
      "author": "abNomen",
      "datetime": "2023-01-17T05:39:12.000Z",
      "text": "Ну вы же сами пишете, что путевой лист является основанием для списания топлива в бух и налоговом учете. При этом место назначения - некое рандомное место, и у проверяющего сразу должен возникнуть вопрос, какое экономическое обоснование прибыть в это некое место. Так же автомобиль у вас с утра выехал, приехал куда-то и не вернулся. Было бы более правильным создать некое количество мест, в которые автомобиль может ездить и из них рандомом выбирать + добавить возвращение на первоначальное место."
    },
    {
      "id": 25121654,
      "author": "empenoso",
      "datetime": "2023-01-17T05:40:48.000Z",
      "text": "Предполагается что это рандомное место находится в кругу интересов этого водителя - например он работает по этому району и на самом деле там бывает по разным адресам. Даже если будут смотреть по камерам - то хотя бы район примерно совпадёт."
    },
    {
      "id": 25123410,
      "author": "aborouhin",
      "datetime": "2023-01-17T11:02:11.000Z",
      "text": "Не будут смотреть по камерам, проверять же налоговая будет, у них ни доступа к камерам, ни желания на это время тратить. Просто возьмут рандомный день и адрес и спросят - мил человек, что конкретно ты на этом адресе в этот день делал? Покажи бумажку. Заказ доставлял - где этот заказ? И после фиаско с парой случайно выбранных адрсов - снесут из расходов все затраты по таким путевым листам (топливо, а ещё ТО автомобиля). Оно, конечно, есть шанс, что прокатит, но если выездная проверка будет и ничего серьёзнее не найдут - то и до путевых листов докопаются."
    },
    {
      "id": 25123672,
      "author": "empenoso",
      "datetime": "2023-01-17T11:54:34.000Z",
      "text": "Как раз вот и будут. Лизинговые машины обладают какой-то особенной привлекательностью для налоговой.И путевые листы ведь в более общем плане - не только курьеры. Может работы какие-то проводились на сетях связи например."
    },
    {
      "id": 25123750,
      "author": "aborouhin",
      "datetime": "2023-01-17T12:12:11.000Z",
      "text": "Как раз вот и будут.У Вас есть конкретные примеры? Не в рамках уголовного дела, а просто в ходе проверки? Я с трудом себе представляю, чтобы ИФНС сначала писала запрос в МВД о предоставлении выписки из данных системы \"Поток\", потом корпела над картой, сопоставляя точки в путевых листах с точками из этой выписки... Скорее на нестыковках во внутренних документах поймают (маршрут в листе в день N в одной части города, а чек с заправки в тот же день - с совершенно другой).При том, что выхлоп с этих действий в любом случае невелик, это ж не миллиарды, выведенные на однодневки, скажем... Ведь рисовать фейковые листы осмысленно только в случае, если у нас нет задачи внутреннего контроля за водителями (скажем, если ИП сам ездит на своей машине, он всё равно листы заполнять обязан, и тут уже дурацким требованиям - дурацкое исполнение). Какие там суммы затрат в этом сценарии...Может работы какие-то проводились на сетях связи например.Ну тогда наряд на работы попросят показать. Беспроигрышный вариант - только если точки собственные (например, сеть магазинов). Но тогда как раз и надо генерить маршруты между этими точками, а не придумывать случайные адреса. А если это адреса сторонних лиц - так или иначе должен быть какой-то документ, на основании которого нам туда надо ехать.В общем, тут либо реально забиваем \"свои\" точки (офисы, магазины, производственные площадки, стоянки и пр.) и рисуем рандомные маршруты между ними. А потом вручную перепроверяем на отсутствие противоречий иным документам (заправки, мойки, ТО, аварии, штрафы и т.п.) Либо ничего не рисуем и генерируем соответствующие реальной жизни путевые листы.P.S. Нашёл несколько дел, когда налоговая реально данные \"Потока\" запрашивала и наних ссылалась. А53-9473/2021, А54-9379/2021,   А63-12114/2014.Но там возили щебень самосвалами (по первым двум делам) и алкоголь (по третьему) - и во всех случаях налоговой оспаривалось не только списание топлива, но и фиктивность поставок самого этого щебня/вина в целом, т.е. смысл заморочиться у них был."
    },
    {
      "id": 25123964,
      "author": "empenoso",
      "datetime": "2023-01-17T12:56:09.000Z",
      "text": "У вас очень осмысленные ответы. Спасибо вам.Особенно согласен \"дурацким требованиям - дурацкое исполнение\"."
    },
    {
      "id": 25121662,
      "author": "empenoso",
      "datetime": "2023-01-17T05:44:43.000Z",
      "text": "Можно и как вы предлагаете, но эти места могут быть совершенно в разных районах - если будут проверять как автомобиль фактически ездил, тогда вообще нестыковка будет."
    },
    {
      "id": 25121890,
      "author": "HiLander",
      "datetime": "2023-01-17T06:52:02.000Z",
      "text": "Много лет назад делал для себя подобную штуку на дельфях. Выбираешь месяц - он автоматом прописывает количество дней убирая выходные. Прописываешь общий расход топлива (сколько талончиков надо списать), он автоматически разбрасывает случайным километражом/литражом по всем дням. Итог выгружался в эксель готовый для печати (двусторонней). Подписи в шапке настраивались опционально. Место назначения прописывал универсально \"по объектам\" ибо работал снабженцем и поставщиков было 100500 и возить надо было на десяток разных объектов (в т.ч. на удалении до 300Км). Ни у кого вопросов не возникало ни разу... Если интересно могу поискать исходники."
    },
    {
      "id": 25122180,
      "author": "empenoso",
      "datetime": "2023-01-17T07:50:54.000Z",
      "text": "Интересный опыт, спасибо!"
    },
    {
      "id": 25123194,
      "author": "Dart55",
      "datetime": "2023-01-17T10:26:06.000Z",
      "text": "Я бы хотел написать что гугл скрипты это классно и до подделки путевых листов мне нет дела, но вы ведь знаете как это влияет на безопасность участников дорожного движения."
    },
    {
      "id": 25123294,
      "author": "empenoso",
      "datetime": "2023-01-17T10:40:42.000Z",
      "text": "А как это влияет на безопасность участников дорожного движения?"
    },
    {
      "id": 25126308,
      "author": "Vlad_VM333",
      "datetime": "2023-01-18T04:11:49.000Z",
      "text": "Примечание: \"Организации и предприниматели, деятельность которых связана с автотранспортом, обязаны оформлять путевой лист – первичный документ для учета и контроля работы транспортного средства и водителя\", \"оформлять путевой лист, если индивидуальный предприниматель использует автомобиль для коммерческих перевозок пассажиров, грузов и багажа, а также при ведении иной экономической деятельности. Для поездок по личным делам, не связанным с предпринимательской деятельностью, путевой лист оформлять не нужно\".Замечания по шаблону:-\"Приказ № 368 не содержит указаний на максимальный срок действия путевого листа, однако учитывая приведенные выше правила, можно сделать вывод, что закон позволяет оформлять один путевой лист сразу на несколько дней или недель, но только в том случае, если рейс длится весь срок действия путевого листа. Под рейсом в данном случае следует понимать поездку с момента выезда транспортного средства с места стоянки до момента его возвращения на стоянку\", т.е. в случае возвращения ТС на место базирования обязательно оформлять новый путевой лист!-путевой лист- это бланк, который должен быть в физическом плане, т.к. в нем ставит подпись механик, врач, водитель, в некоторых случаях другая организация ставит отметки \"задание выполнено\", либо водитель указывает задание (обратная сторона путевого листа) перевозка груза, перевозка людей и.т.д.;-что касается координат..возможно имело бы смысл интегрировать данный шаблон, либо разработать программу, которая позволяла бы через приложение у водителя, привязанного к картам, ставить отметку \"выехал\", \"приехал под загрузку\" и т.д., тогда система автоматически считала время выезда, возвращения, выезда и точек стоянки."
    },
    {
      "id": 25126310,
      "author": "empenoso",
      "datetime": "2023-01-18T04:12:38.000Z",
      "text": "Хорошие замечания, спасибо!"
    },
    {
      "id": 28004432,
      "author": "oplacheno",
      "datetime": "2025-03-05T17:37:29.000Z",
      "text": "Спасибо тебе о добрейший из добрейших! Взял копию твоей таблицы, конечно осушил половину формул - и все равно сэкономил себе кучу времени! Всех благ вам!"
    }
  ]
}