{
  "url": "https://habr.com/ru/articles/733754/comments/",
  "article_id": 733754,
  "title": "Как убрать пустые оборотные страницы из PDF после двухстороннего сканирования",
  "comments": [
    {
      "id": 25532310,
      "author": "Neo5",
      "datetime": "2023-05-10T02:41:24.000Z",
      "text": "В Вашем случае пустая PDF страница весит меньше 70 кБ. Но это же не константа - для разных документов этот размер может различаться, намёк на это был в тексте. Как узнать эту величину заранее или её необходимо подбирать эмпирическим методом?"
    },
    {
      "id": 25532318,
      "author": "empenoso",
      "datetime": "2023-05-10T02:46:42.000Z",
      "text": "Вы абсолютно правы. Перед тем как задать эту цифру я вручную разобрал несколько файлов при помощи командыpdftk \"$file\" burstи посмотрел сколько лично в моём случае составляет размер пустой страницы."
    },
    {
      "id": 25532342,
      "author": "N1ght1ngale",
      "datetime": "2023-05-10T03:07:16.000Z",
      "text": "И на старуху бывает проруха ) Я бы не удалял, а просто перекладывал файлы в отдельную папку, чтобы потом быстро пролистать содержимое по превьюшкам, ну а дальше можно и удалить, если не затесался какой нибудь лист с одной строчкой."
    },
    {
      "id": 25532354,
      "author": "empenoso",
      "datetime": "2023-05-10T03:16:11.000Z",
      "text": "Спасибо"
    },
    {
      "id": 25532614,
      "author": "skaf",
      "datetime": "2023-05-10T06:04:50.000Z",
      "text": "Подумал ровно об этом же, когда читал статью - складывать в файл и потом пролистать. Но, ведь, если пустых страниц будет много, то, листая, можно что-то, да пропустить. Тут нужно что-то ещё придумать. Но это, все же, хоть какой-то контроль."
    },
    {
      "id": 25669594,
      "author": "empenoso",
      "datetime": "2023-06-20T09:26:39.000Z",
      "text": "Переделал в статье:mv \"$page\" \"removed/\""
    },
    {
      "id": 25532556,
      "author": "IvanSTV",
      "datetime": "2023-05-10T05:29:10.000Z",
      "text": "я в свое время, когда встал вопрос автоматического редактирования PDF (надо было границы подправить и еще что-то поменять, потом напечатать, фокус был в том, что напрямую на принтер мимо редактирования программно было нельзя по требованиям безопасности), написал макрос на VBA, который открывает PDF Word'ом, делает что надо, печатает и обратно сохраняет. Для PDF, где одни картинки и нет текстового слоя, это может быть даже и проще."
    },
    {
      "id": 25533434,
      "author": "zaki",
      "datetime": "2023-05-10T09:32:13.000Z",
      "text": "Делал на python вот алгоритмimg = img.resize((50,50))\nwidth, height = img.size\n\nr_total = 0\ng_total = 0\nb_total = 0\n\ncount = 0\nfor x in range(0, width):\n    for y in range(0, height):\n        r, g, b = img.getpixel((x,y))\n        r_total += r\n        g_total += g\n        b_total += b\n        count += 1далее пример получаем на выходе:r_total/count = 251,4864\ng_total/count = 249,6232\nb_total/count = 252,5612251,4864 + 249,6232 + 252,5612 = 753,6708 / 3 = 251,2235251,2236 больше 250 значить лист белый"
    },
    {
      "id": 25533442,
      "author": "empenoso",
      "datetime": "2023-05-10T09:33:59.000Z",
      "text": "А если сканы отверстий под перешивку например есть?"
    },
    {
      "id": 25533496,
      "author": "zaki",
      "datetime": "2023-05-10T09:51:35.000Z",
      "text": "Ну если скинешь пример я проверю результат, у меня попадают в этот фильтр страницы которые с мусором типа полоска от печати принтера или если поставили штамп и он один на белом листе бледный"
    }
  ]
}