{
  "url": "https://habr.com/ru/articles/739168/comments/",
  "article_id": 739168,
  "title": "Автоответчик на запросы доступа к файлам в гугл почте",
  "comments": [
    {
      "id": 25616602,
      "author": "1dNDN",
      "datetime": "2023-06-05T01:09:38.000Z",
      "text": "Зачем отвечать на запросы доступа письмом? Просто дал доступ или не дал, уведомление запрашивающему придет все равноВ чем смысл автоматически отвечать на запросы доступа и удалять их? Их же шлют не чтобы получить ответ буквами, а чтобы получить доступ. Судя по статье, сам процесс выдачи доступа никак не автоматизируется"
    },
    {
      "id": 25616644,
      "author": "empenoso",
      "datetime": "2023-06-05T02:33:45.000Z",
      "text": "Так можно отправить сообщение тому кто запрашивает доступ к файлу. Ведь например если это таблица, то человек сразу увидит только таблицу. Что-то типа аннотации. Или с продажами можно связать.Отвечать и удалять письма и запрос - смысл в том что если таких запросов очень много то они просто болтаются в почте и от них никакой пользы. Опять же в письме можно перенаправить на какие-то дополнительные материалы или что-то подобное."
    },
    {
      "id": 25616696,
      "author": "VikkorMalansohn",
      "datetime": "2023-06-05T03:46:15.000Z",
      "text": "Тоже ничего не понял зачем вот вот это вот всё. Права на файл все равно выдает человек, значит читает письма, и может и удалять их. А вот почему они скапливаются не прочитанными и как эта процедура из автопрочтения, аатоответа и удаления помогает запрашивающему все таки получать доступ, не понятно."
    },
    {
      "id": 25616700,
      "author": "empenoso",
      "datetime": "2023-06-05T03:49:49.000Z",
      "text": "Вы правы, запрашивающему получить доступ эта процедура вряд ли помогает, но эта статья и код про того, кто решает предоставлять доступ или нет. При помощи письма можно перенаправить на другие ресурсы например."
    },
    {
      "id": 25616698,
      "author": "Javian",
      "datetime": "2023-06-05T03:46:57.000Z",
      "text": "Что мешает сделать доступ по ссылке для всех кто имеет эту ссылку. Не понятно."
    },
    {
      "id": 25616702,
      "author": "VikkorMalansohn",
      "datetime": "2023-06-05T03:49:59.000Z",
      "text": "Что мешает сделать доступ по ссылке для всех кто имеет эту ссылку. Не понятно."
    },
    {
      "id": 25616744,
      "author": "Javian",
      "datetime": "2023-06-05T04:31:10.000Z",
      "text": ""
    },
    {
      "id": 25616748,
      "author": "VikkorMalansohn",
      "datetime": "2023-06-05T04:34:35.000Z",
      "text": ""
    },
    {
      "id": 25681400,
      "author": "Javian",
      "datetime": "2023-06-23T06:51:51.000Z",
      "text": "Я не могу так поделиться ссылкой т.к. где-то гуляет \"ссылка старого типа\" и мне приходят такие письма:запрашиваетдоступ к файлу по старой ссылке, которая теперь недействительнав связи с обновлением системы безопасности. Поделитесь файлом с этим пользователем напрямую или отправьте ему новую ссылку на него с помощью настроек доступа."
    },
    {
      "id": 26982570,
      "author": "oshliaer",
      "datetime": "2024-06-28T10:31:10.000Z",
      "text": "Я предоставляю доступ ко многим публичным файлам. У меня подобный скрипт работат для того, чтобы определить, что пользователь создал запрос на доступ к редактированию, далее программа определяет класс файла, если он классифицируется как публичный без доступА, то автоматически отправляет в ответ письмо, мол, не ленись, сделай копию руками. Очень выручает и оставляет возможность коммуницировать с неизвестными людими, например, делать им коммерческие предложения."
    }
  ]
}