{
  "url": "https://habr.com/ru/articles/773620/comments/",
  "article_id": 773620,
  "title": "Как обновлять информацию о фильмах и сериалах на медиацентре Kodi бесплатно и на русском языке",
  "comments": [
    {
      "id": 26158548,
      "author": "ZekaVasch",
      "datetime": "2023-11-14T12:31:03.000Z",
      "text": "Т.е. вы предлагаете вручную запускать программу на отдельном компьютере вместо автоматики на устройстве с коди  ? Это сложно. Уж луче командная строка и скрипт"
    },
    {
      "id": 26158562,
      "author": "empenoso",
      "datetime": "2023-11-14T12:33:51.000Z",
      "text": "Да, поэтому что это проще. Проще проверить что с сетевыми настройками, проще подключить к ВПН, если это необходимо."
    },
    {
      "id": 26159338,
      "author": "13werwolf13",
      "datetime": "2023-11-14T16:37:06.000Z",
      "text": "давно перешёл с kodi на plex и теперь имею доступ к своей библиотеке везде где захочу, да ещё и с друзьями делюсь. а по сабжу: у меня plex получает данные о кинце с кинопоиска не боясь блокировок, то что не может найти там уже ищет на tmdb, и проблем с доступом к tmdb нет потому что маршруты до них завёрнуты в vpn на роутере а не на сервере."
    },
    {
      "id": 26159342,
      "author": "empenoso",
      "datetime": "2023-11-14T16:40:20.000Z",
      "text": "Спасибо"
    },
    {
      "id": 28654234,
      "author": "LiquidBlasted",
      "datetime": "2025-08-02T21:03:52.000Z",
      "text": "Ну а я наоборот полгода назад послал нафиг Plex, который с 2013 пользовал, и ушел на Kodi. В киску решения, зависимые от чужих серверов."
    },
    {
      "id": 28654730,
      "author": "13werwolf13",
      "datetime": "2025-08-03T05:34:20.000Z",
      "text": "Я бы понял переход с plex на emby или jelyfin, но kodi это вообще из другой оперы, это как заменить стакан сапогом.."
    },
    {
      "id": 28670996,
      "author": "LiquidBlasted",
      "datetime": "2025-08-06T18:46:10.000Z",
      "text": "Слишком категорично. Во-первых, медиатеку многие и так хранят на NAS или домашнем сервере, и Kodi в качестве клиента есть под множество платформ, подключаясь к ней, во-вторых, вышеупомянутые Emby и Jellyfin по функционалу не дотягивают даже до Plex, не говоря про Kodi. Я, если что, на Plex сидел года с 2014, и с тех же времен постоянно присматривался к Kodi, который наконец похорошел до такой степени, а Plex наоборот - поплохел, что чаша весов перевесила"
    },
    {
      "id": 28671040,
      "author": "13werwolf13",
      "datetime": "2025-08-06T18:54:03.000Z",
      "text": "Вот только домашний nas остаётся дома, а просмотр хочется и на даче и в отпуске в отеле.. Да и синхронизация между клиентами kodi задача на дополнительный костыль.. Я уж молчу про невозможность совместного просмотра на разных клиентах и прочее..Plex не становится хуже, наоборот замечаю массу улучшений. Бесит только что некоторые фичреквесты по десять лет висят незамеченными."
    },
    {
      "id": 26159362,
      "author": "makis",
      "datetime": "2023-11-14T16:50:45.000Z",
      "text": "Не знал про Media Companion. Давно пользуюсь Ember Media Manager. Она даже чем-то похожа. Сначала непривычно и геморно даже, но со временем привыкаешь. Уже давно не работает загрузчик трейлеров с ютуба и приходится их скачивать сторонними программами. Если бы не этот косяк, было бы куда легче."
    },
    {
      "id": 26165654,
      "author": "empenoso",
      "datetime": "2023-11-16T12:30:02.000Z",
      "text": "А как в итоге проблему с трейлерами решили?"
    },
    {
      "id": 26183144,
      "author": "makis",
      "datetime": "2023-11-21T18:28:34.000Z",
      "text": "Трейлеры качаю сторонними приложениями. Например,https://github.com/unrud/video-downloaderилиhttps://github.com/Tyrrrz/YoutubeDownloader. И потом их уже вручную кладу в директории с фильмами и выбираю трейлер как локальный файл в Ember MM."
    },
    {
      "id": 26183954,
      "author": "empenoso",
      "datetime": "2023-11-22T03:46:13.000Z",
      "text": "Но как вы выбираете конкретный трейлер на ютубе? Скриптом?"
    },
    {
      "id": 26185530,
      "author": "makis",
      "datetime": "2023-11-22T11:14:19.000Z",
      "text": "Вручную поиском по ютубу. Копирую ссылку на ролик и потом уже качаю его этим софтом."
    },
    {
      "id": 26188310,
      "author": "empenoso",
      "datetime": "2023-11-23T04:18:09.000Z",
      "text": "А какая маска имени для названия трейлера?"
    },
    {
      "id": 26159508,
      "author": "Lexsus333",
      "datetime": "2023-11-14T17:40:45.000Z",
      "text": "Стоит дома NAS от Synology. У него свой аналог Plex'а - Video Station. Информацию о фильмах она получает от той же TMDB. Когда доступ пропал - расстроился. Но спустя некоторое время нашел решение на форуме Synology  - всего-то задал на NAS'е DNS 9.9.9.9. На форуме объяснялось, что банится доступ не по IP, а каким-то образом через DNS, в дальнейшую суть не в давался - работает без проблем."
    },
    {
      "id": 26160260,
      "author": "empenoso",
      "datetime": "2023-11-15T02:42:06.000Z",
      "text": "У меня тоже синолоджи"
    },
    {
      "id": 26161192,
      "author": "Lexsus333",
      "datetime": "2023-11-15T08:48:59.000Z",
      "text": "Как вариант, попробуйте в общих настройках сети задать DNS вручную, так наверное чуть проще будет)Я основным указал 9.9.9.9, а допом - адрес роутера, на всякий случай.Можно конечно и на роутер его прописать сразу, но боюсь медленнее будут российские ресурсы  открываться."
    },
    {
      "id": 27594356,
      "author": "Lopar",
      "datetime": "2024-11-25T09:57:46.000Z",
      "text": "Тогда не обновляйтесь, потому что Synology прекратила поддержку Video Station и вырезала его."
    },
    {
      "id": 27594394,
      "author": "empenoso",
      "datetime": "2024-11-25T10:03:48.000Z",
      "text": "Сам пользуюсь Synology, но не использовал Video Station.Kodi удобнее на мой взгляд."
    },
    {
      "id": 26161980,
      "author": "Habr1337",
      "datetime": "2023-11-15T11:37:43.000Z",
      "text": "так чем он лучше MediaElch? ME хотя бы открытый, и под Windows тоже есть."
    },
    {
      "id": 26161988,
      "author": "empenoso",
      "datetime": "2023-11-15T11:38:13.000Z",
      "text": "Не знаю, ничем не лучше просто другой-мне он больше приглянулся."
    }
  ]
}