{
  "url": "https://habr.com/ru/articles/777376/comments/",
  "article_id": 777376,
  "title": "Самая дешевая заводская панель управления умным домом, которая отлично работает",
  "comments": [
    {
      "id": 26217054,
      "author": "kirik",
      "datetime": "2023-12-01T02:39:26.000Z",
      "text": "Завёл у себя такое, через Blueprint - работает отлично, а главное выглядит достойно (в отличии самопала на ардуино).Добавлю, что поддерживается OTA обновления через ESPHome, так что разбирать и шить проводами нужно только один раз."
    },
    {
      "id": 26217056,
      "author": "empenoso",
      "datetime": "2023-12-01T02:40:45.000Z",
      "text": "Да, это так"
    },
    {
      "id": 26217182,
      "author": "AigizK",
      "datetime": "2023-12-01T04:41:37.000Z",
      "text": "Прикольный дисплей, спасибо за наводку."
    },
    {
      "id": 26217218,
      "author": "DanilinS",
      "datetime": "2023-12-01T05:17:11.000Z",
      "text": "А где за 3.5 можно купить? Везде за 4 минимум. Или информация немного устарела?"
    },
    {
      "id": 26217228,
      "author": "empenoso",
      "datetime": "2023-12-01T05:23:46.000Z",
      "text": "Я сам ещё в прошлом году покупал, просто собирался долго ?На AliExpress они тоже есть посмотрите там цены."
    },
    {
      "id": 26221082,
      "author": "remendado",
      "datetime": "2023-12-02T08:17:05.000Z",
      "text": "На али цены в районе 5 т.р."
    },
    {
      "id": 26223266,
      "author": "Iv38",
      "datetime": "2023-12-03T01:02:57.000Z",
      "text": "Сегодня, после этой статьи, заказывал на Озоне. Я выбрал вариант с локальной доставкой за 4100 рублей, но там же видел и вариант с доставкой из Китая за 3250."
    },
    {
      "id": 26217262,
      "author": "13werwolf13",
      "datetime": "2023-12-01T05:45:36.000Z",
      "text": "я долго ждал чтобы для этой панельки появилась свободная фирмварь.. и проморгал момент когда она появилась..@empenosoподскажи:1) я насколько помню в этой игрушке есть зигби, может ли оно использоваться как зигби хаб для ZHA?2) при покупке стоит брать pro версию, или она не шьётся как НЕ pro версия?"
    },
    {
      "id": 26217280,
      "author": "empenoso",
      "datetime": "2023-12-01T05:52:36.000Z",
      "text": "Sonoff NSpanel Pro совершенно другое устройство:* Sonoff NSpanel: ESP32 + Nextion - это в этой статье.* Sonoff NSpanel Pro: на адроиде (значит можно вывести изображение с камеры) и есть Zigbee, но значит там совершенно другие правила НЕ как описанные в этой статье. И у неё вроде нет физических кнопок."
    },
    {
      "id": 26217290,
      "author": "13werwolf13",
      "datetime": "2023-12-01T05:54:13.000Z",
      "text": "да, погуглил и понял что вопрос мой глупый.. отстал я от жизни..но спасибо за ответ"
    },
    {
      "id": 26219614,
      "author": "vpiyanov",
      "datetime": "2023-12-01T15:34:22.000Z",
      "text": "* Sonoff NSpanel: ESP32 + Nextion - это в этой статье.А  на эту вывести видео с камеры не получится? Слишком слабый процессор?"
    },
    {
      "id": 26219616,
      "author": "empenoso",
      "datetime": "2023-12-01T15:34:38.000Z",
      "text": "Не получится. Нужен андроид"
    },
    {
      "id": 26220170,
      "author": "AllexIn",
      "datetime": "2023-12-01T19:13:16.000Z",
      "text": "Какая связь между андроидом и выводом изображения?Экран есть, WIfi есть. Просим видеорегистратор класть картинку с камеры на http сервер с определенной периодичностью, в нужном разрешении, в прошивке грузим картинку и выводим на экран.Не знаю каким регистратором пользуется автор вопроса, я пользуюсь Agent DVR и у меня так две камеры выводятся на панель управления. 1 кадр в 5 секунд. Вполне позволяет оценить ситуацию в точке наблюдения. А если нужен реалтайм - уже с телефона или ПК полноценное подключение."
    },
    {
      "id": 26220658,
      "author": "empenoso",
      "datetime": "2023-12-02T01:15:46.000Z",
      "text": "Идея хорошая, но в этой прошивке по-моему вывод изображений не предусмотрен..."
    },
    {
      "id": 26221544,
      "author": "NutsUnderline",
      "datetime": "2023-12-02T10:49:04.000Z",
      "text": "не то чтобы совсем нельзя, esp32 даже имеет проекты по подключению камеры. НО если мы говорим про внешнюю камеру то там какой нить поток зажатый. Если mjpeg или как сказали выше - jpeg картинками, то еще может быть. а вот h264 или че то моднее - не осилит, это нужен гораздо мощный проц и/или модуль аппаратного декодирования, и драйвера - а это более менее проработано только на android, на малине и на ELEC"
    },
    {
      "id": 26223282,
      "author": "Iv38",
      "datetime": "2023-12-03T01:16:08.000Z",
      "text": "В этой панели ещё и дисплей Nextion, это HMI-дисплей и ESP32 не выводит на него изображение напрямую, а лишь сообщает ему, что показывать из заранее сформированного интерфейса, который хранится на флешке самого дисплея. Я знаю, что Nextion способен отображать заранее загруженные в него видеоролики, но мне не попадалось решений со стримингом, и я не представляю, как это могло бы работать."
    },
    {
      "id": 26224176,
      "author": "NutsUnderline",
      "datetime": "2023-12-03T11:24:27.000Z",
      "text": "свои фе к архитектуре данной штуковины я уже высказал. да, Nextion изначально рассчитан вообще на uart и  загрузку картинок с карты памяти. В теории картинку-другую можно не торопясь и по uart передавать. но тогда это точно костыль на костыле"
    },
    {
      "id": 26217552,
      "author": "Majestic108",
      "datetime": "2023-12-01T06:43:51.000Z",
      "text": "А есть такое но с Ethernet и питанием POE?"
    },
    {
      "id": 26217576,
      "author": "empenoso",
      "datetime": "2023-12-01T06:45:54.000Z",
      "text": "На али вроде что-то такое было, но ценники там 30-40 т.р., а не 3,5 как здесь"
    },
    {
      "id": 26217808,
      "author": "garageman",
      "datetime": "2023-12-01T07:37:27.000Z",
      "text": "https://wirenboard.com/ru/catalog/hmi/"
    },
    {
      "id": 26217946,
      "author": "smart_alex",
      "datetime": "2023-12-01T08:03:24.000Z",
      "text": "Панель настенная 4 дюйма 21 150 руб.Панель настенная 8 дюймов 26 700 руб.Остались вопросы? Свяжитесь с намиНет, вопросов не осталось."
    },
    {
      "id": 26218466,
      "author": "Vitimbo",
      "datetime": "2023-12-01T10:02:01.000Z",
      "text": "Как же вопрос \"А чо так дорого?\" ?"
    },
    {
      "id": 26222540,
      "author": "nochkin",
      "datetime": "2023-12-02T16:54:52.000Z",
      "text": "Пожалуй, вполне приемлемая цена за готовое решение. Для колхозников есть дешевле варианты, но так и результат будет соответствовать экономии."
    },
    {
      "id": 26237714,
      "author": "DimaSimfer",
      "datetime": "2023-12-06T16:09:49.000Z",
      "text": "А что, если ноутбук-трансформер и выводить HA через браузер? Poe нет, но угловой разъем питания можно в небольшой рамке спрятать, 3d принтер в помощь."
    },
    {
      "id": 26237810,
      "author": "nochkin",
      "datetime": "2023-12-06T16:34:18.000Z",
      "text": "Конечно, можно. Но именно это и называется колхоз. Не всем это подходит по разным причинам."
    },
    {
      "id": 26219830,
      "author": "shadrap",
      "datetime": "2023-12-01T16:58:42.000Z",
      "text": "Взять LILYGo на 32м с Рое и эзернетом и прикрутить экран через Spi. Тыщи 4 выйдет,но придётся кустарить."
    },
    {
      "id": 26217556,
      "author": "Yanych",
      "datetime": "2023-12-01T06:43:53.000Z",
      "text": "Маленький экран. Вот бы найти домофон на андроид, чтоб GA туда поставить. Пока вител только IP  вариации таких панелей, аналоговых нет."
    },
    {
      "id": 26217572,
      "author": "empenoso",
      "datetime": "2023-12-01T06:45:06.000Z",
      "text": "Иногда это скорее плюс. Смотря зачем надо.> домофон на андроид  это  Sonoff NSpanel Pro"
    },
    {
      "id": 26217558,
      "author": "DmitriyTHabr",
      "datetime": "2023-12-01T06:43:57.000Z",
      "text": "Говорят, на неё даже ставят крутую прошивку IoTmanager. Собираюсь попробовать."
    },
    {
      "id": 26217560,
      "author": "empenoso",
      "datetime": "2023-12-01T06:44:17.000Z",
      "text": "А зачем она нужна? Посмотрел, но так и не понял..."
    },
    {
      "id": 26217804,
      "author": "garageman",
      "datetime": "2023-12-01T07:36:48.000Z",
      "text": "Давно и успешно используется:https://wirenboard.com/wiki/Sonoff_NSPanel"
    },
    {
      "id": 26217824,
      "author": "empenoso",
      "datetime": "2023-12-01T07:41:53.000Z",
      "text": "Там через Tasmota только прошивка"
    },
    {
      "id": 26218006,
      "author": "akod67",
      "datetime": "2023-12-01T08:15:12.000Z",
      "text": "Интересны реальные юз кейсы. В доме обычно телефон ближе, чем центральная панель, особенно на диване :)"
    },
    {
      "id": 26218020,
      "author": "empenoso",
      "datetime": "2023-12-01T08:19:30.000Z",
      "text": "Я у кровати поставил: ночью тыкнешь и время видно. А одна из физических кнопок сделал сценарий выключить всё"
    },
    {
      "id": 26218430,
      "author": "akod67",
      "datetime": "2023-12-01T09:55:07.000Z",
      "text": "Подобные сценарии, особенно ночью, часто удобней физическими кнопками включать, не разлепляя глаз. Сейчас есть много всяких \"мобильных\" zigbee кнопок, которые можно в любое место прицепить (если заранее не догадался сделать в нужном месте стационарную). Сколько ни думал, так и не придумал, зачем центральная панелька в доме с экраном, кроме как попонтоваться перед гостями =) Ну может прогноз погоды посмотреть в прихожей и на сигнализацию дом поставить, но опять же, телефон всегда в руках."
    },
    {
      "id": 26218468,
      "author": "DMGarikk",
      "datetime": "2023-12-01T10:02:10.000Z",
      "text": "но опять же, телефон всегда в руках.Он у вас в руках, а бывают еще жена и дети и не всегда дома все с телефоном в обнимку ходяту меня часть освещения дома включается через HA и только с телефона. надо ли упоминать что только я его и включаю в итоге? хотя я ребенку и жене виджет выключателя прямо на экран телефона вывел... в итоге ставлю сейчас проходные выключатели в параллель к релюшкам, чтобы руками можно было тыркать"
    },
    {
      "id": 26218612,
      "author": "akod67",
      "datetime": "2023-12-01T10:32:02.000Z",
      "text": "еще жена и дети и не всегда дома все с телефоном в обнимку ходяттелефон у современных детей - это часть тела =)"
    },
    {
      "id": 26220844,
      "author": "AllexIn",
      "datetime": "2023-12-02T05:19:55.000Z",
      "text": "У, скажем так, не очень разумных родителей."
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 26219416,
      "author": "venanen",
      "datetime": "2023-12-01T14:17:38.000Z",
      "text": "Кейс 1: ставим у кровати. Первая кнопка отвечает за режим подъема - включить нужный свет, чайник, открыть шторы. Вторая кнопка отвечает за режим похода в туалет (кстати, у кого не сделано - яоченьрекомендую) - ночью при нажатии включается свет по пути до туалета в красном цвете (если ламы led rgb) на минимальной яркости. Бонусом время посмотреть можно, и, возможно, будильники ставить. Особенно, если она стоит 3.5к, а кнопки стоят 1к~.Кейс 2: ставим в прихожей - перед выходом погода, прогноз, кнопка включить весь свет, вторая - включить.Да и выглядит панелька все-таки красивее, чем просто 2 кнопки, прилепленные на двухсторонний скотч."
    },
    {
      "id": 26219546,
      "author": "empenoso",
      "datetime": "2023-12-01T15:06:29.000Z",
      "text": "Хотя у меня и HA и панель и умный дом но для ночного похода в туалет под потолком туалета розетка, где установлен настроенный на минимальную яркость датчик движения типа такого:https://www.ozon.ru/product/nochnik-v-rozetku-s-datchikom-dvizheniya-i-regulirovkoy-yarkosti-802270311/"
    },
    {
      "id": 26220288,
      "author": "fio",
      "datetime": "2023-12-01T20:06:21.000Z",
      "text": "Вторая кнопка отвечает за режим похода в туалет - ночью при нажатии включается свет по пути до туалета в красном цвете (если ламы led rgb) на минимальной яркостиЭто же удобнее сделать на датчике движения."
    },
    {
      "id": 26223180,
      "author": "zhka",
      "datetime": "2023-12-02T22:34:34.000Z",
      "text": "сразу видно, что у Вас нет кошек)"
    },
    {
      "id": 26223580,
      "author": "fio",
      "datetime": "2023-12-03T07:21:27.000Z",
      "text": "Есть мелкая собака. Датчик движения настроен так, чтобы не реагировать на нее. Установлен на потолке.Можно было и при выборе места установки датчика расположить зону видимости выше зоны обитания животных.Даже если датчик будет реагировать на животных - это не плохо. Подсветка ночью должна быть настолько деликатной, чтобы не мешать спящим."
    },
    {
      "id": 26220848,
      "author": "AllexIn",
      "datetime": "2023-12-02T05:20:54.000Z",
      "text": "Это делается просто расписанием. Зачем руками что-то включать?2. Если хочется контроля тут лучше голосом. Сразу после сна с экраном крайне не комфортно взаимодействовать."
    },
    {
      "id": 26222424,
      "author": "fio",
      "datetime": "2023-12-02T16:17:24.000Z",
      "text": "2. Если хочется контроля тут лучше голосом.Чтобы дойти сонным до туалета нужно что-то говорить? Я чего-то не понимаю в этом мире."
    },
    {
      "id": 26225138,
      "author": "AllexIn",
      "datetime": "2023-12-03T18:19:55.000Z",
      "text": "А там только туалет обсуждается?Для туалете не нужно что-то говорить. И датчики не нужны. Нужен просто ночной режим освещения с слабым свечением в коридорах и самом туалете.Лично у меня в туалете дневной режим - это датчик движения, ночной - слабое постоянное свечение."
    },
    {
      "id": 26225770,
      "author": "empenoso",
      "datetime": "2023-12-04T01:56:08.000Z",
      "text": "Ночной у меня тоже"
    },
    {
      "id": 26239726,
      "author": "zuek",
      "datetime": "2023-12-07T07:47:02.000Z",
      "text": "Странно - мне для ночных блужданий всегда хватает света уличных фонарей... единственная проблема - пришлось приучить чёрную кошку, любящую развалиться посреди коридора, \"говорить \"мур!\" при приближении человека."
    },
    {
      "id": 26274862,
      "author": "heejew",
      "datetime": "2023-12-17T10:03:24.000Z",
      "text": "Вторая кнопка отвечает за режим похода в туалет (кстати, у кого не сделано - я очень рекомендуюКнопка для прохода в туалет?В моем понимании умный дом это дом, в котором для абсолютного большинства сценариев не требуется активация пользователем. Поэтому в этом случае прекрасно работают датчики движения ( и/или присутствия ), и никакие кнопки у кровати для этого не нужно делать. Вот это действительно я бы рекомендовал. На физической кнопке у самого туалета можно разве что сделать включение полной яркости ночью в кабинете для эвакуационной деятельности. Редко, но может пригодится.Проблема с животными решается довольно легко, на самом деле. Несмотря на бесоебства животинок, срабатывания крайне редки. Но если есть возможность сделать ночью постоянный дежурный минимальный свет, который никому не мешает - так даже и лучше."
    },
    {
      "id": 26220840,
      "author": "AllexIn",
      "datetime": "2023-12-02T05:19:23.000Z",
      "text": "Центральная панель, которая доступна всем в доме. В том числе гостям.Висит на проходном месте, иногда реально быстрее к ней подойти и сделать то что нужно, чем доставать телефон, разблокировать, переключаться на приложение умного дома.Вывод дополнительной информации. К примеру на панели у меня приложение умного дома с телефона - это четверть экрана. Еще четверть - отображение в реальном времени информации о вентиляции: температура входящего и исходящего потока, средняя мощность нагрева за последние несколько минут. На телефоне это просто не нужно.Две остальных четверти - камеры на вход и в гараже. Опять же, позволяет просто проходя мимо панели понять, что машина на месте, ворота не забыли закрыть и т.п."
    },
    {
      "id": 26218160,
      "author": "Chupakabra303",
      "datetime": "2023-12-01T08:52:10.000Z",
      "text": "А какая у нее защита IP по передней панели?"
    },
    {
      "id": 26218182,
      "author": "empenoso",
      "datetime": "2023-12-01T08:56:50.000Z",
      "text": "Водозащиты нет от слова совсем"
    },
    {
      "id": 26219238,
      "author": "select26",
      "datetime": "2023-12-01T13:22:24.000Z",
      "text": "Класс IP определяет же не только влагозащиту."
    },
    {
      "id": 26219220,
      "author": "MaxPro33",
      "datetime": "2023-12-01T13:15:46.000Z",
      "text": "Вы упомянули использование прошивок NSPanel Lovelace UI и NSPanel_HA_Blueprint. Какой опыт у вас был с этими прошивками? Какие возможности они предоставляют для настройки интерфейса и интеграции с Home Assistant? Есть ли какие-то конкретные преимущества или недостатки у каждой из прошивок?"
    },
    {
      "id": 26219264,
      "author": "empenoso",
      "datetime": "2023-12-01T13:31:46.000Z",
      "text": "NSPanel_HA_Blueprint это и есть прошивка на всех фотографиях."
    },
    {
      "id": 26219266,
      "author": "empenoso",
      "datetime": "2023-12-01T13:32:00.000Z",
      "text": "NSPanel Lovelace UI это на основе тасмота"
    },
    {
      "id": 26219910,
      "author": "NutsUnderline",
      "datetime": "2023-12-01T17:28:02.000Z",
      "text": "я уже раскатил губу что это будет на андройде по типу дешевых (и сильно огороженных) xiaomiАрхитектура дивная, уже напрямую к esp32 дисплей заленились подключать. nextion к цене не иначе четверть прибавляет."
    },
    {
      "id": 26219974,
      "author": "empenoso",
      "datetime": "2023-12-01T17:53:54.000Z",
      "text": "На андроиде про версия этой панели, но там нет физических кнопок"
    },
    {
      "id": 26220516,
      "author": "NutsUnderline",
      "datetime": "2023-12-01T22:37:05.000Z",
      "text": "посмотрел, там есть свои плюсы и минусы. мелкую xiaomi продавали задешево, и у нее дизайн на мой вкус гораздо более"
    },
    {
      "id": 26274868,
      "author": "heejew",
      "datetime": "2023-12-17T10:07:44.000Z",
      "text": "А не подскажешь, что за девайс Xiaomi имеешь ввиду?"
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2023-12-02T01:13:29.000Z",
      "text": "Посмотрел, цены очень приятные. Но чтобы на стене закрепить это ведь надо что-то придумывать опять....dwin display"
    },
    {
      "id": 26220654,
      "author": "empenoso",
      "datetime": "2023-12-02T01:13:29.000Z",
      "text": "Посмотрел, цены очень приятные. Но чтобы на стене закрепить это ведь надо что-то придумывать опять....dwin display"
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 26220316,
      "author": "fio",
      "datetime": "2023-12-01T20:12:58.000Z",
      "text": "Буквально вчера установил старый Android планшет для отображения времени и погоды у выхода из квартирыЗарядку вывел через заднюю стенку планшета. Повезло, что дверь справа имеет разборный наличник и внутри уже стоял БП для датчиков движения и закрытого замка. Если бы за планшетом предусмотрел бы подрозетник с Ethernet, было бы проще.На стене закрепил с помощью двустороннего скотча. Находил скрытые крепления sl.aliexpress.ru/p?key=TwOvUYD"
    },
    {
      "id": 26220846,
      "author": "Akr0n",
      "datetime": "2023-12-02T05:19:55.000Z",
      "text": "Аккумулятор удалите из планшета, а то однажды может и полыхнуть."
    },
    {
      "id": 26221710,
      "author": "Vrag",
      "datetime": "2023-12-02T11:41:15.000Z",
      "text": "Я задумывался над этим вопросом. У меня висит амазоновский планшет. Я его во-первых ограничил только медленной зарядкой (5в, 1А), во-вторых софтово держу в рамках 20-80%. При этом у самого амазона есть оригинальный dock. Наверное, они предполагали сценарий, что я не буду с него планшет снимать вообще? Ну или большую часть времени использовать в доке. Как мне кажется в таком сценарии ничего не должно полыхнуть.И, кстати, не любой планшет заведётся с отключенной батареей."
    },
    {
      "id": 26221748,
      "author": "Akr0n",
      "datetime": "2023-12-02T11:51:55.000Z",
      "text": "Да без батареи могут не работать, надо что-то колхозить опять, в этом и проблема использования старых планшетов для таких панелей."
    },
    {
      "id": 26221822,
      "author": "Vrag",
      "datetime": "2023-12-02T12:20:26.000Z",
      "text": "Нет-нет-нет. Вколхозить условный чуви, а ещё и сильно уставший или что-то подобное, я бы не рискнул! Но условный ipad, самсунг или амазон - мне кажется должно быть весьма безопасно. С другой стороны у меня на pixel 5 акб раздувало. Причём при температуре окружающей среды +21. Я на нём всего один раз запустил разрядку батареи, чтобы ёмкость измерить. =)"
    },
    {
      "id": 26221782,
      "author": "NutsUnderline",
      "datetime": "2023-12-02T12:04:19.000Z",
      "text": "если сделано по уму - да, предполагали. если сделано чтобы как можно быстрее сдохло и пользователь побег покупать новый - тоже да, но сделали все наоборот. Процент тех кто  второй раз на такое же не подпишется либо мал - либо не рассматривался."
    },
    {
      "id": 26223292,
      "author": "Iv38",
      "datetime": "2023-12-03T01:30:49.000Z",
      "text": "У меня тоже зарядка полустационарного кухонного планшета (кстати, тоже Амазон) контролируется умным домом. В моём случае наличие акка абсолютно необходимо, так как я могу снять планшет с законного места и перемещаться с ним по квартире. Но и для стационарного это не лишне. Он хотя бы не будет аварийно отключаться при отключении электричества."
    },
    {
      "id": 26225246,
      "author": "Vrag",
      "datetime": "2023-12-03T19:00:01.000Z",
      "text": "Всмысле у вас условное реле размыкает питание планшета (или ЗУ), при достижении заряда планшета, скажем в 80% и потом включает его при 20??? Спасибо за изумительную идею! Надо реализовать! =) We need to go deeper!!"
    },
    {
      "id": 26229260,
      "author": "Iv38",
      "datetime": "2023-12-04T15:49:31.000Z",
      "text": "Да, именно так. У меня и смартфон так же заряжается. Он почти всегда стоит на подставке с беспроводной зарядкой, а Home Assistant включает её и выключает в зависимости от заряда телефона. Аналогично ночью у кровати. Но это хорошо работает только когда работаешь дома."
    },
    {
      "id": 26234058,
      "author": "ed007",
      "datetime": "2023-12-05T20:11:55.000Z",
      "text": "У меня много лет параллельно клеммам акума  подключен б/п на 3.9В и этого достаточно."
    },
    {
      "id": 26232542,
      "author": "Ozarenie",
      "datetime": "2023-12-05T12:33:23.000Z",
      "text": "Подскажите как именно ограничили процент заряда на планшете."
    },
    {
      "id": 26234382,
      "author": "Iv38",
      "datetime": "2023-12-05T23:34:05.000Z",
      "text": "У меня, например, на планшете стоит приложение Home Assistant. Оно предоставляет серверу умного дома кучу разных сенсоров с планшета, в том числе уровень заряда. Дальше просто автоматизацией, на основании этих данных, через умную розетку включается и выключается зарядник, к которому подключен планшет.Если планшет можно рутануть, то мне попадался модуль для magisk, который позволяет управлять ограничениями заряда на самом планшете. Сам не использовал, не знаю точно его возможностей и не знаю со всеми ли девайсами он совместим."
    },
    {
      "id": 26238416,
      "author": "vm03",
      "datetime": "2023-12-06T20:16:21.000Z",
      "text": "Зависит от драйвера контроллера заряда. Некоторые позволяют выключать/включать зарядку через sysfs."
    },
    {
      "id": 26260068,
      "author": "yeswolf",
      "datetime": "2023-12-12T23:50:31.000Z",
      "text": "У меня был use-case подключения телефона в работе 24/7 без возможности самому его в случае чего перезагрузить. После вполне продуманной настройки и беспроблемной работы \"спутника\" первым отказом был вздувшийся от постоянной зарядки аккум. Зарядка при этом была медленная, но влом было разбираться, как уйти от проблемы.Решение какое-то такое - как правило, нужно кинуть резистор с плюсового контакта на сигнальный, определяющий наличие батареи. Номинал методом тыка - уровень напряжения на контакте даёт планшету понять уровень зарядки. Отсюда, некоторого значения отличного от нуля будет достаточно. На плюс с минусом - либо понижайку с 5в до 4 с лихом, либо (как правило) просто те же 5в медленной зарядки, так как часть вольтажа в любом случае упадет через резистор на сигнальный контакт. У меня так сработало и в итоге спутник уже третий год работает.Отсюда, заведется почти любой - вопрос в том, чтобы распиновку аккума понять. А оставлять аккум - это гарантия либо проблем с корпусом, оторванным раздувшийся аккумлм, либо внезапного прекращения работы, потому что ампеража от аккума перестало хватать для тяжёлых задач (причем, отказ резкий, рандомный и всегда не вовремя), либо при плохом раскладе - да, пожар."
    },
    {
      "id": 26229430,
      "author": "fio",
      "datetime": "2023-12-04T16:32:36.000Z",
      "text": "Аккумулятор удалите из планшета, а то однажды может и полыхнутьСпасибо, всегда подозревал это и не понимал почему не сделали защиту от этого. Ведь планшет имеет dock-станцию, которая подаёт питание на боковые контакты (к ним я и подпаялся).В подтверждение ваших слов нашел публикациюКрасивые точные часы из старого смартфонаТам читать раздел Организация питания стационарного смартфона"
    },
    {
      "id": 26429964,
      "author": "fio",
      "datetime": "2024-01-27T18:17:39.000Z",
      "text": "@akronнапугали вы меня тогда. Прошло 2 месяца. Аккумулятор пока не подаёт признаков разбухания. Возможно, режим постоянной зарядки предусмотрен производителем - ведь у планшета есть штатная док-станция, на которой он может стоять всегда под питанием.Но на всякий случай я делаю для планшета внешний прерыватель линии питания. Будет самодельное устройство ESPhome + HomeAssistant. Умный дом HA будет получать уровень заряда и своей автоматизацией давать команду прерывателю включать/выключать питание планшета.Блин, сколько возни, а ведь можно было просто сделать штатную функцию в меню - как это реализовано на некоторых планшетах."
    },
    {
      "id": 26221694,
      "author": "Vrag",
      "datetime": "2023-12-02T11:33:43.000Z",
      "text": "Добрый человек! Вы сделали мой день!! В очередной раз радуюсь комментариям на хабре. Я в несколько итераций искал крепёж для планшета ровно для такой же инсталяции. В результате DIYил дикую конструкцию из пластиков, и магнтов, чтобы иметь возможность снимать планшет со стены. Оказывается нужно было просто искать не крепление для планшета, а нечто другое (безотносительно того, как теперь на али что-то (не)ищется вообще)."
    },
    {
      "id": 26222626,
      "author": "fio",
      "datetime": "2023-12-02T17:43:11.000Z",
      "text": "Попадались ещё такие крепленияhttps://m.aliexpress.ru/item/1005005267200541.htmlhttps://m.aliexpress.ru/item/4000092704683.html"
    },
    {
      "id": 26225228,
      "author": "Vrag",
      "datetime": "2023-12-03T18:53:35.000Z",
      "text": "У меня под планшетом распаечная коробка с ЗУ. Поэтому нужна \"съёмность\", плюс я верю, что 3M скотч удержится на пластике. А вот с обоев бумажных оно через какое-то время улетит (на рамках с фото проверено). Поэтому ответная часть из изначального поста на саморезах - самое оно. А с магнитными пластинами: во-первых не подходит для перфекционистов - оно может как угодно крепиться относительно \"уровня\". Во-вторых неловкое движение (оно висит на входе в квартиру) и он полетит со стены."
    },
    {
      "id": 26226452,
      "author": "fio",
      "datetime": "2023-12-04T06:05:15.000Z",
      "text": "Безотносительно крепления планшета. Открыл для себя прозрачный двухсторонний скотч с Али. Типатакого. Держит изумительно. Даже со временем ничего не отваливается. Его можно снять без следов, если потянуть ленту вдоль.Мой планшет на фото выше висит на таком скотче. Попытался оторвать после неудачного приклеивания - обои стали отрываться от стены"
    },
    {
      "id": 26274894,
      "author": "heejew",
      "datetime": "2023-12-17T10:17:25.000Z",
      "text": "Как раз хотел этот скотч предложить тоже.Подтверждаю его изумительность на все сто, среди переоцененного 3М такого добра не находил даже.На обоях держится прекрасно. Он у меня и сетевой фильтр держит, и на нем очень хорошо держатся держатели проводов ( вместо стандартных наклеек ). С обоями да, нюансик есть, да что там, он у меня и кусок краски с цементом отрывал. Но это моя неаккуратность)"
    },
    {
      "id": 26275490,
      "author": "Teemon",
      "datetime": "2023-12-17T14:21:23.000Z",
      "text": "Покажите что получилось. Тоже вопрос актуален"
    },
    {
      "id": 26238932,
      "author": "Regressor",
      "datetime": "2023-12-07T03:21:00.000Z",
      "text": "Как раз сейчас купил планшет и собираюсь заменить им домофонную панель. В ha sip клиент, на домофон бевардовский sip конвертер. Дома все работает на Home Assistant.Крепления планирую сделать на 3Д принтере, уже нарисовал и тестовую версию напечатал - планшет в крепление будет вщелкиваться. Сверху просто защелки. Снизу под планшетом небольшое полукруглое утолщение в котором будет esp32 платка с датчиком присутствия и управляемый преобразователь для QC зарядки планшета. Утолщение вышло где-то на 24мм по высоте и вроде как у меня отторжения не вызывает.Для подключения планшета купил вот такое вот на алиhttps://aliexpress.ru/item/1005004247427825.html(чисто ради разъема и плоского провода). Т.е. планшет полностью можно снять и с ним никаких физических действий не будет производиться и кабель зарядки при этом в глаза не бросается.Т.е. мысль такая - home assistant контролирует зарядку, чтобы она не была постоянно включена (включает если батарея разряжается), экран у планшета включается автоматически командой home assistant если напротив него кто-то стоит и выключается через пару минут если никого нет."
    },
    {
      "id": 26239048,
      "author": "empenoso",
      "datetime": "2023-12-07T04:44:33.000Z",
      "text": "А как экран у планшета включается автоматически командой home assistant если напротив него кто-то стоит?"
    },
    {
      "id": 26239874,
      "author": "Regressor",
      "datetime": "2023-12-07T08:11:43.000Z",
      "text": "Есть browser_mod расширение, да и само приложение для андроида умеет по событию экран включать"
    },
    {
      "id": 26275500,
      "author": "Teemon",
      "datetime": "2023-12-17T14:27:59.000Z",
      "text": "Держите в курсе пожалуйста, очень интересно что получится, так как тема как по мне недостаточно освещена в интернете"
    },
    {
      "id": 26277062,
      "author": "Regressor",
      "datetime": "2023-12-18T04:23:16.000Z",
      "text": "Ну пока все зависло на HA Sip клиенте. Он на js написан. Задача чтобы он инжектился на веб на любой панели и работал постоянно, а при поступлении звонка отрисовывал popup с изображением камеры и кнопками приема/отмены звонка.Что касается аппаратной части, то сам держатель напечатал, буду в него внедрять FC3 зарядку и датчик присутствия - из приходящих проводов будет только питание 12вольт."
    },
    {
      "id": 26275484,
      "author": "Teemon",
      "datetime": "2023-12-17T14:19:16.000Z",
      "text": "Что в качестве оболочки hmi?Не очень понятно чем бы помог вам Ethernet,?..Не видно кабель зарядки - как это реализовано?Думали про беспроводную зарядку?Встречали готовые аккуратные корпуса на магнитах и может чтобы беспроводная зарядка была в корпусе? Самому не охота колхозить"
    },
    {
      "id": 26224608,
      "author": "int0x19",
      "datetime": "2023-12-03T14:31:25.000Z",
      "text": "Есть еще платы Sunton, с esp32 на борту, разных  размеров и поддерживающие Open Hasp, но без корпусаhttps://www.openhasp.com/0.6.3/devices/sunton-screens/"
    },
    {
      "id": 26224708,
      "author": "isden",
      "datetime": "2023-12-03T15:03:20.000Z",
      "text": "Ну так то и железки вроде WT32-SC01 PLUS бывают (там даже половина корпуса уже есть). Но это все тоже колхозинг разной степени тяжести."
    },
    {
      "id": 26228360,
      "author": "isden",
      "datetime": "2023-12-04T12:38:01.000Z",
      "text": "Подскажите плз, эта железка умеет измерять напряжение сети и потребляемую мощность на выходах?"
    },
    {
      "id": 26230538,
      "author": "empenoso",
      "datetime": "2023-12-05T01:40:32.000Z",
      "text": "Именно эта нет"
    },
    {
      "id": 26231324,
      "author": "isden",
      "datetime": "2023-12-05T07:36:55.000Z",
      "text": "Жаль, надеялся что в спеках просто не написали :) Фича логичная, раз уж все равно на сети висим."
    },
    {
      "id": 26233506,
      "author": "fio",
      "datetime": "2023-12-05T16:58:14.000Z",
      "text": "А какую полезную информацию можно получить? Напряжение и частота - это легко измерить, но польза от них только в очень узких применениях.Потребление, как вы писали, измерить можно, но будет это потребление самого контроллера. А это тоже мало кому нужно."
    },
    {
      "id": 26233598,
      "author": "isden",
      "datetime": "2023-12-05T17:26:44.000Z",
      "text": "Напряжение важно. При нестабильности/превышении нужно срочно гасить большинство техники. Такое бывает очень редко, но бывает.Ток не так важен, но тоже может пригодиться - там два сетевых выхода с реле."
    },
    {
      "id": 26234396,
      "author": "Iv38",
      "datetime": "2023-12-05T23:46:15.000Z",
      "text": "Для такой цели лучше использовать автономные реле напряжения в щитке. Если отгорел ноль или электрик подключил вместо нуля вторую фазу, надо действовать максимально быстро, а не надеяться на автоматизации и исполнительные устройства, которые сами могут этого не пережить."
    },
    {
      "id": 26235338,
      "author": "isden",
      "datetime": "2023-12-06T07:37:02.000Z",
      "text": "Так то согласен, но хочется графики и отчеты. А то автомат сработал и что/почему? Плюс может быть какую-то автоматизацию придумать."
    },
    {
      "id": 26235594,
      "author": "fio",
      "datetime": "2023-12-06T08:27:23.000Z",
      "text": "Напряжение (и частота) важно там, где на него можно воздействовать. Например, собственная энергосистема дома. Да и в этом случае за напряжением должен следить специализированный контроллер, который может моментально регулировать/переключать."
    },
    {
      "id": 26235610,
      "author": "isden",
      "datetime": "2023-12-06T08:30:18.000Z",
      "text": "можно воздействоватьВы можете воздействовать через УК, например.Одно дело придти туда \"у меня что-то автомат постоянно срабатывает, сделайте что-нибудь\" и совсем другое \"напряжение сильно скачет, постоянно вырубает автомат, вот графики\"."
    },
    {
      "id": 26236602,
      "author": "Astroscope",
      "datetime": "2023-12-06T11:51:34.000Z",
      "text": "При нестабильности/превышении нужносрочногасить большинство техники.Интересно, сколько, по самому оптимистичному сценарию, займет времени такая цепочка событий: определение превышения напряжения -> выработка соответствующего уведомления -> прием уведомления контроллером и выработка команды -> отправка команды на исполнительное устройство -> отработка команды исполнительным устройством."
    },
    {
      "id": 26236644,
      "author": "isden",
      "datetime": "2023-12-06T11:59:34.000Z",
      "text": "Сам лично не сталкивался. Родственники рассказывали, что у них примерно минуту мигали лампочки (не вкл/выкл, а яркость заметно менялась - лампы накаливания тогда были у них), затем навсегда замолчали холодильник с телевизором. Была какая-то авария на подстанции."
    },
    {
      "id": 26236964,
      "author": "fio",
      "datetime": "2023-12-06T13:12:52.000Z",
      "text": "Есть такой класс устройств -Реле контроля напряжения. Устанавливается в щитке на вводе в дом/квартиру. Защищает от повышенного и пониженного напряжения. Реагирует моментально, включается обратно автоматически после стабилизации напряжения (с небольшой задержкой).Установил такое себе в квартиру и родственникам в дом"
    },
    {
      "id": 26237286,
      "author": "isden",
      "datetime": "2023-12-06T14:26:40.000Z",
      "text": "Есть такой класс устройств -Реле контроля напряжения.Да я в курсе. Но хочется статистики и графиков :)"
    },
    {
      "id": 26238410,
      "author": "vm03",
      "datetime": "2023-12-06T20:13:47.000Z",
      "text": "Есть реле напряжения с wifi, вот например: EM-129, DDS238-2,  eampdw-ty-63"
    },
    {
      "id": 26240564,
      "author": "DMGarikk",
      "datetime": "2023-12-07T10:36:04.000Z",
      "text": "мне кажется лучше стабилизатор поставитьреле контроля напряжение выключает нагрузку, а это очень вредно для многих приборов"
    },
    {
      "id": 26241784,
      "author": "fio",
      "datetime": "2023-12-07T15:21:17.000Z",
      "text": "Стабилизатор - нужная вещь там, где напряжение не стабильно. А вот реле надо всем - как страховка, а не средство регулирования.У меня в квартире (новый дом) вырубало раз-два за год. Технике это точно не навредит."
    },
    {
      "id": 26234394,
      "author": "Iv38",
      "datetime": "2023-12-05T23:41:23.000Z",
      "text": "Ток измеряется на шунте после реле и не включает потребление самого девайса. Зачем он нужен? Помимо банального ответа - чтобы знать потребление - есть и более заковыристые применения. Например так можно узнать состояние нагрузки. Включена ли она, закончила ли основной рабочий цикл. Я, например, использую розетку с энергомониорингом для того чтобы знать, когда стиральная машина закончила стирку и отправить уведомление об этом в телегу."
    },
    {
      "id": 26233588,
      "author": "Astroscope",
      "datetime": "2023-12-05T17:25:01.000Z",
      "text": "Фича логичная, раз уж все равно на сети висим.А ток как мерить? Напряжение и частота да, они одинаковы в любой точке квартиры - и то, если ввод однофазный, что необязательно справедливо для квартир побольше и большинства отдельных домов. Но без тока потребляемую мощность не измерить."
    },
    {
      "id": 26233604,
      "author": "isden",
      "datetime": "2023-12-05T17:30:28.000Z",
      "text": "Снимать напряжение с шунта например? Или с катушки."
    },
    {
      "id": 26236616,
      "author": "Astroscope",
      "datetime": "2023-12-06T11:54:25.000Z",
      "text": "Снимать напряжение с шунта например? Или с катушки.Чисто практически это возможно на щитке или на самом измеряемом приборе - там, где провода выходят на поверхность, а вовсе не там, где установлена панель управления. То есть как функция именно панели управления это было бы практически бесполезно."
    },
    {
      "id": 26236668,
      "author": "isden",
      "datetime": "2023-12-06T12:03:58.000Z",
      "text": "На сабжевой железке есть два силовых выхода с реле если что."
    },
    {
      "id": 26234388,
      "author": "Iv38",
      "datetime": "2023-12-05T23:38:27.000Z",
      "text": "Многие умные розетки и выключатели имеют эту функцию. Так что это вопрос вполне рядовой. Ток в них обычно измеряется шунтом."
    },
    {
      "id": 26234866,
      "author": "fio",
      "datetime": "2023-12-06T05:34:51.000Z",
      "text": "К умным розеткам подключена нагрузка, они измеряют сколько та потребляет.К контроллеру с экраном ничего не подключено. Какое потребление он может изменить? Только свое собственное - пара ватт."
    },
    {
      "id": 26235350,
      "author": "isden",
      "datetime": "2023-12-06T07:39:05.000Z",
      "text": "У сабжевого контроллера есть два силовых выхода с реле."
    },
    {
      "id": 26236688,
      "author": "Astroscope",
      "datetime": "2023-12-06T12:07:51.000Z",
      "text": "У сабжевого контроллера есть два силовых выхода с реле.Которыми практически невозможно воспользоваться поверх завершенного отделочного ремонта. Поэтому, чисто практически, претензия оправдана только если проводка монтируется до (и с учетом) установки сабжа. Нельзя не отметить еще, что максимальная нагрузка у сабжа - 4A, но не более 2A на канал. Это не то, чтобы мало (суммарно менее киловатта в европейской сети), но все же заметно ограничивает возможности непосредственного управления нагрузками - теми относительно мощными, логировать потребление которых интересно в первую очередь. Большинство образцов бытовой техники - почти вся кухня, кондиционер, пылесос, бойлер, кондиционер, обогреватели, вот это все превышает нагрузочные возможности сабжа.Я вовсе не оправдываю отсутствие функции, крайне незначительно усложняющей и удорожающей устройство, но лишь продолжаю пребывать в уверенности совершенно ничтожной практической пользы от ее присутствия именно в данном частном случае."
    },
    {
      "id": 26236758,
      "author": "isden",
      "datetime": "2023-12-06T12:23:41.000Z",
      "text": "Для серьезных нагрузок лучше ставить специальные железки на много ампер. Здесь же можно подключить освещение, например.совершенно ничтожной практической пользы от ее присутствия именно в данном частном случаеВам не нужно, а мне бы пригодилось."
    },
    {
      "id": 26255076,
      "author": "isden",
      "datetime": "2023-12-11T17:24:48.000Z",
      "text": "Привезли сабжевый аппарат. Первые впечатления:экран не очень, могли бы и IPS поставить за такие деньги, а не херовый TN с никакими углами обзоранебольшой засвет в левом нижнем углукнопки громкиекрепление в подрозетник немного сомнительное - на небольших пластиковых защелках с двух сторонДо перепрошивки руки пока не дошли."
    },
    {
      "id": 26272380,
      "author": "SGordon123",
      "datetime": "2023-12-16T08:20:29.000Z",
      "text": "А как узнать смогу ли я с панели управлять посудомойкой MIDEA ?  Вроде она с WIFI, во всяких умнодомах есть. Есть какой то эмулятор на тест?"
    },
    {
      "id": 26274462,
      "author": "empenoso",
      "datetime": "2023-12-17T05:48:19.000Z",
      "text": "У меня холодильник Midea - если поставить соответствующую интеграцию в Home Assistant, то управлять можно."
    },
    {
      "id": 26274460,
      "author": "SergeyN19",
      "datetime": "2023-12-17T05:46:41.000Z",
      "text": "Есть же panel pro, с андроидом и человеческим дисплеем и процом. Тоже шьется"
    },
    {
      "id": 26274464,
      "author": "empenoso",
      "datetime": "2023-12-17T05:48:34.000Z",
      "text": "Выше было про это"
    },
    {
      "id": 26285526,
      "author": "nApoBo3",
      "datetime": "2023-12-20T04:41:32.000Z",
      "text": "А существует ли, что-нибудь подобное, на eink?"
    }
  ]
}