{
  "url": "https://habr.com/ru/articles/783066/comments/",
  "article_id": 783066,
  "title": "Как вернуть себе потерянные (или украденные из-за санкций?) умные функции стиральной машины Bosch",
  "comments": [
    {
      "id": 26333032,
      "author": "aborouhin",
      "datetime": "2024-01-03T00:49:12.000Z",
      "text": "О, бошевская стиралка показывает открытие люка! Это даёт возможность реализовать единственный полезный сценарий интеграции стиралки в умный дом, который я могу придумать :) - напоминания \"эй, ты уже N часов как не вытащил бельё из бака\". У меня \"умная\" стиралка от Samsung, там информации о люке нет, и в итоге эта возможность подключения к сети в ней - самая бесполезная штука на свете."
    },
    {
      "id": 26333258,
      "author": "select26",
      "datetime": "2024-01-03T06:02:08.000Z",
      "text": "Можно установить на крышку люка копеечный магнитный  датчик открытия от системы охранной сигнализации и забыть про все эти проблемы.Автору: необязательно \"выдергивать кабель провайдера\". Достаточно отключить ISP порт в настройках роутера."
    },
    {
      "id": 26334822,
      "author": "serginho",
      "datetime": "2024-01-03T12:57:58.000Z",
      "text": "Одним датчиком точно не обойдется. Откуда он узнает что вы вообще стирали?"
    },
    {
      "id": 26334934,
      "author": "BobArctor",
      "datetime": "2024-01-03T13:29:35.000Z",
      "text": "Флаг в памяти по факту запуска одного из режимов"
    },
    {
      "id": 26334990,
      "author": "iig",
      "datetime": "2024-01-03T13:38:53.000Z",
      "text": "Круто когда у вас есть доступ к памяти стиралки ;)"
    },
    {
      "id": 26335536,
      "author": "romamix",
      "datetime": "2024-01-03T15:56:16.000Z",
      "text": "Можно добавить умную розетку и следить за потреблением электричества. Был всплеск - стирка началась. Упало до нуля (ну или почти до нуля, если какое-то потребление в выключенном режиме есть) - стирка закончена. А дальше следим за магнитным датчиком открытия и назойливо напоминаем раз в ХХ минут, что белье все еще в машине, если люк так и не открывался.Видел такие же решения на основе датчика вибрации. Есть совмещенные датчик вибрации+магнитный, но умная розетка + tuya дачтик с алиэкспресса были в несколько раз дешевле. Опционально и то, и то можно Zigbee, чтобы работало локально."
    },
    {
      "id": 26335574,
      "author": "Antra",
      "datetime": "2024-01-03T16:03:22.000Z",
      "text": "С умными розетками (ну или автоматами c WiFi, что на DIN рейку монтируются) очень просто и удобно. Я так отслеживал (HASS + Grafana) циклы включения газового котла и насоса бойлера для оптимизации.настроек."
    },
    {
      "id": 26335002,
      "author": "aborouhin",
      "datetime": "2024-01-03T13:43:43.000Z",
      "text": "Да это как раз просто, опрашивать датчик двери раз в несколько секунд, а данные о том, что стирка закончилась, брать у стиралки. Если с момента завершения стирки дверь ни разу не побывала в состоянии \"открыто\" - присылать напоминание раз в час. Другой разговор, чтто функция эта мне точно не настолько нужна, чтобы что-то колхозить :)"
    },
    {
      "id": 26347930,
      "author": "dimon3191",
      "datetime": "2024-01-07T09:14:02.000Z",
      "text": "Неужели стиралку так просто опросить закончена программа или ещё нет?"
    },
    {
      "id": 26336490,
      "author": "dmlogv",
      "datetime": "2024-01-03T20:03:31.000Z",
      "text": "Я сделал костыль: воткнул «глупую» стиралку в «умную» розетку, попросил HA сигналить, когда потребляемая мощность падает ниже 0.1 Wh в течение трёх минут (пальцем в небо). Пока не вытащю бельё, не тушу оповещение."
    },
    {
      "id": 27912906,
      "author": "andy_light",
      "datetime": "2025-02-12T12:52:05.000Z",
      "text": "@aborouhinу меня тоже умная стиралка (и сушилка) от Samsung. У них есть приложение SmartThings, там есть все уведомление, в т.ч. что вам и нужно - окончание цикла стирки. Это уведомление появляется как на смартфоне, так и на умных часах. Благодаря этому вы никогда не забудете о том, что стирка/сушка у вас закончилась."
    },
    {
      "id": 26333080,
      "author": "ShadowMaster",
      "datetime": "2024-01-03T02:16:10.000Z",
      "text": "Какими умными функциями обладает умная стиралка? Она способна загрузить белье из корзины, выставить нужную программу, начать стирку ночью, когда электричество дешевле и после перегрузить в сушилку? Загрузить какие-то новые программы стирки? Или что? Пищать когда закончит? А что делает умный чайник? Он способен сам набрать воды, вскипятить воду или заварить чай? Или способен свистеть когда закипит? Так свистят даже старые неэлектрические чайники.Я понимаю пользу от умного климатического оборудования. Не тратить энергию, когда никого нет дома.  Или, например, робот-пылесос может убираться в определенное время, когда никого нет. Я понимаю, например, пользу от умных весов. Она минимальная, но все же есть. Вести статистику измерений.С обычной бытовой техникой что? Вести статистику сколько раз была запущена стирка и в каком режиме? Они неспособны выполнять свои функции без присутствия человека, поэтому их умные функции бесполезны. Чайник не наберет воды, стиралка не загрузит белье (таймер для отложенного запуска в них есть уже много десятков лет), кухонный комбайн, плита или холодильник сами не загрузят в себя продукты, так что реальной пользы от их умных функций нет."
    },
    {
      "id": 26333110,
      "author": "empenoso",
      "datetime": "2024-01-03T03:01:03.000Z",
      "text": "Через фирменное приложение стиралки можно подобрать подходящую программу стирки в зависимости от типа ткани и указать дополнительные опции, особенно если инструкцию к стиралка не читал."
    },
    {
      "id": 26333740,
      "author": "SpiderEkb",
      "datetime": "2024-01-03T07:57:08.000Z",
      "text": "А просто выбрать ручкой на панели это невозможно? Или стиралка сама смотри что в нее загрузили и распознает что там за ткани?Тут правильно было указано выше - все это имеет смысл для тех вещей, которые реально способны сами без вмешательства человек работать по оптимальной программе. Единственное, что приходит на ум - это климатическая техника (отопление-кондиционирование-вентиляция). Ну еще сигнализация нештатных ситуаций (по электропитанию, водоснабжению).А то, что все равно требует вмешательства человека (загрузить-выгрузить белье, налить-заварить чай) - все это просто хайп. Бессмысленный и беспощадный."
    },
    {
      "id": 26335340,
      "author": "RRRomeo",
      "datetime": "2024-01-03T15:08:05.000Z",
      "text": "Просто ручкой - менее удобно, чем в приложении. Я в бойлерной загрузил белье и в приложении «двумчиво» выставил программу стирки и опции.Выбрать на стиральной машинке тоже можно. Но эти сродни тому, что стеклоподъемник в виде «крути весло» - разве плохо стекло поднимает? Хорошо. Но кнопкой удобнее."
    },
    {
      "id": 26335424,
      "author": "iig",
      "datetime": "2024-01-03T15:31:51.000Z",
      "text": "Чем угодно (ручкой, кнопками, трекболом) удобнее чем приложением."
    },
    {
      "id": 26335434,
      "author": "SilverHorse",
      "datetime": "2024-01-03T15:32:32.000Z",
      "text": "Дожили, повернуть крутилку над дверцей, куда ты полсекунды назад запихивал белье, в нужное положение - оказывается, менее удобно, чем достать телефон, открыть в нем приложение, найти в приложении нужную опцию, тыкнуть в экран телефона, и просто потому, что крутилка - не кнопка... И еще сравниваем мясорубку в машине с электроподьемником при этом. Вы бы хоть тег sarcasm ставили, а то непонятно, это стеб или действительно человечество настолько деградирует..."
    },
    {
      "id": 26351686,
      "author": "RRRomeo",
      "datetime": "2024-01-08T09:36:31.000Z",
      "text": "В приложении Miele - всё очень удобно сделано. Мне именно так удобнее: Загрузил стиралку и сушилку, пошел сел в кресло в зале и в приложении (выбрав нужные опции) и запустил стирку и сушку. Почему-то удобнее мне, чем стоять в бойлерной и крутить крутилки и нажимать кнопки. Плюс - в приложении больше опций по стирке / сушке."
    },
    {
      "id": 26335476,
      "author": "Neusser",
      "datetime": "2024-01-03T15:44:05.000Z",
      "text": "Кнопкой удобнее поднимать/опускать стекло потому что нажал пальцем и жди, не надо ручку крутить. А выбирать режим стирки в приложении удобнее потому что... Почему?"
    },
    {
      "id": 26351682,
      "author": "RRRomeo",
      "datetime": "2024-01-08T09:35:40.000Z",
      "text": "У меня схема такая. Загрузил стиралку и сушилку, пошел сел в кресло в зале и в приложении (выбрав нужные опции) и запустил стирку и сушку. Почему-то удобнее мне, чем стоять в бойлерной и крутить крутилки и нажимать кнопки. Плюс - в приложении больше опций по стирке / сушке."
    },
    {
      "id": 26351704,
      "author": "Neusser",
      "datetime": "2024-01-08T09:38:19.000Z",
      "text": "Т.е. вам на панели управления не додали опций, а вы этому еще и радуетесь?Кручение крутилок и нажимание кнопок \"в бойлерной\" занимает секунд 10-20. Достать телефон, открыть приложение и выбрать там нужные опции несомненно значительно быстрее."
    },
    {
      "id": 26351714,
      "author": "RRRomeo",
      "datetime": "2024-01-08T09:40:51.000Z",
      "text": "Может быть додали, не знаю, не вникал. Наверное можно. Просто через приложение действительно удобнее.Плюс - уведомления об окончании стирки / сушки. Это, наверное, тоже неудобно по вашему? )"
    },
    {
      "id": 26351758,
      "author": "Neusser",
      "datetime": "2024-01-08T09:49:13.000Z",
      "text": "Уведомления удобно, наверное. Но не настолько облегчает жизнь, чтобы учитывать эту функцию при выборе машинки. Не могу придумать сценарий, в котором уведомление в телефон об окончании стирки было бы критичным для чего-либо."
    },
    {
      "id": 26351776,
      "author": "RRRomeo",
      "datetime": "2024-01-08T09:53:06.000Z",
      "text": "Почему критерий для выбора? Я просто выбрал машинку / сушилку и там оказалось приложение для управления. Оказалось удобно. Пользуюсь."
    },
    {
      "id": 26347868,
      "author": "Xha",
      "datetime": "2024-01-07T09:13:01.000Z",
      "text": "А если невозможно?У меня стиралка LG, я на ней ручками могу выбрать штук пять режимов, остальное только с телефона. Даже банальный отжим без стирки или слив воды включить нельзя, пока с бубном не станцуешь и телефон не приконнектишь.И бошевская посудомойка, чьё приложение тоже весной 22-го отвалилось. Вот я прекрасно могу обойтись без напоминаний купить таблетки, но отложенный запуск программы - это очень полезная в хозяйстве функция, экономит деньги. Почему нельзя было организовать её включение с панели - загадка: кнопки есть, экранчик тоже."
    },
    {
      "id": 26356026,
      "author": "svk28",
      "datetime": "2024-01-09T09:15:01.000Z",
      "text": "А зачем такое покупать?"
    },
    {
      "id": 26423152,
      "author": "imintsev",
      "datetime": "2024-01-25T18:49:49.000Z",
      "text": "Дополню ещё пунк светОтопление/кондиционирование/вентиляция/освещение.А, ещё мониторинг энергопотребления. И управление включением/отключением бытовой техники через умные розетки.Ещё управление шторами/жалюзями.Но вот управление стиралкамм, чайником и кофнмашиной точно лишнее. По крайней мере без автоматизации загрузки белья и заливки воды."
    },
    {
      "id": 26333776,
      "author": "Neusser",
      "datetime": "2024-01-03T08:07:25.000Z",
      "text": "Такое приложение существует уже лет 40 на каждой машинке и не требует интернета и даже смартфона. Выглядит примерно вот так:"
    },
    {
      "id": 26333966,
      "author": "MountainGoat",
      "datetime": "2024-01-03T08:53:37.000Z",
      "text": "Причём если сравнить надписи на переведённой панели и оригинальной, то часто окажется, что половина из них расставлена от балды.У меня \"Мультиварка. Режимы: суп, каша, варенье\".В оригинале: \"Rice cooker: white rice,red rice, black rice\""
    },
    {
      "id": 26347856,
      "author": "dvd78",
      "datetime": "2024-01-07T09:12:32.000Z",
      "text": "Изначально мультиварки были рисоварками, потом их адаптировали в меру своих возможностей, в Юго-восточной Азии много их видел все под рис заточены, про супы и плов ни слова."
    },
    {
      "id": 26335344,
      "author": "RRRomeo",
      "datetime": "2024-01-03T15:09:40.000Z",
      "text": "А это приложение - присылает уведомления на телефон?"
    },
    {
      "id": 26351730,
      "author": "RRRomeo",
      "datetime": "2024-01-08T09:42:26.000Z",
      "text": "Да, присылает. Что стирка или сушка окончена. Или что заканчивается или кончилось средство стиральное."
    },
    {
      "id": 26335420,
      "author": "aamonster",
      "datetime": "2024-01-03T15:30:38.000Z",
      "text": "К нему катастрофически не хватает расшифровки программ."
    },
    {
      "id": 26336244,
      "author": "nixtonixto",
      "datetime": "2024-01-03T18:53:50.000Z",
      "text": "Уже спустя пару месяцев пользования запомните все режимы и их особенности, а через год сможете выбрать нужный режим наощупь, даже не включая свет в помещении."
    },
    {
      "id": 26336282,
      "author": "aamonster",
      "datetime": "2024-01-03T19:02:39.000Z",
      "text": "Фиг там был. Уже не одна стиральная машина прошла через мои руки, но я до сих пор не знаю, чем режим \"шерсть\" отличается от \"синтетика\", что делает режим \"пропитка\" или режим \"Mix\", которым я в итоге и пользуюсь на нынешней стиралке (ну, ещё режимом 15' иногда, он единственный понятный).Мне в числах надо, а не \"мы вот тут подумали и решили, что у нас будет отдельный режим для тёплого клетчатого пледа\"."
    },
    {
      "id": 26337648,
      "author": "Borz",
      "datetime": "2024-01-04T08:34:15.000Z",
      "text": "ничем особо эти режимы не отличаются... ну, кроме маркетинга"
    },
    {
      "id": 26337780,
      "author": "Neusser",
      "datetime": "2024-01-04T09:27:40.000Z",
      "text": "\"Шерсть\" отличается от всех режимов даже на глаз - там барабан туда-сюда покачивается, изредка делая примерно треть или половину оборота. И скорость отжима низкая. У всех остальных тоже разные температура и скорость отжима. На моей стиралке это видно."
    },
    {
      "id": 26337818,
      "author": "aamonster",
      "datetime": "2024-01-04T09:40:28.000Z",
      "text": "Температуру и скорость отжима можно задать отдельно, а вот это \"покачивается\" я никогда не замечал (не приходило в голову сидеть возле стиралки и смотреть), спасибо. Хотел бы я, чтобы такие вещи описывались в инструкции."
    },
    {
      "id": 26337844,
      "author": "Neusser",
      "datetime": "2024-01-04T09:47:16.000Z",
      "text": "У меня стиралка в кухне, поэтому видно.Да, все можно задать отдельно, но это во-первых, надо задать, во-вторых, знать что именно задать. А так выставил \"джинсы\" или \"хлопок\" и не готово (отличаются температурой и скоростью отжима). Но описание в инструкции не помешало бы, согласен."
    },
    {
      "id": 26337858,
      "author": "aamonster",
      "datetime": "2024-01-04T09:52:03.000Z",
      "text": "Я ничего не имею против пресетов, но хотелось бы знать, что они делают.Впрочем, стиралка в этом плане ещё ничего. Вот фотоаппарат с отдельными режимами \"белая кошка\", \"рыжая кошка\", \"чёрная кошка\", \"белая собака\", \"чёрная собака\" – это была жесть (Pentax Optio WP, если я правильно помню). Впрочем, наличие режимов приоритета выдержки и диафрагмы + экспокоррекция позволяло не выяснять, что они значат."
    },
    {
      "id": 26355646,
      "author": "NemoVors",
      "datetime": "2024-01-09T08:02:28.000Z",
      "text": "причем регулярно используются как правило 2-3 функции из всего вороха :) . У меня так и вовсе одна."
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 26347948,
      "author": "viroff",
      "datetime": "2024-01-07T09:14:18.000Z",
      "text": "Мне кажется, тут всё намного проще. При помощи своей \"умности\" стиралка докладывает сколько и как вы ею пользуетесь, дабы, воспользовавшись этой статистикой, производитель мог удешевить или упростить тот или иной узел. Вера в то, что вся эта \"умность\" навернута, чтобы помочь пользователю, пропала, когда увидел за что стиралку назвали умной. Ради эксперимента, если не сложно, поснифайте что она отправляет \"туда\" - очень интересно прав ли мой внутренний параноик."
    },
    {
      "id": 26333112,
      "author": "empenoso",
      "datetime": "2024-01-03T03:02:13.000Z",
      "text": "А чайник можно вписать в правила - при открытии входной двери подогревать воду до нужной температуры - потом приходишь и не надо ждать."
    },
    {
      "id": 26333166,
      "author": "ShadowMaster",
      "datetime": "2024-01-03T04:05:35.000Z",
      "text": "А вода в нем будет? А если пришел не я, а кто-то еще, точно нужно воду греть? Чайник 2 минуты греет, точно нужна вся эта автоматизация? Чай пить  я сажусь не сразу после того как домой приду, да еще и не каждый раз."
    },
    {
      "id": 26333676,
      "author": "sof07",
      "datetime": "2024-01-03T07:41:31.000Z",
      "text": "Скорее игрушка и лишний раз жопу полезно поднять, но пока у меня чайник от вайфай не отвалился, ближе к концу трапезы часто просил Алису включить чайник, удобно."
    },
    {
      "id": 26333690,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T07:44:50.000Z",
      "text": "Купите термопот или \"чайник\" с проточным водонагревателем. Там ждать ничего не надо."
    },
    {
      "id": 26333274,
      "author": "RRRomeo",
      "datetime": "2024-01-03T06:09:18.000Z",
      "text": "На КАЖДОЕ открытие двери? Звучит сомнительно) Никуда не ходите кроме работы?Когда живешь в доме такая автоматизация не катит. ) Дверь открываешь часто, для выхода на участок.Кстати, какой чайник так умеет и где ему ставятся автоматизации на кипячение при открытие двери? Это какой-то русский чайник с из рязряда редмоед / полярис с поддержкой Алисы? Там можно выставлять включение по сценарию?Кстати, сценарий через датчик открытия, не через умный замок?"
    },
    {
      "id": 26333682,
      "author": "empenoso",
      "datetime": "2024-01-03T07:41:55.000Z",
      "text": "В статье есть ссылка"
    },
    {
      "id": 26335348,
      "author": "RRRomeo",
      "datetime": "2024-01-03T15:10:19.000Z",
      "text": "А эти ответ на какой вопрос?)Я несколько задал )"
    },
    {
      "id": 26333768,
      "author": "saboteur_kiev",
      "datetime": "2024-01-03T08:05:24.000Z",
      "text": "А чайник можно вписать в правила - при открытии входной двери  подогревать воду до нужной температуры - потом приходишь и не надо  ждать.Купите термопот. А если пить чай 2-3 раза в день кружкой 320+ мл, то это еще и по электричеству выгоднее будет"
    },
    {
      "id": 26333812,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T08:16:28.000Z",
      "text": "На счёт выгоды это, как минимум, не всегда правда. Я замерял потреблённую энергию термопотом и обычным чайником в течении недели. У меня получилось, что термопот потребляет раза в два-три больше чайника. При этом, я особо не экономил с чайником, т.е. заливал чайник полностью, а не чётко на одну-две чашки. Ну и с термопотом не экономил — например, не выключал его на ночь. Возможно, с другим термопотом показатели были бы лучше, т.к. у меня он без какой-либо теплоизоляции. Но если не лить полный классический чайник, то термопот вряд ли станет энергоэффективнее. В этом плане выигрывает \"чайник\" с проточным нагревателем. Но экономия там, если считать по деньгам, считанные рубли в месяц. Т.е. вряд ли он окупится по сравнению с чайником за 1000 рублей."
    },
    {
      "id": 26334086,
      "author": "metric_ghost",
      "datetime": "2024-01-03T09:17:25.000Z",
      "text": "Вроде идея термопота - поддержание температуры плюс термоизоляция. Так-то и чайники такие есть, но они по сути комнату обогревают. Мой старый термопот потреблял ~90 Вт*ч в режиме поддержания, новый скорее всего меньше, не проверял. Но перекипячение литра воды всякий раз, как захочется выпить чаю, вряд ли может быть экономнее."
    },
    {
      "id": 26334134,
      "author": "Dolios",
      "datetime": "2024-01-03T09:28:51.000Z",
      "text": "А зачем каждый раз кипятить литр?"
    },
    {
      "id": 26334144,
      "author": "metric_ghost",
      "datetime": "2024-01-03T09:30:12.000Z",
      "text": "У меня большая чашка, 0.6 примерно, поэтому меньше литра не вижу смысла наливать."
    },
    {
      "id": 26334138,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T09:29:14.000Z",
      "text": "Вы разбирали этот термопот? Я свой Панасоник разбирал. А ещё разбирал привезённый из Японии Тошиба. В обоих вся \"теплоизоляция\" — это воздушный зазор между баком с водой и пластиковым внешним корпусом."
    },
    {
      "id": 26334156,
      "author": "metric_ghost",
      "datetime": "2024-01-03T09:31:59.000Z",
      "text": "Нет, но даже такая термоизоляция лучше, чем пластиковый или металлический корпус чайника. Как минимум я легко могу трогать корпус термопота руками при поддержании температуры 75 градусов внутри. С чайником так не получается."
    },
    {
      "id": 26334178,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T09:36:06.000Z",
      "text": "Так я и не говорю, что чайник с поддержанием температуры — это тоже самое, что и термопот. Я лишь указал, что теплоизоляция термопота оставляет желать лучшего, и это приводит к перерасходу электричества по сравнению с классическим чайником (без поддержания температуры)."
    },
    {
      "id": 26334756,
      "author": "Wolf4D",
      "datetime": "2024-01-03T12:40:07.000Z",
      "text": "Я в своё время по причине регулярных ожогов и купил чайник в пластиковом корпусе с внутренней металлической колбой. Штука чудесная - термопотом он не числится, но корпус даже в моменты кипения не обжигает рук от малейшего касания."
    },
    {
      "id": 26335706,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T16:42:57.000Z",
      "text": "Наверное, открою вам страшную вселенскую тайну, но человек не умеет тактильно определять температуру. Он может определить только скорость передачи тепла. А скорость сильно зависит от теплопроводности материала. Потому, даже просто пластиковый чайник обжигает гораздо меньше, чем металлический. А уж если он с двойной стенкой и внешняя из пластика, то да, ожогов будет крайне сложно добиться."
    },
    {
      "id": 26337736,
      "author": "Wolf4D",
      "datetime": "2024-01-04T09:09:55.000Z",
      "text": "Точно также, как и весы не умеют определять массу предмета - только силу реакции опоры :)Но мысль я уловил - мол, раз теплопроводность низкая, то и теплопотери должны быть низки.Возражаю - не любой предмет, который не обжигает руки, не является хорошо теплоизолированным. Потери тепла могут идти через другие места. А теплопроводность может быть достаточно невысокой, чтобы пластик не успевал прогреться до условных 70 градусов (порог мгновенной болевой реакции) за время остывания воды.Но вообще я говорил о том, что покупал мой чайник именно как чайник, а не термопот"
    },
    {
      "id": 26334168,
      "author": "metric_ghost",
      "datetime": "2024-01-03T09:34:30.000Z",
      "text": "И ещё момент, натурный эксперимент, так сказать - при отключении электричества тп держит воду достаточно горячей пару часов точно, чайник так не умеет."
    },
    {
      "id": 26334184,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T09:40:20.000Z",
      "text": "Да, но чайник вы кипятите, условно, три раза в день, а термопот греет комнату круглосуточно независимо от количества воды в нём."
    },
    {
      "id": 26336588,
      "author": "metric_ghost",
      "datetime": "2024-01-03T20:34:39.000Z",
      "text": "Нет, для себя три-четыре, но есть ещё и домочадцы."
    },
    {
      "id": 26334540,
      "author": "saboteur_kiev",
      "datetime": "2024-01-03T11:44:16.000Z",
      "text": "В обоих вся \"теплоизоляция\" — это воздушный зазор между баком с водой и пластиковым внешним корпусом.Воздух плохо проводит тепло, разреженный воздух еще хуже проводит тепло, вакуум практически не проводит тепло, многие термосы собственно вакуумные. Вопрос в том, насколько хорошо соблюдается разреженность. Надо было не разбирать а провести эксперименты..."
    },
    {
      "id": 26335624,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T16:18:05.000Z",
      "text": "Вы выше почитайте мои комментарии, я указывал, что при моём шаблоне использования термопот в два-три раза больше нажигает энергии, чем чайник. При этом, с чайником можно ещё раза в два, а то и больше, снизить потребление, если каждый раз наливать ровно необходимый объём воды, а не полный чайник."
    },
    {
      "id": 26335460,
      "author": "aamonster",
      "datetime": "2024-01-03T15:40:21.000Z",
      "text": "Вы имели в виду 90 Вт?Вскипятить литр воды – примерно 100 Вт*ч, так что легко оценить, когда термопот выгоднее. Когда вы 0.9 литра в час кипятите и не выпиваете. Ну там, каждый час ставите 2/3 чайника и выпиваете одну чашку, например.ЗЫ: Нагуглил по какому-то термопоту – \"на поддержание необходимо 30 ватт\" – это уже заметно интереснее вашего, раз в три часа чайник наверняка ставится, и вряд ли воды в нём ровно столько, сколько надо."
    },
    {
      "id": 26335642,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T16:22:31.000Z",
      "text": "Раз в три часа сомнительно. Ночами я сплю, а по будням могу пить чай на работе."
    },
    {
      "id": 26335686,
      "author": "aamonster",
      "datetime": "2024-01-03T16:35:21.000Z",
      "text": "Ну, когда вы на работе – вам и включённый термопот не нужен. Можно настроить его работу по расписанию (правда, придётся приплюсовать затраты на начальный разогрев дважды в сутки).Но по мне 30 Вт выглядят как раз неким пограничным случаем, когда для кого-то выгодней чайник, а для кого-то термопот."
    },
    {
      "id": 26335786,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T16:53:52.000Z",
      "text": "И ночью не нужен. Но в итоге мы приходим к классическому чайнику. Только у термопота зачастую ТЭН небольшой мощности, вот у моего 700 или 750 Вт, а потому разогрев с нуля занимает больше времени, чем разогреть обычный чайник.В общем, если речь за экономию, то термопот всегда будет проигрывать чайнику, в который наливают ровно необходимое количество воды. Потому, термопот это больше про удобство и для мест, где слабая электропроводка, куда обычный чайник не включишь.Если же хочется и экономить и всегда иметь под рукой кипяток, то хорошим решением кажется \"чайник\" с проточным нагревателем. Там и ждать не надо, и греет ровно необходимое количество воды."
    },
    {
      "id": 26337922,
      "author": "aamonster",
      "datetime": "2024-01-04T10:07:00.000Z",
      "text": "В общем, укрепился в мысли, что лично мне больше подходит чайник :-)Проточник – если только с кнопками для задания определённого объёма воды, а то стоять с чашкой, пока он неторопливо наливает – раздражает."
    },
    {
      "id": 26334536,
      "author": "saboteur_kiev",
      "datetime": "2024-01-03T11:42:53.000Z",
      "text": "Возможно, с другим термопотом показатели были бы лучше, т.к. у меня он без какой-либо теплоизоляции.Это полный нонсенс. Тогда это не термопот, ибо нормальный термопот как раз должен быть с хорошей теплоизоляцией. Не такой как у бойлера, но достаточной, чтобы держать 80-90 градусов несколько часов.Когда малой дорос до прикорма, и надо было ему кашу делать несколько раз в день, термопот оказался не только реально удобным, но и по замерам раза в полтора-два выгоднее (у меня есть отдельная розетка, которая умеет замерять в моменте и кумулятивно)"
    },
    {
      "id": 26334554,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T11:46:58.000Z",
      "text": "Ну, 90 градусов даже бытовой сосуд Дюара несколько часов не продержит. Ну и я же не утверждаю, что все термопоты такие, как у меня. Но вот два разбирал, и оба без каких-то дополнительных утеплителей. Сам удивился."
    },
    {
      "id": 28097878,
      "author": "AlxVII",
      "datetime": "2025-03-27T11:56:29.000Z",
      "text": "Я никогда не понимал, почему будет выгоднее с термопотом. Вроде как вскипятить три раза в день 300 мл должно быть экономичнее, чем держать горячим целый день 900, потом 600, потом 300 мл."
    },
    {
      "id": 26333118,
      "author": "empenoso",
      "datetime": "2024-01-03T03:05:36.000Z",
      "text": "А умные весы кстати и не вписать особо в Home Assistant: у меня ловятся соседские Mi Body Composition Scale (D89B): там разные весы всегда - если нет соотношения с конкретным пользователем, то интеграция совершенно бесполезна"
    },
    {
      "id": 26333134,
      "author": "Radisto",
      "datetime": "2024-01-03T03:23:02.000Z",
      "text": "Можно поздравлять соседку с тем, что она похудела тогда, когда она действительно похудела, и она будет думать, что вы и в самом деле это заметили, а не дежурная вежливость. Кажется, \"умная вещь\" - это вещь, при помощи которой за вами могут следить неизвестные вам люди. Хотя мне лично такой ум не нравится. Пусть лучше тупыми будут"
    },
    {
      "id": 26335052,
      "author": "MxMaks",
      "datetime": "2024-01-03T13:55:09.000Z",
      "text": "Соседка ответит:- а я, что раньше толстая была ????"
    },
    {
      "id": 26335254,
      "author": "Antra",
      "datetime": "2024-01-03T14:47:14.000Z",
      "text": "А начнешь отмазываться про \"объективные показатели\", так еще потом у мужа с пристрастием поинтересуется, кто это взешивался."
    },
    {
      "id": 26333530,
      "author": "rdo",
      "datetime": "2024-01-03T06:52:50.000Z",
      "text": "Когда на умных весах превышение веса над вчерашним, умный холодильник запирает дверцу на 24 часа?"
    },
    {
      "id": 26333548,
      "author": "AlexSpirit",
      "datetime": "2024-01-03T06:59:03.000Z",
      "text": "И блокирует платежи с банковских карт в сторону сервисов доставки еды."
    },
    {
      "id": null,
      "author": "kAIST",
      "datetime": "2024-01-03T08:36:45.000Z",
      "text": "Да умные веси и так понимают кто на них стоит, если пользователи с разным весом (в большинстве случаев так)."
    },
    {
      "id": 26333876,
      "author": "kAIST",
      "datetime": "2024-01-03T08:36:45.000Z",
      "text": "Да умные веси и так понимают кто на них стоит, если пользователи с разным весом (в большинстве случаев так)."
    },
    {
      "id": 26333206,
      "author": "ndrwK",
      "datetime": "2024-01-03T04:55:29.000Z",
      "text": "Например, умная посудомойка Бош может считать таблетки при каждом запуске, и отправлять уведомления, что они заканчиваются. Это единственная полезная функция. Поэтому, когда перестала работать, я выключил на ней вайфай, и забыл про это."
    },
    {
      "id": 26333260,
      "author": "RRRomeo",
      "datetime": "2024-01-03T06:02:25.000Z",
      "text": "А таблетки разве не перед каждой стиркой вставлять надо?"
    },
    {
      "id": 26333276,
      "author": "cofein51",
      "datetime": "2024-01-03T06:10:20.000Z",
      "text": "Осмелюсь предположить, что там типа счётчика.Указал что у тебя упаковка на 80шт, и она их считает в минус.Не знаю как сейчас, раньше была машинка от хотпоинт/Аристон, туда вливал пару литров геля и кондиционер, а она сама решала сколько и чего добавлять в процессе стирки . чисто для холостяков )))"
    },
    {
      "id": 26333284,
      "author": "RRRomeo",
      "datetime": "2024-01-03T06:18:34.000Z",
      "text": "А, она считает сколько таблеток осталось в коробке!) Понял )"
    },
    {
      "id": 26333294,
      "author": "rapidstream",
      "datetime": "2024-01-03T06:29:39.000Z",
      "text": "Но ведь я же вижу сколько осталось таблеток, каждый раз, когда достаю новую из коробки..."
    },
    {
      "id": 26333600,
      "author": "RRRomeo",
      "datetime": "2024-01-03T07:16:44.000Z",
      "text": "Блин, ну тоже да )"
    },
    {
      "id": 26333626,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T07:28:00.000Z",
      "text": "Имеет смысл, когда посудомойку заряжает один, а в магазин ходит другой. Или когда реализуют механизм, что при подходе к магазину на телефон прилетает список покупок, вот в этот список можно автоматически добавлять таблетки."
    },
    {
      "id": 26333630,
      "author": "rapidstream",
      "datetime": "2024-01-03T07:31:41.000Z",
      "text": "Для того чтобы это работало необходимо автоматизировать: стиралку, посудомойку, холодильник, э-э-э держатель для туалетной бумаги и ящик где она хранится, измеритель уровня перца и соли и масла для жарки, и многое другое. Что в общем случае будет дорогой, хрупкой и ненадёжной системой. На мой взгляд это пере-автоматизация."
    },
    {
      "id": 26333668,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T07:40:08.000Z",
      "text": "\"Ты чей друг — мой или медведя?\" ©Старый анекдотЯ то тоже понимаю, что это притянуто, но в целом, почему бы и нет. Правда, для этого не нужна умная посудомойка, достаточно воткнуть её через умную розетку (с измерителем мощности) и считать количество моек. Я так поступил с глупой стиралкой и настроил себе уведомление, что стирка закончилась. Не сказать, что дико нужная вещь, но позволяет иногда не забыть бельё в машинке на целый день."
    },
    {
      "id": 26337672,
      "author": "Borz",
      "datetime": "2024-01-04T08:44:39.000Z",
      "text": "когда посудомойку заряжает один, а в магазин ходит другой.делаешь общий список покупок - кто первый зашёл в магазин, тот и покупает. А ещё можно через online-маркеты в пункты доставки заказывать - один заказал, а другой забрал"
    },
    {
      "id": 26337722,
      "author": "kvazimoda24",
      "datetime": "2024-01-04T09:02:54.000Z",
      "text": "А можно автоматически заказывать таблетки, чтобы они просто появлялись на пороге вашего дома.Не понимаю, о чём спор. Ниже же написал, что притянуто и, мягко говоря, не сильно нужно. Но в целом кейс более-менее правдоподобный. Особенно, если человек не такой дисциплинированный, чтобы сразу вносить что-то в список покупок, не такой внимательный, чтобы замечать, сколько там осталось таблеток и не с такой памятью, чтобы помнить об этом.У меня вот супруга, как садится заказ продуктов оформлять, начинает бегать по квартире, смотреть, где чего сколько осталось. И всячески отбрыкивается от списка покупок. Т.е. люди разные, и удобны им разные схемы."
    },
    {
      "id": 26333680,
      "author": "ogost",
      "datetime": "2024-01-03T07:41:47.000Z",
      "text": "Осмелюсь предположить, что там типа счётчика.Указал что у тебя упаковка на 80шт, и она их считает в минус.Но зачем ей для этого интернет?"
    },
    {
      "id": 26333256,
      "author": "RRRomeo",
      "datetime": "2024-01-03T06:01:34.000Z",
      "text": "Главное удобство стиральной и сушильной машинки с приложением это, на мой взгляд, уведомления об окончании стирки / сушки / необходимости запуска программы очистки и о том, что закончилось средство для стирки (в Miele есть возможность не сыпать / лить порошок каждый раз) и выставление программ и опций стирки.Причем удобно выставлять в программу и опции только в стиралке и сушилке. В посудомойке, почему-то, не пользуюсь. Просто ставлю авто на крышке перед запуском. Ну может только посмотреть сколько осталось power disk (картридж с средством) и опять-же уведомления, что ополаскивать закончился.Духовка Neff с приложением - это снова уведомления и (наверное) загрузка из интернета новых рецептов для «авто повара»Уведомление от холодильника, что дверь не закрыл  - полезно в целом.Самое удобное - это кофемашина. Вот там реально единственнное умное было, это «Алиса, включи кофемашину». И пока спускаешься со второго на первый - кофемашина промывается при включении.Правда не знаю, работают ли это сейчас (с Алисой), приложение удалил случайно, а его из Апстора убрали. А через костыли лень ставить.Значит - не особо нужно было :)Но с приложением Miele заморочился бы, если бы случайно удалил.В целом, «умные» стиральные/сушильные/посудомоечные машинки это не про автоматизации, а про удобство управления."
    },
    {
      "id": 26333692,
      "author": "denzill",
      "datetime": "2024-01-03T07:46:35.000Z",
      "text": "мой старый-старый холодильник \"атлант\" вполне себе пищит, если дверь не закрыта, при этом никаких \"умных\" функций в нем нет."
    },
    {
      "id": 26335326,
      "author": "RRRomeo",
      "datetime": "2024-01-03T15:02:31.000Z",
      "text": "А присылает уведомление на телефон?Речь про это."
    },
    {
      "id": 26335458,
      "author": "iig",
      "datetime": "2024-01-03T15:40:15.000Z",
      "text": "Обычно этот писк и так слышно. Дверку открывает человек, который вот он на кухне. Причем возможно он пришел без телефона ;)"
    },
    {
      "id": 26337990,
      "author": "denzill",
      "datetime": "2024-01-04T10:29:38.000Z",
      "text": "Опередил :)И да, орет так громко, что в любой комнате слышно"
    },
    {
      "id": 26351692,
      "author": "RRRomeo",
      "datetime": "2024-01-08T09:37:18.000Z",
      "text": "Приложение не отменяет писк, если что )"
    },
    {
      "id": 26351700,
      "author": "RRRomeo",
      "datetime": "2024-01-08T09:38:09.000Z",
      "text": "у меня большой дом, на втором этаже не слышно. Тёща когда в гостях. бывало забывала закрыть. Мне приходит уведомление - звони говорю закрыть, если я не дома )"
    },
    {
      "id": 26333306,
      "author": "Polsok1",
      "datetime": "2024-01-03T06:33:38.000Z",
      "text": "Холодильник может смотреть по остаткам и заказывать еду"
    },
    {
      "id": 26333588,
      "author": "urvanov",
      "datetime": "2024-01-03T07:11:46.000Z",
      "text": "начать стирку ночьювау-вау, полегче. Тут люди спят"
    },
    {
      "id": 26334688,
      "author": "Doman",
      "datetime": "2024-01-03T12:21:05.000Z",
      "text": "Польза есть. Стиралка сообщает сушилке вес белья (определяет сама) и тип (берет из выбранной программы), поэтому на сушилке достаточно нажать только кнопку \"Старт\"."
    },
    {
      "id": 26342452,
      "author": "korolevdd",
      "datetime": "2024-01-05T15:56:22.000Z",
      "text": "По поводу чайника, у нас например правило в доме, налил чай, долей воду, пустым на платформу не ставить. Удобно Алисе сказать утром про чайник и пока умываешься, он закипит."
    },
    {
      "id": 26343754,
      "author": "slim8020",
      "datetime": "2024-01-06T01:52:57.000Z",
      "text": "Для стиральных машин с дозатором в приложениии можно задавать объем моющего средства и кондиционера на стандартную стирку, подгружать нестандартные программы, которых нет на основном колесе. А так, \"умное\" тут, конечно не причем, скорее приложение - расширеный UI и дистанционное управление.Насчет чайника, есть модель TeaMaker продантся под марками Sage/Breville/Bork, разный чай может заввривать по разному (корзина с листьями опускается и выдерживается от 1 до 10 минут) + таймер ко скольки приготовить чай. Воду и листья, конечно же, нужно самостоятельно наливать и насыпать, так де как и мыть.Это про реальную пользу, а не в оправдание \"умности\"."
    },
    {
      "id": 26344358,
      "author": "DarkTiger",
      "datetime": "2024-01-06T09:51:16.000Z",
      "text": "Это все детские игрушки. Хороший чайник для чая в Гонконге стоит около $10K, нам как-то владелец фирмы, что нас забирал в аэропорту, все это полчаса расписывал, счастливый по уши от его приобретения (очередь его подошла, наконец)."
    },
    {
      "id": 26333146,
      "author": "Flux",
      "datetime": "2024-01-03T03:45:23.000Z",
      "text": "У вас в опросе не хватает третьего (правильного) пункта - продать уже тупую стиралку, потерять немного денег но после этого купить стиралку от нормальной компании не замеченной в подобной дичи и больше никогда в жизни ни копейки не потратить ни на бош, ни на сименс."
    },
    {
      "id": 26333174,
      "author": "ShadowMaster",
      "datetime": "2024-01-03T04:14:36.000Z",
      "text": "Сегодня не замечена, завтра может быть будет замечена."
    },
    {
      "id": 26333202,
      "author": "NikaLapka",
      "datetime": "2024-01-03T04:49:56.000Z",
      "text": "При варианте \"пользоваться бош, сименс, лж, самсунг, но без умных функций\" или \"пользоваться канди, беко, индезит,..\", простите великодушно, но я выберу первый."
    },
    {
      "id": 26333270,
      "author": "select26",
      "datetime": "2024-01-03T06:07:59.000Z",
      "text": "Ну уж нет. Один раз нагадили - смогут и ещё. И не факт, что им для этого необходим доступ к интернет.Посчитают, например, число стирок и устроят \"запланированный износ\".Мне стирка нужна в первую очередь, а не \"умные функции\". Я, пока ещё, сам соображаю как белье стирать."
    },
    {
      "id": 26333832,
      "author": "randomsimplenumber",
      "datetime": "2024-01-03T08:25:54.000Z",
      "text": "Посчитают, например, число стирок и устроят \"запланированный износ\".Для этого не нужно быть Bosh. В мозгах любой машинки хватит места для счетчика."
    },
    {
      "id": 26334154,
      "author": "select26",
      "datetime": "2024-01-03T09:31:56.000Z",
      "text": "В мозгах любой машинки хватит местаЭто верно. Но не у всех производителей хватает мозгов понять что такие фокусы отвергнут покупателей навсегда."
    },
    {
      "id": 26334424,
      "author": "iig",
      "datetime": "2024-01-03T11:06:52.000Z",
      "text": "Неразборный бак, несьемные подшипники, незаменяемые щетки.. Можно конденсатор спрятать под радиатор процессора - постоянный нагрев уменьшит срок службы, радиатор помешает просто взять и заменить, например так ;)"
    },
    {
      "id": 26334628,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T12:07:37.000Z",
      "text": "Неразборный бак — это удешевление производства, т.к. запаять бак быстрее, надёжнее и дешевле, чем крутить десяток винтов. При этом, у моей машинки хоть бак и запаян, на нём есть места под саморезы.Подшипники несъёмные — обычно вся несъёмность, это запаяный бак. Ну и справедливости ради, было у меня три машинки, четвёртая сейчас трудится. Ни у одной не помирали подшипники. Есть подозрение, что что-то пользователи делают не так, что у них подшипники дохнут. Например, сыпят много порошка, он не выполаскивается, откладывается на внутренностях бака, в том числе на оси, из-за этого портится сальник. А дальше вода, коррозия, привет подшипники. Но повторюсь, это чистой воды теория. Скорее всего, я не прав.Щётки же — сейчас более-менее современные машинки используют безщёточные моторы. Да и щётки служат по 15-20 лет если это не прачечная из бытовых машинок."
    },
    {
      "id": 26334800,
      "author": "iig",
      "datetime": "2024-01-03T12:51:37.000Z",
      "text": "У производителя 100500 способов сделать ремонт нерентабельным. Бак пилить худо-бедно научились - и то потому, что производитель этому никак не препятствовал. Сделать линию сварки бака не прямой а ломаной - и все, обратно склеить удастся не каждому. Можно еще обновлять модельный ряд каждые 3 года. Как раз, когда захочется заменить какой-то узел, окажется, что оно уже out of stock, купить можно, но дорого."
    },
    {
      "id": 26335682,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T16:33:24.000Z",
      "text": "Да он и так нерентабельный. Я работал в сфере ремонта бытовой техники. Мозговитый специалист там задерживаться не будет. А отсюда сомнительное качество ремонта. Либо сам ремонт на столько дорогой, что пользователь просто выкинет устройство и купит новое. Вот для примера, у меня посудомойка, отслужила 6,5 лет, и в ней сдох насос, который собственно и моет посуду. Новый стоит половину стоимости машинки. Если бы я не самостоятельно его менял, то приплюсуем сюда два выезда мастера, плюс работа этого мастера, плюс кто-то должен быть дома, т.е. это либо выходной, а значит мастер дороже возьмёт, либо мне или супруге надо отпроситься с работы в будний день. В сумме это даст две трети стоимости машинки.При этом, т.к. я делал для себя, я сразу же купил и заменил дренажный насос, т.к. он стал чуть громче работать, стоит недорого, а повторно разбирать всю машинку и ездить за насосом лень. Наёмный же мастер, скорее всего, сливной насос не предложил бы менять, т.к. чуть громче работает - он так может и год и два проработать.Исходя из всего выше сказанного, что-то ремонтировать имеет смысл только если устройство, хотя бы, среднее по цене. А у нас большинство берёт самое дешёвое. А потом жалуется, что ремонт дороже нового стоит. Но вы можете дальше верить в заговор производителей."
    },
    {
      "id": 26336590,
      "author": "iig",
      "datetime": "2024-01-03T20:34:57.000Z",
      "text": "Да он и так нерентабельныйДык я об этом же. Бытовая техника, как правило, делается не очень ремонтопригодной. Иногда это побочный эффект от удешевления, иногда - целенаправленно."
    },
    {
      "id": 26336696,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T21:08:12.000Z",
      "text": "Т.е. вы считаете, что разборный бак стиралки принципиально снизит стоимость замены подшипников?Я вот занимался ремонтом мелкой бытовой техники. Женщина притащила СВЧ печь. Неисправность — не греет. Спрашивает, сколько будет стоить ремонт. Я ей попытался объяснить, что без диагностики сходу и не скажешь точно, но чаще всего это неисправный магнетрон. Замена магнетрона: 300 руб работа, плюс, 700 рублей магнетрон (дело давно было, потому такие цены). Она подумала секунд пять и оставила печь нам, со словами, что в соседней двери лучше новую печь за 1200-1500 рублей купит. Ещё сетовала, что зря пёрла эту тяжеленную коробку.В плане ремонтопригодности эти электромеханически СВЧ печи проще некуда. Всё просто и понятно. Но нерентабельно.В итоге, кстати, оказался подгоревший контакт в одном из микриков двери. Если бы она согласилась на диагностику, весь ремонт ей бы встал в 300 рублей.Аналогично было у моего знакомого. Я тут уже где-то описывал в одном из комментариев запущенную посудомойку. Там главный насос не запускался из-за накипи. Пока разбирались в чём дело, загуглили, сколько он стоит. Оказалось, что две трети стоимости той дешёвой машинки. Тоже ремонт нерентабелен, хотя и замена насоса несложна.Я не спорю, что есть действительно непригодные для ремонта устройства. Во времена моей работы в том сервисе, этим промышлял Борк. Именно поэтому я всегда обходил стороной этот бренд. Хотя он, вроде как, и никогда не попадал в моё поле зрения, как кандидат на покупку, т.к. то ли выдающихся параметров не имел, то ли цена завышена.Так что, я ещё раз скажу, что вы можете продолжать верить в заговоры. А я вижу, что в основном причина всех сложностей ремонта, а точнее даже нерентабельности ремонта — это изначальная дешивизна устройства. Вон, айфоны стоят по 100-150К рублей, они все клеянные, запчасти друг к другу привязанные, но это не мешает сервису ремонта айфонов процветать который год. Там и деньги мастера неплохие зарабатывают, и оборудование сложное покупают. А всё потому, что раз устройство такое дорогое, то и за ремонт можно выложить кругленькую сумму. И при этом ремонт будет иметь смысл, т.к. новый купить значительно дороже."
    },
    {
      "id": 26344364,
      "author": "DarkTiger",
      "datetime": "2024-01-06T09:54:45.000Z",
      "text": "Canon Pixma принтеры, например, так и делают уже давно, только это называется \"переполнение абсорбера чернил\". Но назвать это все равно как, меняй этот абсорбер или нет, приходится флешки на управляющей плате перепрошивать."
    },
    {
      "id": 26333234,
      "author": "diesel80",
      "datetime": "2024-01-03T05:40:10.000Z",
      "text": "Да, да, вятка-автомат же. Бэк ин юэсэсар. Такова же основная идея?"
    },
    {
      "id": 26333302,
      "author": "rapidstream",
      "datetime": "2024-01-03T06:31:06.000Z",
      "text": "Отечественным людям - отечественные стиралки!"
    },
    {
      "id": 26335976,
      "author": "Flux",
      "datetime": "2024-01-03T17:40:20.000Z",
      "text": "О, что это у нас тут? Да это же старое доброе доведение до абсурда!Рынок стиралок такая вещь, если не святой Сименс то грязная Вятка, правда? Ни самсунгов, ни китайцев не существует в природе.Существует только жизненно-необходимое желание скатить всё в политоту, да?"
    },
    {
      "id": 26339416,
      "author": "infund",
      "datetime": "2024-01-04T17:09:34.000Z",
      "text": "Ненене, у нас тут неспособность увидеть сарказм без таблички. И да, если крепко зажмурить глаза, то не увидишь, как «политота» зашла буквально каждому в дом и топчется по тебе ногами."
    },
    {
      "id": 26333654,
      "author": "engine9",
      "datetime": "2024-01-03T07:37:07.000Z",
      "text": "У меня есть знакомый мастер по сантехнике и стиралкам, ему часто отдают старые \"глупые\" боши и сименсы, а он их с радостью забирает чинит и продаёт тем, кто осведомлён о их надёжности."
    },
    {
      "id": 26333708,
      "author": "Vantela",
      "datetime": "2024-01-03T07:48:01.000Z",
      "text": "\"он их с радостью забирает чинит и продаёт тем, кто осведомлён о их надёжности\"У вас слово \"чинит\" конфликтует со словом \"надежности\":)"
    },
    {
      "id": 26333940,
      "author": "sptor",
      "datetime": "2024-01-03T08:48:02.000Z",
      "text": "Ну так часто починить  старую  машину  это    достаточная часть  ее остаточной стоимости на вторичном рынке  потому как деталей может не найти работа тоже стоит, поэтому многие  предпочаитают  купить новую. Как   пример,   починка старой машины  будет  стоить  условных  100  денег, а новая более современная  и так далее  стоит 250  денег  или там  300 денег, но при этом там гарантия на два-три-пять лет  напримерю,    на ремонт такой гарантии никто не даст, максимум пара месяцев, вот и взвешиваются за  и против, и часто   покупка новой перевешивает.А что до надежности старых, возможно это   отчасти так и есть, если брать    верхние линейки. По  крайней мере  когда меняли духовку например,    потому как у старой через надцать лет   перегорел один из нагревательных элементов  нам в магазине прямым текстом сказали, даже не надейтесь, что   новая - той  же фирмы  и примерно того же класса проработает у вас столько же, то  же про посудомойку говорил мастер, чинивший ее   через те же надцать лет  по мелочи."
    },
    {
      "id": 26334008,
      "author": "MountainGoat",
      "datetime": "2024-01-03T09:01:21.000Z",
      "text": "Отнюдь. Если одно устройство работает десять лет и к концу срока в нём разваливается всё, а в другом нужно каждые пять лет менять подшипник, и вот уже 50 лет внуки не дождутся, когда же эта древняя хрень наконец сломается окончательно..."
    },
    {
      "id": 26334256,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T10:05:05.000Z",
      "text": "Да, рукастый муж — горе в семье. Ни одной новой вещи :)"
    },
    {
      "id": 26334034,
      "author": "engine9",
      "datetime": "2024-01-03T09:06:34.000Z",
      "text": "Подразумевается смена подшипников, профилактика, где-то что-то подпаять и подтянуть. Это при том, что машинка отпахала десятилетия."
    },
    {
      "id": 26333894,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T08:40:54.000Z",
      "text": "Классическая ошибка выжившего. Если бы все старые машинки были такие надёжные, то они бы у всех так и стояли бы. Но нет, большинство меняет технику на современную. И вот у меня новая машинка гораздо тише работает, тише, чем старая, когда была новой 20 лет назад. Лучше стирает (не знаю, как это работает, но с тем же порошком и вправду лучше отстирывается бельё), более бережно относится к ткани. А ещё имеет люк большего размера, таймер отложенного запуска, подсветку бака (это прям киллер фича, удивлён, что мало машинок с этой опцией) и встроенную сушку. Правда, последнее требует регулярной чистки с почти полным разбором машинки.И да, старая машинка проработала лет 15-16. За это время у неё сносились амортизаторы, стёрлись надписи на панеле, выломало крепление амортизатора из корпуса машинки (усталость металла). С новья у неё иногда не получалось провернуть барабан в одну из сторон во время стирки. Крепление приварил назад, надписи обновил перманентным маркером. Остальное не трогал. Так и подарил знакомому. Т.е. машинка, вроде, и надёжная, но толку от этой надёжности, когда она морально устарела."
    },
    {
      "id": 26334062,
      "author": "engine9",
      "datetime": "2024-01-03T09:10:56.000Z",
      "text": "Ну не стоит всё сводить только к ошибке выжившего, технику действительно делали более надёжную, не экономили на материалах. При щадящей эксплуатации \"старая\" проработает многократно дольше \"новой\"."
    },
    {
      "id": 26334080,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T09:15:25.000Z",
      "text": "А я вижу другое. Старая техника стоила дороже. Т.е. при компенсации инфляции получаем, что раньше условную стиралку можно было купить не дешевле 100 у.е. и она служила 20 лет. Сейчас же можно купить стиралку за 20 у.е., и служит она 5 лет. Но никто не мешает вам снова купить стиралку ща 100 у.е. Возможно, она тоже прослужит 20 лет, но большинство выбирает \"пятилеток\" за 20."
    },
    {
      "id": 26334292,
      "author": "engine9",
      "datetime": "2024-01-03T10:18:51.000Z",
      "text": "Да, но у этого есть минус — увеличение количества отходов. Окружающая среда это тоже наше общее достояние."
    },
    {
      "id": 26334306,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T10:26:07.000Z",
      "text": "Ну вот поэтому я купил стиралку за 85К рублей, а не за 17К. :)И у посудомойки заменил оба насоса и переключатель потока, а не выбросил и купил новую."
    },
    {
      "id": 26334590,
      "author": "NutsUnderline",
      "datetime": "2024-01-03T11:55:13.000Z",
      "text": "если бы стояла то работает. примитивная \"бочка\" - Ока, которой уже лет 40, наверное, - работает"
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 26333264,
      "author": "Antra",
      "datetime": "2024-01-03T06:04:59.000Z",
      "text": "После установки приложения Home Connect я удалил аккаунт с другой страной из своего телефонаЗачем?Дает возможностью установить всякое типа Linked-In без APK. А мешает-то чем?"
    },
    {
      "id": 26333282,
      "author": "shaggyone",
      "datetime": "2024-01-03T06:17:57.000Z",
      "text": "Вот интересно, мне на ум приходит функция калибровки порошка насколько хорошо он отстирывает в доступной воде. Ну и встроенная емкость для порошка, которая загружается раз в месяц. Можно даже несколько порошков под цветные и белые вещи. Вычисление количества порошка и воды в зависимости от массы загруженных вещей и т.п. но скорее всего вю умность стиралки не про это."
    },
    {
      "id": 26333286,
      "author": "rezdm",
      "datetime": "2024-01-03T06:19:10.000Z",
      "text": "Где ещё один пункт в опросе: закончить войну, откатить санкции."
    },
    {
      "id": 26334104,
      "author": "olegarhInTheHabrahabr",
      "datetime": "2024-01-03T09:23:47.000Z",
      "text": "подобные действия производителей не ведут к окончанию войны, они ведут к озлоблению россиян и как минимум к уменьшению лояльности европейским государствам, а значит играют на руку российской системе. Не говоря о том, что это де-факто дискриминация по национальному признаку, с которой почему-то всем борцам за свободу человека -- ок. Мы-то переживем, а вот европейским компаниям и части общества, что это поддерживало, потом придется за это краснеть. Не путайте частное с общим -- агрессию и насилие с одной стороны и дискриминацию с другой."
    },
    {
      "id": 26334186,
      "author": "jackcrane",
      "datetime": "2024-01-03T09:41:13.000Z",
      "text": "европейским компаниям и части общества, что это поддерживало, потом придется за это краснеть.ничего не значит. опыт лицедейства и фарисейства там накоплен гигантский.но если в деньгах придется терять - тогда может быть что-то дойдет."
    },
    {
      "id": 26334840,
      "author": "kma21",
      "datetime": "2024-01-03T13:04:30.000Z",
      "text": "после окончания конфликта санкции не откатятся по мгновению ока."
    },
    {
      "id": 26350618,
      "author": "brotchen",
      "datetime": "2024-01-07T22:19:04.000Z",
      "text": "Бывает \"в мгновение ока\", то есть моментально (видимо, калька с немецкого Augenblick) и \"по мановению руки\", то есть без усилий."
    },
    {
      "id": 26334886,
      "author": "Gorthauer87",
      "datetime": "2024-01-03T13:16:33.000Z",
      "text": "И чем это тут поможет? Они даже не из за санкций это сделали, просто по своей дурости. Они что ли поумнеют?Даже если включат функцию назад, то какое к ним уже может быть доверие, если функции умного дома там не работают без интернета, причём по вообще не понятной причине. Это просто жадные капиталисты, которые просто побанили пользователей от которых теперь не могут получить денег.Прошивку бы им сломать и отвязать ее от их серверов."
    },
    {
      "id": 26333300,
      "author": "m0xf",
      "datetime": "2024-01-03T06:30:57.000Z",
      "text": "Автору удалось наладить работу только по тому, что производитель подошёл к блокировке слишком формально. Видимо не очень хотелось ему отключать клиентов."
    },
    {
      "id": 26333698,
      "author": "WondeRu",
      "datetime": "2024-01-03T07:47:18.000Z",
      "text": "Я бы включал стирку или в сушку в момент, когда генерация энергии с солнечных батарей максимальная и превышает потребление, чтобы, условно, стирка была бесплатной. Обычно, максимальная генерация днем, когда тебя нет дома.PS. Хотя… проще включать по расписанию  с 12 до 14, когда максимальная генерация)) нет же варианта, подождать, когда будет хорошая погода))"
    },
    {
      "id": 26333722,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T07:50:18.000Z",
      "text": "Мне кажется, у большинства всё же нет солнечных электростанций. Зато у многих дешёвый ночной тариф на электричество. И этот вопрос решается банальным таймером отложенного запуска."
    },
    {
      "id": null,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T10:30:17.000Z",
      "text": "По вашей ссылке речь идёт о тарифе выходного дня. Я же говорю про ночной тариф, который в Свердловской области, если верить вашей ссылке, остался. Потому, не вижу причин не стирать ночью. Хотя это и копейки. Я это делаю скорее из гражданской ответственности, чтобы хоть чуток выровнять потребление."
    },
    {
      "id": 26334318,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T10:30:17.000Z",
      "text": "По вашей ссылке речь идёт о тарифе выходного дня. Я же говорю про ночной тариф, который в Свердловской области, если верить вашей ссылке, остался. Потому, не вижу причин не стирать ночью. Хотя это и копейки. Я это делаю скорее из гражданской ответственности, чтобы хоть чуток выровнять потребление."
    },
    {
      "id": null,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T11:53:25.000Z",
      "text": "И что, за год механизм перенастройки счётчиков на новую тарифную сетку не отладили? За это денег требуют? Или долго ждать специально обученного человека? Тем более, что многие счётчики умеют в удалённое управление и много где это используется. А при удалённом управлении смена тарификации дело нескольких минут."
    },
    {
      "id": 26334578,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T11:53:25.000Z",
      "text": "И что, за год механизм перенастройки счётчиков на новую тарифную сетку не отладили? За это денег требуют? Или долго ждать специально обученного человека? Тем более, что многие счётчики умеют в удалённое управление и много где это используется. А при удалённом управлении смена тарификации дело нескольких минут."
    },
    {
      "id": 26347188,
      "author": "AlexSpirit",
      "datetime": "2024-01-07T04:03:16.000Z",
      "text": "Это делается через электронный кабинет энергосбыта. Бесплатно."
    },
    {
      "id": 26333924,
      "author": "balanila",
      "datetime": "2024-01-03T08:46:39.000Z",
      "text": "Подобным образом привязал к Home Assistant свою посудомойку Bosh. Живу в Молдове и приложение Home Connect никогда тут не работало. Помогла смена региона на Румынию.Для чего мне это нужно: Через приложение скачал ещё несколько режимов мойки такие, как интенсив 70, интенсив 60, быстрое ополаскивание на 15 минут (когда грязная посуда лежит сутки, то смачиваю таким образом).Кнопками на самой посудомойке эти режимы не выставить, а лезть каждый раз в приложение в телефоне неудобно.Купил настенный многоклавишный zigbee переключатель сцен и задал через Home Assistant какие действия выполнить на определённые клавиши и назначил разные режимы стирки. По нажатию посудомойка включается и запускается нужный режим. По окончанию стирки прилетает уведомление в телеграм."
    },
    {
      "id": 26333932,
      "author": "empenoso",
      "datetime": "2024-01-03T08:46:59.000Z",
      "text": "Спасибо что по делу написали"
    },
    {
      "id": 26333948,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T08:48:57.000Z",
      "text": "Забавно, конечно. Т.е. производитель продал вам за дополнительные деньги функцию \"умной\" машинки, чтобы вы могли скачать режимы, которые есть во всех \"глупых\" машинках с магазина."
    },
    {
      "id": 26334026,
      "author": "balanila",
      "datetime": "2024-01-03T09:04:47.000Z",
      "text": "Вот так у нас. Я написал в поддержку Home Connect и получил ответ, что Молдова не поддерживается и даже нет в планах об этом. Местный диллер тоже разводит руками. Сомневаюсь, что они вычли из стоимости посудомойки функцию Wi-Fi."
    },
    {
      "id": 26334050,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T09:09:03.000Z",
      "text": "А у вас в Молдове продаются только недоумные машинки с вайфаем?"
    },
    {
      "id": 26334078,
      "author": "balanila",
      "datetime": "2024-01-03T09:13:42.000Z",
      "text": "У нас продаются всякое на разный бюджет. И умные и не очень и не важно, есть ли поддержка умных функций в стране. Я выбирал машинку по другим характеристикам и, как оказалось, в ней есть Wi-Fi и возможность удалённого управления, которое не работает в Молдове. Это ограничение удалось обойти путём смены региона в телефоне."
    },
    {
      "id": 26334082,
      "author": "sptor",
      "datetime": "2024-01-03T09:15:32.000Z",
      "text": "Так  сейчас сегментация рынка такая, либо что-то совсем непонятное/дешевое   но без   свистоперделок,    либо если что-то более менее известное, то разница между   \"умной\"  и  \"глупой\"  будет в    пределах пары процентов,  плюс известное стремление  к  совершенству - вроде стоит не сильно дороже, зато   имеет больше функционала.  Или например  та же второстепенная функция, но важная для кого то функция, а-ля подсветка бака есть только в топ  уровне в комплекте  с \"умными\"  функциями."
    },
    {
      "id": 26334124,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T09:26:24.000Z",
      "text": "Но отсутствие функции пятнадцатиминутного споласкивания посуды разве не является поводом задуматься, что что-то тут неладное? Просто, сколько я видел посудомоек и у друзей/знакомых, и у самого пара штук была, везде набор режимов примерно одинаковый. Разница, обычно, зависит от устройства самой машинки. Если, например, есть встроенный бак для воды, в котором вода находится во время мойки посуды и нагревается через стенку, из-за чего полоскание происходит тёплой водой, а не холодной. Вот если такое есть, то режим бережной мойки хрусталя добавят, и буковку энергоэффективности нарисуют покруче. А базовые полоскание, максмальный режим и пару средних были везде.Тут же у человека ни полоскания с завода нет, ни максимального режима. Какая-то недомашинка получается. Какие же тогда там есть режимы с завода? И зачем убрали базовый набор?"
    },
    {
      "id": 26334170,
      "author": "sptor",
      "datetime": "2024-01-03T09:34:42.000Z",
      "text": "Ну тогда странно  да,    вроде везде есть интенсив и    полосканние, всяких хитровывернутыз может не  быть да.  Но в принципе  я вообще не вижу   в чем  смысл завязывать   бытовую технику на какой то внешний сервер - понятно что    например для робота пылесоса можно его так удешевить  поставив электронику подешевле, и все эти карты и прочее хранить на сервере, но   для чего это все в   холодильнике/духовке/посудомойке/стиралке  для меня не очень ясно, там же нет   даже минимальной полезности которой это вес оправдать можно, кроме самого факта  \"мы можем\"."
    },
    {
      "id": 26334190,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T09:43:11.000Z",
      "text": "Собственно об этом тут внушительная часть комментариев.Ну и для духовки полезна функция удалённого включения. Т.к. на разогрев требуется некоторое время, удобно было бы по дороге из магазина домой дать комманду на включение духовки, чтобы по приходу сразу закинуть туда принесённую пиццу."
    },
    {
      "id": 26334270,
      "author": "sptor",
      "datetime": "2024-01-03T10:12:21.000Z",
      "text": "Возможно,   но это тоже весьма  ограниченый сценарий. Духовку    тожно также можно включить   и  пока ты там переодеваешься, распаковываешь   продукты она нагреется. На мой взгляд  это не  то  чтобы сильно нужно, примерно как  озвучивавшееся тут включение чайника по открытию  двери. Все   экономия нескольких минут времени  не настолько критична в повседневной жизни, чтобы ради  этого городить привязку к серверам через пол мира."
    },
    {
      "id": 26334302,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T10:21:06.000Z",
      "text": "Да понятно, что и свет можно выключателем в другом конце комнаты включить, и духовку подождать. Но этот функционал  имеет хоть какое-то обьяснение и понятна привязка к серверам. Сервера нужны потому что домашние провайдеры в большинстве своём не умеют в IPv6, а те, что умеют, жмотят адреса. Выдают один адрес на абонента. Соответственно, подавляющему большинству обывателей не обьяснишь, что им надо доплачивать за постоянный белый IP (да и на всех не хватит этих адресов), плюс, кто умеет грамотно настроить роутер, чтобы дать доступ из интернета к духовке? Плюс, учитывая кривизну и дырявость прошивок всех этих \"духовок\", я бы не рискнул открывать к ней доступ из вне. А значит, надо ещё и ВПН настраивать между смартфоном и домом. Сделать всё это смогут единицы. Для остальных сервера от производителя."
    },
    {
      "id": 26334314,
      "author": "sptor",
      "datetime": "2024-01-03T10:28:13.000Z",
      "text": "У меня  есть стойкое ощущение, что  большинство рядовых пользователей ничего никуда не присоединяет - разве что роботы-пылесосы исключение,  ибо там функционал  без этого вообще скудный,  именно потому, что   даже с аппами  производителя и завязкой на серваки  там тоже не все так просто. Кстати  когда выбирали новую духовку ( в результае  сознательно выбрана  без сетевых возможностей, ибо не надо)  видел  и духовку с камерой смотрящей внутрь, дабы готовку удаленно контролировать :)."
    },
    {
      "id": 26334350,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T10:42:38.000Z",
      "text": "А я к своей дешманской духовке прикрутил ПИД регулятор температуры, ибо родной на тепловой трубке давал разброс по температуре ±15°. И вот совершенно непонятно, в духовках с электронным термостатом, там ПИД или простой on/off с гистерезисом. И как узнать, какой регулятор в конкретной духовке?"
    },
    {
      "id": 26334202,
      "author": "balanila",
      "datetime": "2024-01-03T09:46:16.000Z",
      "text": "У меня машинка Bosch SMV4HVX00K. На дверце по кнопкам доступны только:Eco 50Auto 45-6570 градусов не интенсив65 градусов не интенсив длительностью 1 часТихая 50 градусовКнопка Favorite, на которую была зашита какая-то короткая программа, возможно полоскание и было и на которую можно назначить любую другую.Я добавил именно интенсивные режимы. В них, что я заметил, выброс таблетки происходит намного раньше, чем в обычном режиме. Длительность одинаковая 2 часа 15 минут.На работе более старый бош и похожие режимы.Для меня \"умные\" функции не так важны. Раз есть, можно и воспользоваться."
    },
    {
      "id": 26334238,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T09:59:22.000Z",
      "text": "Странно, вот какие у меня режимы. Машинке 9,5 лет. Стоила порядка 25К руб в 2014-ом, т.е. это не какая-то элитная машинка.Ну и да, если вам так понадобились интенсивные режимы, может быть, стоит попробовать сменить моющее средство? Я вот таблетки не использую. Покупаю порошок. При этом, не всякий порошок хорошо отмывает. Например, разрекламированный Финиш моет на троечку. Я беру Сомат. Его качество мойки меня устраивает. При этом, мою на еко режиме. На максимальном режиме слишком быстро слезает тефлон со сковородок."
    },
    {
      "id": 26335564,
      "author": "voldemar_d",
      "datetime": "2024-01-03T16:01:01.000Z",
      "text": "Про Сомат мастер по ремонту посудомоечных говорил, что они могут давать слишком интенсивную пену, и датчики в машине могут ошибочно определять, когда пора мойку закончить. Возможно, я не очень точно передал его слова - пусть меня поправят, если всё не так."
    },
    {
      "id": 26335694,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T16:37:58.000Z",
      "text": "А может не давать. По факту, все 9,5 лет моем Соматом. Даже если машинка решает раньше завершить мойку, качество самой мойки меня гораздо больше устраивает, чем после \"не пенящегося\" Финиша.И да, на всякий случай уточню, что я говорю о порошке Сомат для посудомоечных машин. А то может мастер вам про средство для ручной мойки говорил."
    },
    {
      "id": 26335780,
      "author": "sptor",
      "datetime": "2024-01-03T16:52:42.000Z",
      "text": "Кстати, про средства для посудомоек, не так давно попалась новость, что в Австралии засудили их производителей за ложную рекламу - причем всех на их рынке, как выяснили  лабораторно,   средства рекламируемые как премиум класс, и  якобы дающие лучшее качество мойки (типа лучше растворяют жир, лучше при более низкой температуре и так далее), по факту если  и  отличались от  других, то лишь в рамках статистической погрешности, то  есть по факту пришли к выводу что  эти средства у одного производителя одинаковы, и все разделение по   сегментам чисто маркетинговое по сути."
    },
    {
      "id": 26335792,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T16:55:36.000Z",
      "text": "Ещё бы кто-нибудь их засудил за \"специальный\" хлорид натрия для регенерации ионообменной смолы в посудомойках."
    },
    {
      "id": 26335832,
      "author": "sptor",
      "datetime": "2024-01-03T17:02:00.000Z",
      "text": "Не у нас явно,  хотя конечно это  обычная повареная соль, только что крупной фракции, каменную я все же поостерегся бы использовать,  из за возможности того что там будут нерастворимые вкрапления. Плюс  если пользоваться таблетками для посудомоек ее в общем можно и не использовать даже"
    },
    {
      "id": 26335886,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T17:14:53.000Z",
      "text": "Помол не имеет значения, главное, чтобы не йодированная. На счёт нерастворимых вкраплений, пищевая соль имеет более высокую степень очистки, чем специальная для ПММ. Об этом зачастую не стесняются писать на упаковки. Типа, для ПММ 92,5%, для еды 98,5%.Таблетки не заменяют соль. Соль используется для регенерации ионообменной смолы. В том контейнере, куда засыпается соль, создаётся насыщенный соляной раствор, который прогоняется через контейнер с ионообменной смолой. В результате ионы кальция в смоле замещаются ионами натрия из раствора. Потом этот раствор смеси хлорида натрия и хлорида кальция сливается в канализацию.Та же вода, что находится в отделении с посудой, она уже прошла через ионообменную смолу и снова туда не попадёт, а значит, если вы не засыпаете соль, смола не будет регенерироваться.Да, возможно, в таблетки добавляют что-то для компенсации жёсткости воды, это помогает хорошо мыть посуду, но после мытья происходит ополаскивание, а оно уже выполняется без таблеток и если вода достаточно жёсткая, то во время сушки на посуде могут возникать некрасивые потёки \"накипи\".Учитывая, что килограмм не йодированной соли стоит 33 рубля на Озоне, а в оффлайн магазинах и того дешевле, не вижу смысла в экономии на ней."
    },
    {
      "id": 26335922,
      "author": "sptor",
      "datetime": "2024-01-03T17:28:30.000Z",
      "text": "На счёт нерастворимых вкраплений, пищевая соль имеет более высокую степень очистки, чем специальная для ПММПищевая может быть каменная, верне в массе своей  такая и есть, изыски типа морской  не то чтобы  сильно распостранены.  А для посудомойки используют повареную насколько я знаю, то есть полученую выпариванием рассола.воды, это помогает хорошо мыть посуду, но после мытья происходит ополаскивание, а оно уже выполняется без таблеток и если вода достаточно жёсткая, то во время сушки на посуде могут возникать некрасивые потёки \"накипи\".Возможно  при очень жесткой воде  так и есть,  у нас вода не  мягкая, но поминавшаяся мной посудомойка  живущая уже  18 лет, ни разу не видела соли,  мойка только таблетками, но на ней есть  просто переключатель которым  ты выбираешь моешь ли ты таблетками  три в одном условно, или порошком, и на  основании этого    нужно ли использовать соль или нет,  в инструкции это четко прописано. Потеков и прочего как то не замечалось"
    },
    {
      "id": 26335948,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T17:35:30.000Z",
      "text": "Ну хорошо, если так. Я как-то наблюдал посудомойку, куда соль не засыпали, т.к. у неё помер датчик соли. Вода там жёсткая, мыли посуду порошком. Зрелище печальное. А учитывая, что из-за неправильной установки, она ещё и подтекала, из-за чего ею несколько лет не пользовались, то основной насос смог запуститься только с третьего раза."
    },
    {
      "id": 26335974,
      "author": "sptor",
      "datetime": "2024-01-03T17:39:44.000Z",
      "text": "мыли посуду порошкомВот  поэтому,  сейчас, я понимаю для бытового использования в  посудомойках преобладают именно таблетки.  Потому как и для производителя мороки меньше с гарантией и прочим, и для конечного пользователя, нужно одно действие и все, в принципе даже без ополаскивателя специального жить можно.Ксли честно именно порошка для посудомоек я  не видел в продаже, все больше таблетки , хотя не смотрел конечно."
    },
    {
      "id": 26336730,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T21:19:51.000Z",
      "text": "Для производителя выгоднее вам продавать таблетки, т.к. вы не сможете их экономить как порошок. Я порошка сыплю в зависимости от количества посуды и степени её загрязнения. А таблетку же не будешь резать.Лично я таблетки не использую по двум причинам. Первую озвучил выше, т.е. это цена одной мойки посуды. Вторая, и главная, это то, что подавляющее большинство таблеток, это 3 в одном, 5 в одном и прочее. Основное, что меня раздражает, это наличие в них ополаскивателя. Я не знаю, что со мной не так, но в обоих машинках, что у меня были, если в том или ином виде используется ополаскиватель, то независимо от его количества вся стеклянная посуда постепенно покрывается радужными разводами, потипу масляной плёнки на воде. И этот налёт крайне тяжело отмывается. Т.е. он при умеренном использовании ополаскивателя появляется в течении недели ежедневных моек. Когда ополаскиватель убираю, нужно ещё неделю ежедневно мыть эту посуду, чтобы налёт ушёл окончательно.Касательно продажи порошка, думаю, ссылку на озон вам не надо, сами найдёте по запросу \"порошок для посудомойки Сомат\"."
    },
    {
      "id": 26337350,
      "author": "sptor",
      "datetime": "2024-01-04T06:05:34.000Z",
      "text": "Поискал , да есть такое но выбор сильно небогат, видимо  спроса нет,   причем в основном  либо какие то органические бренды, либо Миле, либо Иплон.  Но я не в России,  условная  одна таблетка  для мойки стоит  в районе 10-15  евроцентов если упороться поискать  или последить за скидками  можно и дешевле найти.   Порошок   стоит  дешевле, но не принципиально, с учетом того что все равно стараешься пустую  машину не гонять, экономия   будет столь же копеечная, но ценой большего удобства. С ополаскивателем если честно особой проблемы не заметил, возможно химсостав воды влияет."
    },
    {
      "id": 26337290,
      "author": "Goron_Dekar",
      "datetime": "2024-01-04T05:32:36.000Z",
      "text": "Так он и есть специальный. Гранулированый. Сыпать мелкодисперсный не стоит - быстро комкуется и плохо растворяется."
    },
    {
      "id": 26337452,
      "author": "kvazimoda24",
      "datetime": "2024-01-04T06:55:25.000Z",
      "text": "На столько плохо, что за сутки не набирается на насыщенный раствор? Притом, что первый час там ещё и температура выше комнатной."
    },
    {
      "id": 26337472,
      "author": "kvazimoda24",
      "datetime": "2024-01-04T07:03:30.000Z",
      "text": "Ну и да, история с формой гранул появилась только несколько лет назад. Когда я последний раз покупал \"специальную\" соль для ПММ лет 15 назад, соль в пачке была не в гранулах, а такая же, как и пищевая, просто чуть более крупного помола (если сравнивать с экстра) и серая от примесей."
    },
    {
      "id": 26337420,
      "author": "iig",
      "datetime": "2024-01-04T06:42:41.000Z",
      "text": "за \"специальный\" хлорид натрияИз специального там только форма гранул. И это важно. Если взять кухонную соль мелкого помола - она слипнется в комок и будет медленнее растворяться.Можно купить таблетированную соль для водоподготовки - она дешевая. Но не у всех есть где хранить 20 кг мешок так чтобы через 2 года оно не натянуло воды и не слиплось в комок. Так что да, вы переплачиваете за форму и упаковку."
    },
    {
      "id": 26337456,
      "author": "kvazimoda24",
      "datetime": "2024-01-04T06:56:35.000Z",
      "text": "На столько сильно слипнется и так плохо растворяется, что за сутки не наберётся насыщенный раствор?"
    },
    {
      "id": 26337470,
      "author": "kvazimoda24",
      "datetime": "2024-01-04T07:03:19.000Z",
      "text": "Ну и да, история с формой гранул появилась только несколько лет назад. Когда я последний раз покупал \"специальную\" соль для ПММ лет 15 назад, соль в пачке была не в гранулах, а такая же, как и пищевая, просто чуть более крупного помола (если сравнивать с экстра) и серая от примесей."
    },
    {
      "id": 26337666,
      "author": "iig",
      "datetime": "2024-01-04T08:40:40.000Z",
      "text": "Ну, купили вы соль с какими-то примесями. Этикетка с надписью \"специально для ПММ\" не делает эти примеси полезными для смолы в регенераторе. Возможно, они и не вредные, и с одной пачки ничего не случится. Г***нные расходники - это тоже шаг к запланированному устареванию. Жесткая вода+экономия на соли = убитый регенератор, регенератор для старой машинки стоит приличных денег, замена смолы в нем не предусмотрена, проще купить новую, с wifi и bluetooth."
    },
    {
      "id": 26337698,
      "author": "kvazimoda24",
      "datetime": "2024-01-04T08:53:29.000Z",
      "text": "Так вы уж определитесь, с примесями специальными покупать или без примесей пищевую соль сыпать :)Правильно говорят, что хоть сколько то развитая технология неотличима от магии. Отсюда и появляются специальный хлорид натрия, углекислый аммоний, которым \"нас травят злые американцы\", жёлтые очки, которые сохраняют зрение при работе за компьютером...Я, наверное, не буду продолжать этот тред, т.к. спорить по вопросам веры бесперспективно."
    },
    {
      "id": 26338404,
      "author": "iig",
      "datetime": "2024-01-04T12:16:00.000Z",
      "text": "Так вы уж определитесь, с примесями специальными покупать или без примесей пищевую соль сыпать :)Хм. Вы эту странную дихотомию придумали - вы и определяйтесь. Я за то, чтобы сыпать то что нужно, а что не нужно - не сыпать. Лично я использую таблетированную соль из большого мешка - ее знающие люди используют для водоподготовки, так что можно быть уверенным, что ничего неподходящего там нет. И забрасывать большие таблетки удобнее чем мелкие гранулы.Отсюда и появляются специальный хлорид натрия, углекислый аммоний..улучшенный бензинприсадки, экономящие бензинфирменное моторное маслобрендовые зарядки для телефонов..Магия она вокруг, нужно только отличать настоящую уличную магию от унылой физики с химией ;)"
    },
    {
      "id": 26334048,
      "author": "sptor",
      "datetime": "2024-01-03T09:08:59.000Z",
      "text": "Так   этом основной   смысл всех \"умных\"  вещей,  продать за деньги то, что раньше было \"стандартом\", и потихоньку перейти на модель  \"товар как сервис\"  и подписки, которые ну очень выгодны для продавца/производителя."
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 26334114,
      "author": "drakut",
      "datetime": "2024-01-03T09:24:23.000Z",
      "text": "Тоже перед праздниками возваращал утраченные функции посудомойки bosch. Для посудомойки и стиралки умный функционал действительно не сасый необходимый, но я за него заплатил, и этого аргумента мне хватало.В статье пропущен важный пункт регистрации приложения для получения секретов - нужно указать телефон и почту на сайте singlekey-id.com, без этого будет ошибка проверки аккаунта и регистрация не удастся.Мои пункты кратко:1. Телефон android с заводскими настройками2. Сделать аккаунт google c почтой, не указывать все что можно не указывать, в качестве страны выбираем Германию или United Kingdom3. Включаем режим разработчика на телефоне4. Установить Vpnify5. Установить Fake GPS6. В настройках телефона указываем в качестве программы подмена координат Fake GPS7. Подключаем VPN через Германию8. Указываем местоположение в Кельне через Fake GPS9. Ставим Home Connect на почту из п.210. Подключаем технику. ОСТАЛЬНЫЕ ШАГИ ДЛЯ подключения к умному дому11. Регистриуемся на onlinesim.io12. Остальные регистрации делаем через tor browser или через vpn (аддон для браузера или настройка роутера). Удобнее через надтсройку браузера.13. Регистрируемся на https://developer.home-connect.com/14. В профиле https://singlekey-id.com/en-us/myprofile/ указываем номер из п. 1115. Регистрируем приложение в п.12, где в качестве  Home Connect User Account for Testing указываем почту ОБЯЗАТЕЛЬНО в нижнем регистре16. Ставим Home Connect в Home Assistant с реквизитами из п.14, в процессе будет переход на сайт home connect (копируем ссылку и открываем через tor, если нет vpn) указываем разрешения."
    },
    {
      "id": 26334252,
      "author": "splitfire",
      "datetime": "2024-01-03T10:04:43.000Z",
      "text": "Пиздец какой-то. Предоставьте отпечатки, анализ крови и мочи для того что бы простирнуть наволочку.Вы вот это вот называете, \"удобные функции, облегчающие жизнь пользователю\" !!?"
    },
    {
      "id": 26334604,
      "author": "NutsUnderline",
      "datetime": "2024-01-03T12:00:04.000Z",
      "text": "это точно рецепт \"прятанья\" от bosh, а не от какой-нибуть госорганизации.."
    },
    {
      "id": 26986058,
      "author": "T32202",
      "datetime": "2024-06-29T13:31:20.000Z",
      "text": "А какой страны номер указывали? Попробовал номера Германии и США, но sms на mobilesim.io после кучи попыток не приходит..."
    },
    {
      "id": 26334196,
      "author": "Barnaby",
      "datetime": "2024-01-03T09:43:41.000Z",
      "text": "Для того чтобы установить приложение Home Connect на телефон потребуется смена регионаНет, не потребуетсяhttps://apkpure.com/ru/home-connect/com.bshg.homeconnect.android.release"
    },
    {
      "id": 26337442,
      "author": "empenoso",
      "datetime": "2024-01-04T06:50:34.000Z",
      "text": "Если поставить галочку установка из неизвестных источников - банковские приложения на телефон потом не поставить..."
    },
    {
      "id": 26353728,
      "author": "dmitrmax",
      "datetime": "2024-01-08T18:24:51.000Z",
      "text": "Чё за бредятина? С учетом того, что банковские приложения теперь тоже надо ставить из неизвестных источников )Короче, у меня стоят, без рута и прочих Magisk'ов с zygisk'ами."
    },
    {
      "id": 26334308,
      "author": "Rixty",
      "datetime": "2024-01-03T10:26:44.000Z",
      "text": "О, у меня аналогичная проблема с посудомойкой. Я ее зачем то сбросил на заводские (заглючила), после чего она оказалась без умных функций. Но в целом это не особо мешает - эти функции все равно дурацкие, из полезного была нормальная настройка только.А в Хоум ассистент не получилось ее завести, не регистрировался девелопер аккаунт, возможно из за санкций. Но я не особо пытался, у посудомойки я не придумал функции автоматизации) посуду все равно ставлю стирать на ночь и она сама ее сушит (ну или типа того) и выключается."
    },
    {
      "id": 26334368,
      "author": "kvazimoda24",
      "datetime": "2024-01-03T10:49:06.000Z",
      "text": "Единственное, что я смог придумать для посудомойки — это уведомление об окончании мойки, если мойка происходит днём, т.к. если днём моет, значит, много грязной посуды, имеет смысл напомнить вынуть чистую и загрузить следующую партию. Можно ещё добавить условие по использованию быстрого режима, т.е. уведомлять тока при использовании быстрого режима мойки. Ну и иногда забываем ставить машинку на ночь, потому, можно настроить уведомление например в 11-12 вечера (примерно в это время спать ложимся), что машинка не запущена.Но для всего этого не требуется умная посудомойка, всё это можно реализовать с помощью умной розетки с измерителем мощности."
    },
    {
      "id": 26334388,
      "author": "drakut",
      "datetime": "2024-01-03T10:53:13.000Z",
      "text": "Для девелоперского аккаунта нужен vpn, или tor. От посудомойки хотел получать уведомления о расходе соли, но получать их получится только в приложение телефона. Интеграция с home assistant не позволяет такие уведомления получать."
    },
    {
      "id": 26353754,
      "author": "dmitrmax",
      "datetime": "2024-01-08T18:31:26.000Z",
      "text": "А в Москве (из вашего профиля) жесткая вода или зачем вы соль добавляете? В Питере просто это совсем бесполезное занятие и трата денег."
    },
    {
      "id": 26334492,
      "author": "ru1z",
      "datetime": "2024-01-03T11:28:43.000Z",
      "text": "VPN? Так с прошлого такие публичные инструкции с использованием VPN запрещены в России, я бы поостерегсяhttps://habr.com/ru/companies/xeovo/articles/776066/. Инструкции с использованием Tor или VPN и активную популяризацию этих инструментов среди такого широкого круга людей (многие тысячи просмотров здесь и копирование на другие вебсайты) наверняка заметят."
    },
    {
      "id": 26334612,
      "author": "NutsUnderline",
      "datetime": "2024-01-03T12:01:33.000Z",
      "text": "Формально - это другое"
    },
    {
      "id": 26334684,
      "author": "ru1z",
      "datetime": "2024-01-03T12:20:59.000Z",
      "text": "Да кто его знает какое оно, ухудшают быстро. Здесь и vpn и инструкции и широкая реклама."
    },
    {
      "id": 26334770,
      "author": "empenoso",
      "datetime": "2024-01-03T12:43:21.000Z",
      "text": "Той компании просто надоело деньги Хабру платить за корпоративный аккаунт..."
    },
    {
      "id": 26335296,
      "author": "Hait",
      "datetime": "2024-01-03T14:55:42.000Z",
      "text": "Можно как-то понять, что устройство будет локально работать с хабом? Поддержка zigbee что-то гарантирует? Или есть производители, что и такие функции смогли убить?"
    },
    {
      "id": 26335466,
      "author": "empenoso",
      "datetime": "2024-01-03T15:42:41.000Z",
      "text": "Использовать локальный сервер вроде Home Assistant с локальными прошивками вроде esphome или tasmota. Ну и зигби конечно. По ним база совместимости есть:Zigbee Device Compatibility Repository,https://zigbee.blakadder.comTasmota Supported Devices Repository,https://templates.blakadder.com"
    },
    {
      "id": 26335494,
      "author": "Barnaby",
      "datetime": "2024-01-03T15:48:26.000Z",
      "text": "Гуглить, читать описание интеграций. Некоторые девайсы, например от tuya или ewelink, принимают локальные подключения, но их все равно надо подключить к облаку и выдрать оттуда ключ шифрования.Zigbee (и наверное Matter) гарантирует, но никто его в такие девайсы не ставит."
    },
    {
      "id": 26335508,
      "author": "empenoso",
      "datetime": "2024-01-03T15:50:57.000Z",
      "text": "Legrand шлюз имел подключение устройств по зигби, но заблокировали шлюз..."
    },
    {
      "id": 26336984,
      "author": "Dynasaur",
      "datetime": "2024-01-03T23:10:19.000Z",
      "text": "Функции правильнее называть украденными, а не потерянными - вы за них заплатили, у вас их отобрали. А в целом, они не стоят возни. Если только чисто спортивный интерес."
    },
    {
      "id": 26337130,
      "author": "empenoso",
      "datetime": "2024-01-04T01:20:08.000Z",
      "text": "Изначально так и назвал статью :как вернуть себе потерянные (или украденные из-за санкций?) умные функции стиральной машины bosch, но другие полноправные  члены Хабра, которые могут ставить рейтинг и влиять на местную карму навтыкали мне минусов в статью и даже в карму с причинами, что испытывают ко мне личную неприязнь и то что я занимаюсь политикой, поэтому теперь словукраденныйисанкциинет в названии.Хотя карма на Хабре абсолютно бесполезна, но её очень сложно набрать и очень легко потерять, поэтому решил сгладить углы в названии статьи."
    },
    {
      "id": 26337294,
      "author": "balanila",
      "datetime": "2024-01-04T05:33:38.000Z",
      "text": "Мне тоже как-то спустили карму за комментарии про \"санкции\". С такой кармой даже комментарий не оставить, к сожалению. По-этому она для меня полезна хотя бы на уровне комментариев, что б не ждать модерации"
    },
    {
      "id": 26337428,
      "author": "empenoso",
      "datetime": "2024-01-04T06:44:38.000Z",
      "text": "Модерацию ведь сам автор проводит - кнопки Одобрить или Отклонить появляются."
    },
    {
      "id": 26353748,
      "author": "dmitrmax",
      "datetime": "2024-01-08T18:29:43.000Z",
      "text": "Карма бесполезна, когда она есть. Когда она уходит в минус, то вроде бы сначала отключается возможность пилить посты, а если ещё глубже, то и каменты."
    },
    {
      "id": 26337942,
      "author": "Mamonthful",
      "datetime": "2024-01-04T10:13:44.000Z",
      "text": "Насчёт пароля от вайфая - скорее всего, он должен быть ровно 10 символов, встречал подобное."
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 26343756,
      "author": "Fillini",
      "datetime": "2024-01-06T01:54:35.000Z",
      "text": "Это потому что политикой не интересуемся. И на выборы не ходим"
    },
    {
      "id": 26581975,
      "author": "drakut",
      "datetime": "2024-03-05T21:40:20.000Z",
      "text": "Оставим все за и против - функция есть, я заплатил за неё и желаю использовать. Так же дошел до подобного решения. Но ввиду февральских-2024 ограничений, полагаю, нужно смотреть в сторону обезоблачивания (cloudless) Home Connect:https://trmm.net/homeconnect/https://github.com/osresearch/hcpyhttps://community.home-assistant.io/t/homeconnect-elegant-solution-based-on-a-mqtt-bridge-local-no-cloud/687153"
    },
    {
      "id": 26590429,
      "author": "empenoso",
      "datetime": "2024-03-08T06:57:53.000Z",
      "text": "Спасибо! Я даже не искал такие решения.А у вас получилось для себя сделать?"
    },
    {
      "id": 26617783,
      "author": "drakut",
      "datetime": "2024-03-16T08:55:38.000Z",
      "text": "Пока нет, решение требует исследования протокола. Но, дорогу осилит идущий ) отпишу по результату"
    },
    {
      "id": 26669813,
      "author": "Vallefor",
      "datetime": "2024-03-30T21:01:24.000Z",
      "text": "Смог настроить интеграцию, в обход февральских ограничений. Подключил посудомоечную машинку к приложению как указано в статье (vpn, другой регион и т.д.). Потом решил настроить haproxy на сервере, который находится в стране, где это все работает.Покупаем любой VPS в доступной стране (у меня уже был Hetzner в Финляндии), устанавливаем haproxy. На самом деле покупать для этих целей VPS - такое себе, но допустим, если у вас есть Home Assistant - то есть и VPS.Добавляем в конфиг (в Ubuntu он находится в /etc/haproxy/haproxy.cfg) эти строки:frontend https-in\n    mode tcp\n    bind *:443\n    tcp-request inspect-delay 5s\n    tcp-request content accept if { req_ssl_hello_type 1 }\n    acl is-homeconnect req.ssl_sni -i api.home-connect.com\n    acl is-singlekey req.ssl_sni -i singlekey-id.com\n    acl is-dev-hc req.ssl_sni -i developer.home-connect.com\n\n    use_backend bk-homeconnect if is-homeconnect\n    use_backend bk-singlekey if is-singlekey\n    use_backend bk-dev-hc if is-dev-hc\n\nbackend bk-homeconnect\n    mode tcp\n    server api-homeconnect 3.77.174.102:443 check\n\nbackend bk-singlekey\n    mode tcp\n    server singlekey 20.101.240.212:443 check\n\nbackend bk-dev-hc\n    mode tcp\n    server dev-hc 3.125.176.154:443 checkПосле чего, вам нужно в hosts места, где крутится Home Assistant Core прописать:[ip-вашей-vps] api.home-connect.comНу и на своем компе, чтоб настроить интеграцию:[ip-вашей-vps] api.home-connect.com singlekey-id.com developer.home-connect.comИз юзкейса как минимум планирую делать такое: в случае включения удаленного старта, стартовать машинку ровно в 23:00, когда самый дешевый тариф на электричество. Чтоб не считать постоянно, на сколько там ее часов надо отсрочить."
    },
    {
      "id": 26677115,
      "author": "empenoso",
      "datetime": "2024-04-02T04:26:02.000Z",
      "text": "Супер!А у вас не Home Assistant Operating System?"
    },
    {
      "id": 26678285,
      "author": "Vallefor",
      "datetime": "2024-04-02T10:03:43.000Z",
      "text": "У меня Supervised. Чтоб /etc/hosts в нем менять я создал shell_command интеграциюshell_command:\n  recover_home_connect_proxy: \"echo '[ip-вашей-vps] api.home-connect.com' >> /etc/hosts\"И его можно запускать на старт HA."
    }
  ]
}