{
  "url": "https://habr.com/ru/articles/804475/comments/",
  "article_id": 804475,
  "title": "Замена самых дешевых Wi-Fi реле Sonoff в освещении после 7 лет их использования в квартире",
  "comments": [
    {
      "id": 26969720,
      "author": "cccvserg",
      "datetime": "2024-06-25T04:14:02.000Z",
      "text": "Вот теперь бы всё то же самое, но подробнее: чтобы новичок взял и на базе Вашего решения построил своё. А так статья крутая, но обзорная. И да, с уважением за Ваш труд!"
    },
    {
      "id": 26969722,
      "author": "cccvserg",
      "datetime": "2024-06-25T04:14:06.000Z",
      "text": "Вот теперь бы всё то же самое, но подробнее: чтобы новичок взял и на базе Вашего решения построил своё. А так статья крутая, но обзорная. И да, с уважением за Ваш труд!"
    },
    {
      "id": 26970020,
      "author": "empenoso",
      "datetime": "2024-06-25T06:18:20.000Z",
      "text": "Более простая и подробная вы имеете ввиду?"
    },
    {
      "id": 26975256,
      "author": "Anatoliy_rnd",
      "datetime": "2024-06-26T10:26:59.000Z",
      "text": "Если честно ,на мой взгляд. Все эти безпроводные вещи хорошо, но надежнее провода нет. Если уж идет капитальный ремонт, то лучше заложить проводные среды передачи данных. А так , пока этих зигби и вифи устройств не много, все еще как то работает, но когда их переваливает за сотню,  да еще и разных производителей .....Я наприммер сейчас строя дом, буду проектирвать по возможности максимально проводные и локально автономные устройства . ( например датчик присутствия, свет  локальный МК со связью с УД по каншине)  затратно, но каждую группу розеток отдельным проводом в \"станцию управления домом\" и т.п. зато этотзадел на будущие хотелки.Это когда уже есть проводка и хочется минимальными затратами , то зигби самое то, да и домашний роутер скажет спасибо если там пять шесть десятков устройств отделиться от вифи."
    },
    {
      "id": 26970052,
      "author": "ghans",
      "datetime": "2024-06-25T06:25:07.000Z",
      "text": "А в чём смысл менять работающее  Wifi на Zigbee?Частота та же, работает медленнее, требуется дополнительный костыль в виде MQTT.Для удалённых датчиков, работающих от батарейки - понятно, для стационарных реле - нет. Не в качестве критики или чтобы поумничать. Действительно не понимаю. Объясните."
    },
    {
      "id": 26970070,
      "author": "empenoso",
      "datetime": "2024-06-25T06:30:37.000Z",
      "text": "Эта квартира сдаётся, каждый раз менять пароль wi-fi на каждом устройстве было неудобно.К тому же ремонт - раз когда-то хотел, то было проще сразу больший объём работ сделать и потом несколько лет снова ничего не менять."
    },
    {
      "id": 26970820,
      "author": "ghans",
      "datetime": "2024-06-25T09:09:02.000Z",
      "text": "У меня была похожая проблема, я тупо разделил сети.Ремонт - это да. Аргумент!"
    },
    {
      "id": 26970640,
      "author": "Black_Shadow",
      "datetime": "2024-06-25T08:37:04.000Z",
      "text": "Стандартный протокол, можно покупать любой девайс от любой экосистемы, и он заработает в Home Assistant, нет привязки к чужим облакам без перепрошивки, можно и без MQTT, ZHA работает без него, даже если в качестве шлюза сетевой девайс на Tasmota. Более медленный протокол никак не заметен для пользователя. Низкий расход энергии позволяет ставить выключатели и реле без нейтрали и без необходимости ставить конденсатор параллельно лампочке."
    },
    {
      "id": 26970706,
      "author": "Redwid",
      "datetime": "2024-06-25T08:44:32.000Z",
      "text": "Добавлю от себя. У ZigBee есть прямые биндинги, когда одно устройство, может управлять другим напрямую.И в общем, ZigBee быстрее срабатывают. К примеру у меня есть выключатель, который включает через вайфай реле лампу. Задержка от нажатия кнопки, до включения очень хорошо заметна. На ZigBee, срабатывание происходит без видимых задержек."
    },
    {
      "id": 26970854,
      "author": "ghans",
      "datetime": "2024-06-25T09:19:04.000Z",
      "text": "Спасибо. Надо будет попробовать. Я в своё время нахлебался с Z-wave. Постоянные задержки, потери команд, отваливания. С тех пор покупаю только Wifi и перешиваю.Единственно, что смущает, это MQTT. Я был очень рад в своё время, когда смог от него отказаться, перейдя на ESPHome. Но, видимо, это небольшая плата за универсальность.Правильно я понимаю, что абсолютно любые Zigbee девайсы могут управляться локально через шлюз без потери функциональности?2 Black_shadow. У меня, кажется, скользнул палец и я нажал минусик вместо плюсика. Обратно не получается вернуть почему-то. Сорян"
    },
    {
      "id": 26972812,
      "author": "udvnl",
      "datetime": "2024-06-25T16:55:20.000Z",
      "text": "А устройства УД работающие на WiFi, не влияют на другие устройства с передачей данных (ПК/ноутбуки/смартфоны и т.д.)? Частота та же, но разве она не забивается?И количество устройств WiFi на стандартном роутере от провайдера не напомните?Скорость передачи для вкл/выкл или показаний датчиков совсем не критична, а вот влияние на основную сеть лучше минимизоровать."
    },
    {
      "id": 26973194,
      "author": "adeep",
      "datetime": "2024-06-25T19:20:49.000Z",
      "text": "хуже, что 99% их работает только на 2.4, которые выглядят часто очень печально в многоэтажках. zigbee обычно работает стабильнее, но и там очень много подводных камней"
    },
    {
      "id": 26973288,
      "author": "ghans",
      "datetime": "2024-06-25T19:47:27.000Z",
      "text": "Так в том то и дело, что минимизировать не получается. Частота та же. WiFi устройства как-то между собой разбираются, а когда кто-то посторонний лезет туда же - начинаются чудеса. С другой стороны, Вы правы. Конечно, за WiFi нужен глаз да глаз. Это верно. Я везде где можно и где нельзя кидаю провод, всех, кто может работать на 5 Гигах - насильственно туда загоняю, в первую очередь айфоны дочерей, все роутеры работают на минимально возможной в этой точке мощности и соединены между собой проводом. В многоэтажках, понятно, так не работает. Обязательно найдётся сосед - идиот, который засрёт весь эфир."
    },
    {
      "id": 26970204,
      "author": "Woffko",
      "datetime": "2024-06-25T07:04:23.000Z",
      "text": "у меня в интеграции Zigbee2MQTT уже больше года трудиться Zigbee Координатор Sonoff ZBDongle-E(порядка 30 устройств) стабильно и без сбоев, почему вам потребовался Dongle-P?"
    },
    {
      "id": 26970234,
      "author": "empenoso",
      "datetime": "2024-06-25T07:09:12.000Z",
      "text": "Потому что часть функционала была недоступна"
    },
    {
      "id": 26970346,
      "author": "Woffko",
      "datetime": "2024-06-25T07:41:43.000Z",
      "text": "а можете уточнить какая часть функционала не доступна?"
    },
    {
      "id": 26970546,
      "author": "DaemonGloom",
      "datetime": "2024-06-25T08:22:08.000Z",
      "text": "Как понимаю,empenosoпросто не пробовал запустить Dongle-E с Z2M. А в ZHA ожидаемо нет многих настроек вне зависимости от используемого координатора."
    },
    {
      "id": 26970882,
      "author": "empenoso",
      "datetime": "2024-06-25T09:25:57.000Z",
      "text": "Да, изначально я хотел воспользоваться Zigbee Home Automation (ZHA)."
    },
    {
      "id": 26971114,
      "author": "Woffko",
      "datetime": "2024-06-25T10:22:14.000Z",
      "text": "у меня возник вопрос зачем покупать Dongle-P?, если Z2M прекрасно работает с Dongle-E, причём он есть в списке рекомендуемых у Z2M."
    },
    {
      "id": 26971124,
      "author": "empenoso",
      "datetime": "2024-06-25T10:23:26.000Z",
      "text": "Потому что изначально я хотел использовать ZHA"
    },
    {
      "id": 26970282,
      "author": "dmitriinikolaev",
      "datetime": "2024-06-25T07:24:32.000Z",
      "text": "Время не стоит на месте,  современные модели предлагают улучшенную функциональность, такую как поддержка новых стандартов, улучшенная безопасность и совместимость с умными домами."
    },
    {
      "id": 26970824,
      "author": "hinomen",
      "datetime": "2024-06-25T09:09:40.000Z",
      "text": "В году 2018 в квартире тоже слегка \"подсел\" на sonoff датчики и релешки: сенсорные выключатели(не практично оказалось), открытие подъездного домофона со смартфона(удобно), датчик открытия двери(бесполезно) и ещё пару мелочей. Потом построил дом и стал больше использовать sonoff, в частности поставил на коллекторы тёплого пола реле  (POW R2) для автоматического управления термоприводами. Часть перепрошивал на М1(чуть больше функционала даёт, но оно того не стоит). В итоге из 36 штук одна треть этих реле постепенно вышла из строя. Причин так и не выяснил. Сейчас всё это забросил, так как нормально заставить всё это работать как надо - много времени уходит. Хотя можно использовать \"из коробки\", меньше проблем и удобства."
    },
    {
      "id": 26970826,
      "author": "Kuresha",
      "datetime": "2024-06-25T09:09:51.000Z",
      "text": "Уже более 10 лет пользуюсь умным домом, основанным на Sonoff. Пришло время тоже что-то менять и улучшать. Автор статьи использует Sonoff довольно поверхностно (я не беру в расчет кастомные прошивки, мне кстати хватает и стока).Сейчас думаю тоже начать использование датчиков на Zigbee.Из туду-листа у меня сейчас две задачи:Настроить автоматизированную работу кондиционеров:по датчику движения + открытия закрытия двери определять, есть ли в помещении человек, или шарится собака, в зависимости от этого выбирать силу выдува воздуха кондиционера (так как при сильном выдуве, собака начинает кашлять). Сюда же добавить выбор устройства удаленного управления кондиционером (к сожалению, у меня кондиционеру с примесью свежего воздуха с улицы уже 15 лет и крушить потолок ради замены я не намерен).Использование датчика освещенности. Установка датчика рядом с постоянным источником освещения вне помещения, чтобы определять, запитан ли дом от основного или резервного питания. В зависимости от этого, выбор сценариев автоматического включения для продолжения работы таких бытовых приборов, как кондиционеры, посудомоечная, стиральная, сушильная машины. Думаю, тут Sonoff в чистом виде не справляется, нужны автономные датчики на Zigbee."
    },
    {
      "id": 26970868,
      "author": "hinomen",
      "datetime": "2024-06-25T09:23:20.000Z",
      "text": "По пункту 2: при отключении основного питания  на районе разве не отключается и то, что вне помещения рядом? Если у вас резервное питание организовано через АВР, то можно на его щитке перехватить сигнал об отключении основного питания(и обратно)."
    },
    {
      "id": 26976854,
      "author": "Kuresha",
      "datetime": "2024-06-26T19:48:04.000Z",
      "text": "Резервное питание организовано не в щитке. Со внешнего щитка, питание идет на врутренний щиток. Через внутренний щиток, питание проходит по помещению к участку, где находятся источник резервного питания, проходя через него, ток возвращается обратно на внутренний распределительный щиток по второй линии. При отключении основного внешнего источника питания, именно отключается освещение во вне. Таким образом, датчик освещенности, установленный возле лампы, которая питается ТОЛЬКО от внешнего питания, будет сигнализировать о том, питание в помещении идет от внешнего источника, или от внутреннего резервного. В зависимости от этого будут розданы разрешения на запуск кондиционеров, посудомоечной (продолжение мойки), стиральной машины (продолжение стирки)"
    },
    {
      "id": 26971940,
      "author": "SOvA13",
      "datetime": "2024-06-25T13:08:11.000Z",
      "text": "Так у sonoff есть датчики с мониторингом питания.Напримерhttps://www.sonoff.ru/product/wi-fi-rele-sonoff-powr320d-eliteПоставить на вводе 2 штуки и настроить отправку при попадании питания."
    },
    {
      "id": 26976838,
      "author": "Kuresha",
      "datetime": "2024-06-26T19:41:25.000Z",
      "text": "Немного не то. Мне надо знать, при постоянно включенном питании внутри, откуда приходит питание: от резервного источника, или от основной сети."
    },
    {
      "id": 26976898,
      "author": "Kuresha",
      "datetime": "2024-06-26T20:06:36.000Z",
      "text": "Мне надо не «пропадание» питания, а «откуда» идет питание.  Тем более, что мне не нужно «сообщение о потере сети». А в сценариях «Если…» нет опции отправить сигнал на другое устройство при потере сети.Пример: стиралка запускается ночью в 00:00. В 01:00 пропало питание извне. Включилось резервное питание. Мне необходимо узнать, откуда сейчас идет питание. Если во вне лампочка не горит, то идет сигнал отключить питание сонофф на стиралке. В 02:00 внешнее питание восстановилось. Внутри питание и не пропадало. Но датчик освещенности знает, что питание идет уже извне и подает сигнал соноффу на стиралке включиться и продолжить работу.Лампа освещения во вне включена всегда и освещение пропадает только тогда, когда нет освещения во вне."
    },
    {
      "id": 26980526,
      "author": "SOvA13",
      "datetime": "2024-06-27T19:28:01.000Z",
      "text": "Мне кажется, вы городите велосипед.У вас главное и резервное питание откуда приходят?Или резервное это ИБП в доме?Вобще, ставите на главный ввод любое реле, и ставите его на мониторинг ну скажем 5 секунд. Нет ответа, значит нет питания на главном вводе. Зачем изобретать мониторинг какой-то лампочки? Тем более она кушает электричество."
    },
    {
      "id": 27010034,
      "author": "Kuresha",
      "datetime": "2024-07-05T14:43:47.000Z",
      "text": "Ремонт сделан. И проводка переделываться не будет."
    },
    {
      "id": 26973218,
      "author": "4chemist",
      "datetime": "2024-06-25T19:25:17.000Z",
      "text": "Развернул HomeAssistant в виртуальной машине. Чтобы не пробрасывать USB свисток с координатором в виртуальную машину, интеграция Zigbee2MQTT настроена использовать координатор через wifi tcp2serial мост на железе WeMos D1 mini, прошивка называется esp-link. В настройках последовательного порта у Zigbee2MQTT надо ввести адрес и порт, у меня \"tcp://192.168.31.4:23\". Эта связка работает у меня уже года два, граблей и зависаний не вылезло совсем. Просто дубово работает как надо. Интеграция ESPHome тоже работает великолепно, прошивки компилируются, устройства обновляются через OTA. Удобно, что координатор можно разместить в центре квартиры, а компьютер с HomeAssistant в укромном месте. И настроек, при переносе виртуальной машины с HomeAssistant на другое железо, будет меньше."
    },
    {
      "id": 26975262,
      "author": "Alemelnikov",
      "datetime": "2024-06-26T10:27:27.000Z",
      "text": "Для новичков маловато подробностей, а для тех у кого умный дом уже есть выглядит не очень интересно=)Но с ремонтом поздравляю!Сам недавно переехал с умного дома из коробки (в основном xiaomi с материковым китаем) на HA в докере + z2m на Малине 4 . В новом панельном доме wifi 2.4 зашумлен, конечно же, а так как изначально умными девайсами заблаговременно закупался, то почти все освещение на нем=( Как итог: более 40 девайсов в сети wifi. Были задержки, было сложно, особенно с интеграцией алисы - управляющие сигналы долго проходили больно. С переездом на роутер от xiaomi стало полегче, но не панацея ни разу=( После переезда на ХА и локализации всей систем дома - намного стабильнее работа, на порядки! Но и затраты времени были немаленькие на настройку, которая до сих пор продолжается.Почему zigbee, а не wifi: энергоэффективность, ячеистая топология, возможность работы сотен датчиков в одной сети без проблем с конкуренцией за частоты\\ресурсы. Есть еще z-wave и thread - они по идее еще больше подходят для умного дома и thread даже в производствах используется успешно, но с ними еще больше времени необходимо тратить на настройку и танцы с бубнами (да и инфы банально меньше, особенно для такого неподготовленного пользователя как я=)), а бенифитов от этого не досточно на мой взгляд.Но идея и смысл статьи для меня остаются загадкой..."
    },
    {
      "id": 27001824,
      "author": "diaskzn",
      "datetime": "2024-07-03T10:51:41.000Z",
      "text": "Sonoff может локально работать без перепрошивки через Home Assistant. Интернет нужен только при первом подключении."
    }
  ]
}