{
  "url": "https://habr.com/ru/articles/807961/comments/",
  "article_id": 807961,
  "title": "Как исправить изменившийся номер договора в нескольких сотнях Эксель файлов менее чем за минуту",
  "comments": [
    {
      "id": 26732927,
      "author": "evgepet",
      "datetime": "2024-04-17T01:35:32.000Z",
      "text": "Странно. Кто-то минуснул пост, но объяснять причину в каментах не захотел... Я, например, люблю использовать VBA для снижения объёма рутины при работе с Excel. Думаю, пост поможет начинающим (и не только) скриптописателям!"
    },
    {
      "id": 26732959,
      "author": "empenoso",
      "datetime": "2024-04-17T02:07:02.000Z",
      "text": "Спасибо ?"
    },
    {
      "id": 26734141,
      "author": "slepmog",
      "datetime": "2024-04-17T08:18:18.000Z",
      "text": "Я бы тоже минуснул, но мне нельзя.Помимо фейспальмово начальной темы, вопросы по которой на Stack Overflow закрывают как дубликаты в течение пары минут, здесь куча всякой другой фигни.Используется FSO, значит код не запустится на Office for Mac.Делается вид, что все переменные культурно объявлены. На самом деле все переменные объявлены внутриReplaceTextInFiles(), где они не используются. А используются они вProcessFiles(), где они не объявлены. Если поставитьOption Explicitнаверх, где оно всегда должно быть, всё это перестанет компилироваться, и поделом.Используется странный способ выявления файлов xlsx, который будет срабатывать на любых файлах, у которых.xlsxвстречается где угодно в имени, вместо правильногоfs.GetExtensionName.Используется конструкцияIf LCase(file.Name Like \"*.xlsx*\"), которая не имеет смысла. ОператорLikeвозвращаетTrueилиFalse,LCaseнеявно преобразует это в строку\"True\"или\"False\", возвращая строку\"true\"или\"false\", после чего эта строка анализируется черезIf, для чего она неявно парсится обратно вTrueилиFalse.Используется простейшая формаReplace, которая заменит не только номер договора, но и всё остальное, что случайно содержит что-то вроде номера договора где-то в середине - концептуально та же история, что с выявлением файлов xlsx. А выявление даты, к тому же, имеет шанс выдать не только ложное срабатывание, но и ложное несрабатывание, если оная дата где-то отформатирована иначе.Отсутствует обработка ошибок, а Excel очень сильно любит выдавать бессмысленные ошибки при попытке массовой обработки кучи файлов - даже если перед началом отключить обработку событий и перерисовку экрана, что здесь не делается, так что первый встреченный интересный файл закончит обработку всех файлов."
    },
    {
      "id": 26732969,
      "author": "Serg7777",
      "datetime": "2024-04-17T02:18:18.000Z",
      "text": "Мене чем за минуту с Workbooks.Open мне не удавалось обработать несколько сот файлов в реальном сценарии, файлы обрабатывались по 4 секунды, все что можно отключить, отключал. Думал статья посвещена обходу этой проблемы."
    },
    {
      "id": 26733001,
      "author": "empenoso",
      "datetime": "2024-04-17T02:58:23.000Z",
      "text": "Да, вы правы - \"менее чем за минуту\" скорее для красного словца - это выражение в сравнении с тем как если бы делать описанные замены вручную..."
    },
    {
      "id": 26745321,
      "author": "sci_nov",
      "datetime": "2024-04-20T12:03:04.000Z",
      "text": "Возможно, питоновские библиотеки для решения данной задачи были бы уместнее."
    },
    {
      "id": 26733085,
      "author": "Cere8ellum",
      "datetime": "2024-04-17T03:47:14.000Z",
      "text": "Недавно пришлось скрипт написать, который текст даты форматировал в дату, чтобы в фильтре эти самые даты группироваться могли. Сделал 4 варианта, и каждый из них имел свои плюсы/минусы и время выполнения. Это я к тому, что время выполнения при переборах в vba проблема известная. Нужно искать оптимальное решение в каждом частном случае."
    },
    {
      "id": 26736355,
      "author": "pankraty",
      "datetime": "2024-04-17T17:33:42.000Z",
      "text": "Вот конкретно проблему поиска и замены в сотнях файлов XLSX как раз можно было решить за секунды плюс несколько минут на написание PowerShell скрипта, если воспользоваться тем фактом, что XLSX - это zip-архив с XML-ками. Макросы я бы оставил для каких-нибудь более сложных манипуляций."
    },
    {
      "id": 26733063,
      "author": "Cere8ellum",
      "datetime": "2024-04-17T03:39:31.000Z",
      "text": "Эх, что только не творил на VBA. Было время конечно. Сейчас ушёл на nodejs + exceljs, если нужно что-то более менее объёмное реализовать, потому что удобнее. Для мелочей, да, VBA прям выручает."
    },
    {
      "id": 26740661,
      "author": "Alexufo",
      "datetime": "2024-04-18T22:57:56.000Z",
      "text": "nodejs + exceljs - аналогично, учитывая что еще нода вебсервером выступает, эксель совсем с малым vba получается"
    },
    {
      "id": 26733167,
      "author": "KEugene",
      "datetime": "2024-04-17T04:39:06.000Z",
      "text": "Если в начале скрипта отключить автопересчет формул и (не помню точно) перерисовку окна, то дело пойдет намного быстрее. Только не забыть вернуть обратно.Ну, еще можно все оформить в виде vbs скрипта. Тогда интерфейс экселя не будет отображаться, что еще больше ускорит процесс (вместе с отключением пересчета формул). В таком случае скрипту можно передавать параметром с какой папки начинать копать. Хотя это потребует навыков работы с консолью."
    },
    {
      "id": 26733233,
      "author": "RealSup",
      "datetime": "2024-04-17T05:01:47.000Z",
      "text": "Спасибо за детальное описание, подходит даже для тех, кто \"не в теме\".Вопрос, а можно ли избежать открытия каждого файла, просто подключаясь к нему через VBA, или вообще рассматривая книгу как архив?"
    },
    {
      "id": 26733647,
      "author": "65766f6c",
      "datetime": "2024-04-17T06:31:22.000Z",
      "text": "я не проверял, но первое что гуглится:Dim app as New Excel.Application\napp.Visible = False 'Visible is False by default, so this isn't necessary\nDim book As Excel.Workbook\nSet book = app.Workbooks.Add(fileName)\n'\n' Do what you have to do\n'\nbook.Close SaveChanges:=False\napp.Quit\nSet app = Nothingто есть попробуйте создать отдельный инстанс application, и уже в него можно будет добавлять workbooks сколько потребуется.но вообще я бы присмотрелся к другому ЯП например c# + npoi"
    },
    {
      "id": 26733715,
      "author": "economist75",
      "datetime": "2024-04-17T06:47:21.000Z",
      "text": "Для общего развития и сравнения: как это делается в свободном офисном пакетеOpenOffice|LibreOffice, \"неизбежно приходящем\" на смену MSO (но и в MSO это можно, просто не так изящно):Номер-Дату вычисляем с =СМЕЩ()+1 и =СЕГОДНЯ() по журналу регистрации или берем готовую из системы EDM (документооборота), ежли на такую уже разорилисьВставка любых авто-обновляемых полей из любых источников в OpenOffice|LibreOffice (Word/Writer-форматы и Excel/Calc-форматы) делается единообразно, по нажатиюCtrl+Shift+F4. Серое поле обновляется на выбор: при открытии, по таймауту, по событию, по кнопке, вручную.Большим плюсом является \"Рассылка/Слияние\" для нескольких документов (ведь шеф приехал и подписал сразу десяток договоров, не будем же мы 40 раз менять VBA-код, это тупо тяжело). Рассылка также доступна по нажатию Ctrl+Shift+F4, но вдобавок к имеющимся интерактивным фильтрам дает всю мощьSQL-отбора(потому что Ctrl+Shift+F4 ведет в \"витрину данных\" в OpenOffice|LibreOffice, в которой отображаются данные разных SQL БД, 1С, TXT/CSV/HTML-файлов и вообще чего угодно. Рассылка производит один сводный или много офисных или PDF-файлов, или email-писем с полность.готовым текстом письма, остается нажать кнопку Отправить в почтовике по умолчанию.SQL-отбор позволяет, скажем, убрать те \"мелкие, до 100 тыс. руб.\" счета/договоры, которые подписывает \"Первый зам\", еще не вернувшийся с Мальдив. Но на практике SQL удобен  для мелких правок налету, когда в сами Excel-таблицы лезть лень или некому."
    },
    {
      "id": 26733745,
      "author": "empenoso",
      "datetime": "2024-04-17T06:53:15.000Z",
      "text": "А автозамену во множестве файлов без ручной манипуляции как сделать-то?"
    },
    {
      "id": 26734371,
      "author": "economist75",
      "datetime": "2024-04-17T09:18:23.000Z",
      "text": "Ответ: сгенерировать файлы заново, Рассылкой."
    },
    {
      "id": 26733763,
      "author": "scruff",
      "datetime": "2024-04-17T06:56:48.000Z",
      "text": "CTRL+F найти, заменить на...Не благодарите."
    },
    {
      "id": 26733863,
      "author": "empenoso",
      "datetime": "2024-04-17T07:15:57.000Z",
      "text": "Вы видимо статью всё-таки не читали, этот вариант уже был указан ?"
    },
    {
      "id": 26738211,
      "author": "scruff",
      "datetime": "2024-04-18T09:07:07.000Z",
      "text": "Видимо...Просто в тривиальных задачах предпочитаю с макросами не связываться, потому что, сложно, ненадёжно, капризно."
    },
    {
      "id": 26747195,
      "author": "dyadyaSerezha",
      "datetime": "2024-04-21T10:47:00.000Z",
      "text": "Несколько сот раз... Это займёт день или больше. Ещё и проверять потом."
    },
    {
      "id": 26734287,
      "author": "vis_inet",
      "datetime": "2024-04-17T08:59:08.000Z",
      "text": "Может быть, вам нужно организовать работу с документами так, чтобы реквизиты договора были только в одном (ключевом) файле, а все остальные файлы по этому договору имели ссылку на ячейку(и) с реквизитами договора в этом ключевом файле?"
    },
    {
      "id": 26734355,
      "author": "empenoso",
      "datetime": "2024-04-17T09:15:36.000Z",
      "text": "К сожалению не всегда всё так прозрачно"
    },
    {
      "id": 26734443,
      "author": "economist75",
      "datetime": "2024-04-17T09:33:50.000Z",
      "text": "Действительно, в некоторых случаях очень важно максимально усложнить и запутать ситуацию. Например, пусть ежегодно все N договоров компании будут c №1 от 01 января. Это просто чудесно и вот почему: если брать откаты и попасться - суд не сможет доказать N-1 эпизодов, поскольку такова судебная практика. Меньше срок - больше времени потратить нечестно нажитое, профит.Система работы с документами должна исключать саму необходимость \"перебивать\" номера и даты. Если взять за пример цифровизацию госуслуг - то это уже работает. Вы, если работали с госорганами, наверняка уже сталкивались с документами (госэкспертизой итп), на которых просто нет даты и иногда нет даже номера, но зато есть ЭП (УКЭП) автора, которая все что нужно (и дату с номером) - прекрасно и универсально заменяет. Точное время (+хэш) вообще способно заменить всё.Кто-то скажет: но ведь неудобно! Да, но скорее просто непривычно. И как только вы введете документ в свою систему EDM-документооборота - у вас появится № и текущая дата, причем юридически значимые, а не эта бутафория в шапке с \"Утверждаю...\". Например, если вы получили заключение после январских праздников, то все праздники \"прав\" у вас не было, какая бы дата на нем не стояла."
    },
    {
      "id": 26735261,
      "author": "PereslavlFoto",
      "datetime": "2024-04-17T12:39:17.000Z",
      "text": "Как в этом примере правильно оформить документ после январских праздников, чтобы он был подписан и получен ранее январских праздников?"
    },
    {
      "id": 26736057,
      "author": "economist75",
      "datetime": "2024-04-17T15:47:47.000Z",
      "text": "До подписания второй подписью (последней) - у договора нет даты. Да и номер \"проекту договора\" ни к чему.Нет протухших реквизитов - нет нужды их менять. А потом, после подписей, вставить их - надо. Техн аспект я выше написал."
    },
    {
      "id": 26736075,
      "author": "PereslavlFoto",
      "datetime": "2024-04-17T15:51:38.000Z",
      "text": "Вы совершенно правы. Дата ставится после подписи. Например, первая сторона подписала 12 января, вторая сторона подписала 6 февраля, а дата начала действия договора — 11 декабря предыдущего года. Всё это время стороны работали совместно по этому договору, однако не имели никакой необходимости подписывать его.И тут возникает очень непростой вопрос к электронным средствам подписи документов. Как правильно подписать документ задним числом, если этот документ начал действовать задолго до его подписания?"
    },
    {
      "id": 26736137,
      "author": "Kazehay",
      "datetime": "2024-04-17T16:10:36.000Z",
      "text": "В тексте документа указать \"дата начала действия договора  на основании ранее подписанных документов....\"?"
    },
    {
      "id": 26736143,
      "author": "PereslavlFoto",
      "datetime": "2024-04-17T16:13:07.000Z",
      "text": "То есть надо будет потом ещё какие-то документы подписать, «ранее подписанные»? А как их подписать?Повторю. 11 декабря две стороны пришли к согласию и начали работать. 12 января первая сторона подписала договор, потому что раньше это никому не было нужно. 6 февраля вторая сторона подписала договор, потому что наконец-то нашла время на это. Всё это время, два месяца, стороны успешно работали по договору, который им вообще не было нужды подписывать."
    },
    {
      "id": 26736163,
      "author": "economist75",
      "datetime": "2024-04-17T16:16:57.000Z",
      "text": "ВС РФ: Важен не договор, а другие документы и действия сторон. От них следуют сроки, обязательства и размер нарушения прав."
    },
    {
      "id": 26736179,
      "author": "economist75",
      "datetime": "2024-04-17T16:20:55.000Z",
      "text": "ЭП ставится быстро, гораздо быстрее бумажной. Законодатель это подчеркнул особо: никаких ЭП подписей задним числом делать не надо и невозможно. Подписывайте ЭП сразу или при первой возможности."
    },
    {
      "id": 26740229,
      "author": "vis_inet",
      "datetime": "2024-04-18T19:00:19.000Z",
      "text": "стороны работали совместно по этому договору, однако не имели никакой необходимости подписывать егоА как вы будете в случае чего судиться с такими договорами?"
    },
    {
      "id": 26740615,
      "author": "PereslavlFoto",
      "datetime": "2024-04-18T22:07:55.000Z",
      "text": "Ну так через месяц подписали.И не по всякому договору надо судиться. Есть много договоров, по которым вовсе не надо судиться."
    },
    {
      "id": 26734959,
      "author": "omgiafs",
      "datetime": "2024-04-17T11:20:55.000Z",
      "text": "Если пройти несколько итераций таких костылестроений, то можно изобрести СЭД."
    },
    {
      "id": 26735083,
      "author": "vis_inet",
      "datetime": "2024-04-17T11:54:36.000Z",
      "text": "Там могут быть не только Excel файлы, но ещё и куча всяких других."
    },
    {
      "id": 26735393,
      "author": "Ivan22",
      "datetime": "2024-04-17T13:12:08.000Z",
      "text": "ты еще предложи базу данных завести"
    },
    {
      "id": 26735397,
      "author": "vis_inet",
      "datetime": "2024-04-17T13:14:16.000Z",
      "text": "Была такая мысль, не стал писать.Хоть сделали бы свои файлы без дублирования ключевых реквизитов."
    },
    {
      "id": 26735457,
      "author": "Kahelman",
      "datetime": "2024-04-17T13:22:09.000Z",
      "text": "Если надо быстро, чтобы уложиться в отведённую автором минуту или около того:Предполагаю что дата и номер находится примерно в известном месте excel листа.Ловкость рук и никакого шаманства:)Пишем скрипт на bash+ Awk, который открывает xlsx как zip файл.Далее просто парусим xml из которого он состоит.Преимущество в том, что в отличие от excel + vba можно запустить параллельную обработку. Да и файлы с помощью find искать проще будет.Придётся правда позаморачиваться с обработкой строк, поскольку  excel как правило хранит их а отдельной коллекции а в данных использует ссылку.Но проблема решаемая :)Месье знает толк в извращениях :)Я так Парсинг данных делал чтобы пользователь мог спокойно загружать формы с excel. На серваке excel не запустишь :)"
    },
    {
      "id": 26735707,
      "author": "itsWoland",
      "datetime": "2024-04-17T14:18:27.000Z",
      "text": "Я оперировал экселевскими файлами через openpyxl"
    },
    {
      "id": 26736085,
      "author": "economist75",
      "datetime": "2024-04-17T15:54:18.000Z",
      "text": "Да, на Python с этой либой это займет 10 строк кода и примерно 10 минут на написание с нуля. Но особых плюсов от VBA нет. Они в EDM, базе данных (реестре) договоров, а это м.б. даже Excel/Calc-файл (таблица).Красивый договор в Excel не сделать, нужен Word, а лучше Writer из LibreOffice. Там все решается по Ctrl+Shift+F4"
    },
    {
      "id": 26740663,
      "author": "Alexufo",
      "datetime": "2024-04-18T22:59:19.000Z",
      "text": "Но особых плюсов от VBA нет.кроме одного - если ничего нельзя на компе пользователя, то больше ничего не остается))"
    },
    {
      "id": 26737145,
      "author": "nexa0984",
      "datetime": "2024-04-18T03:54:13.000Z",
      "text": "Chatgpt и python, т не нужны никакие vba-скрипты"
    },
    {
      "id": 26747219,
      "author": "chesser69",
      "datetime": "2024-04-21T10:58:12.000Z",
      "text": "Это можно сделать на любом удобном для тебя языке программирования с модулем доступа к офису. В своё время, я делал всю автоматизацию по отчётам на java. Искал бы, конечно, через регулярку."
    }
  ]
}