{
  "url": "https://habr.com/ru/articles/811681/comments/",
  "article_id": 811681,
  "title": "Как заставить рулонные шторы поумнеть — дешевый способ автоматизировать открытие/закрытие без необходимости питания 220В",
  "comments": [
    {
      "id": 26843987,
      "author": "QwertyOFF",
      "datetime": "2024-05-21T00:54:31.000Z",
      "text": "Мне казалось что эра 433 МГц прошла еще лет десять назад. Неужели нет нормальных готовых решений со стабильным управлением и обратной связью когда софт знает точно в каком там положении штора?Заложить проводку в стены на стадии ремонта, но потом вывести ее вот так на виду с торчащим блоком питания от телефона, а не установив AC-DC преобразователь в коробке в стене или за натяжным потолком, это какой-то особый вид дизайнерского извращения?"
    },
    {
      "id": 26844015,
      "author": "empenoso",
      "datetime": "2024-05-21T01:48:53.000Z",
      "text": "Окна где обычные, не рулонные шторы - там закрылось шторой."
    },
    {
      "id": 26844253,
      "author": "shadovv76",
      "datetime": "2024-05-21T04:49:20.000Z",
      "text": "не хочу душнить, но искра от БП на шторы и все не закончиться черным пятном на розетке.я сам автоматизатор, но пожаробезопасность ставлю на уровне паранойи. у меня бывали случаи когда отгорал штырь от БП  и оставался в розетке, но это уже было давненько (еще ТОТ Китай).в целом считаю, если удобно, то использование 433 нормальный вариант. У меня на нем все датчики, но вот управление меня на нем очень напрягает в обслуживании.В частности бридж RF sonoff перешитый в тасмоту постоянно отваливается от сети и мне пришлось поставить под него управляемую розетку и перевключать по потери пинга из HA"
    },
    {
      "id": 26844261,
      "author": "shadovv76",
      "datetime": "2024-05-21T04:57:03.000Z",
      "text": "а еще курьёз ....в ванной реле при помехах в сети входит в решим прошивки дополнительного пульта и прошивает первый сигнал и это как правило входная дверь. и вот ты в ванной намылился и кто то пришел или ушел...."
    },
    {
      "id": 26849911,
      "author": "1CHer",
      "datetime": "2024-05-22T09:59:22.000Z",
      "text": "Паранойя на литиевые АКБ не волнует? ) Я бы не больше боялся бы )"
    },
    {
      "id": 26852901,
      "author": "shadovv76",
      "datetime": "2024-05-23T04:59:09.000Z",
      "text": "я эту проблему не отрицаю, но она слишком раздута на примере сильнотоковых (самокаты гироскутеры) применениях. для аккумов бытовой электроники это просто будет пук, вырвавшихся газов или просто вздутие. Но надо понимать, что на нормированной нагрузке такого не добиться (т.к. аккум просто просядет при КЗ). Кроме случаев перегрева аккума из-вне (как к примеру с телефонами). Розетка это совсем другой источник \"нескончаемой\" энергии. И гореть она будет пока все не выгорит. Именно слаботочные блоки питания горят ярче потому что не могут обеспечить токи КЗ для автоматов из за тонких проводов."
    },
    {
      "id": 26844393,
      "author": "lemonjke",
      "datetime": "2024-05-21T05:35:15.000Z",
      "text": "Электроприводы с обратной связью существуют и в продаже уже как несколько лет. Спрашивайте в профильные компаниях по изготовлению рулонных штор и жалюзи. На алиэкспрессе привод с обратной связью не купить, в России и СНГ есть одна компания с эксклюзивным правом продавать приводы с обратной с обратной связью."
    },
    {
      "id": 26844395,
      "author": "empenoso",
      "datetime": "2024-05-21T05:36:29.000Z",
      "text": "Цена наверное только не 3 т.р..."
    },
    {
      "id": 26844469,
      "author": "lemonjke",
      "datetime": "2024-05-21T06:04:49.000Z",
      "text": "Даже близко не три ? Но зато на объекте где в одной зоне много приводов, моторы с обратной связью при одиночном и групповом управлении начинают движение одновременно и с первого раза))"
    },
    {
      "id": 26844517,
      "author": "empenoso",
      "datetime": "2024-05-21T06:20:51.000Z",
      "text": "Несомненно это преимущество, но у меня эти дешёвые стоят в разных комнатах и после трёх повторов программно через home assistant шторы всегда в нужном положении потом - когда я их вижу"
    },
    {
      "id": 26853205,
      "author": "GrustniyNos",
      "datetime": "2024-05-23T06:29:31.000Z",
      "text": "10 от икеи в среднем стоят"
    },
    {
      "id": 26847801,
      "author": "wrewolf",
      "datetime": "2024-05-21T20:54:06.000Z",
      "text": "Не вводите людей в заблуждение.Брал привод с Али 4 тысячи в 21 году. 433 + zigbee. Установка положения округляет до 10% (грубо 10 положений доступно)Сейчас такое 5300 стоит (лот всё ещё продается)"
    },
    {
      "id": 26848153,
      "author": "DungeonLords",
      "datetime": "2024-05-22T01:30:27.000Z",
      "text": "Электроприводы с обратной связью заказывали? На али искать \"DC motor encoder\", стоить будет 500 руб...Пример"
    },
    {
      "id": 26846785,
      "author": "Formyurik",
      "datetime": "2024-05-21T15:45:16.000Z",
      "text": "Все бывает. Просто автор решил изобрести велосипед. Есть \"Рулонная штора Blackout ИКЕА ФЮРТЮР \". Отличная штора от IKEA. Бывают и блекаут и полупрорачные. Готовые, на разную ширину. Работают по протоколу Zigbee1) В комплекте кроме шторы идет еще и кнопка управления Zigbee и ретранслятор Zigbee.2) Питаются от аккумулятора, который можно ввтащить заряжать от USB. Но нужно еще умудриться его разрядить. Заряд держит очень долго.3) Может работать как автономно (управляться беспроводной кнопкой из комплекта) или можно подключить к Home Assistant через Zigbee2MQTT (полностью поддерживается).4) При подключении к Home Assistant можно открывать ее на любой процент (т.е. не обязательно полностью открывать или закрывать). При этом кнопку можно подулючить также к Home Assistant как отдельное устройство и использовать для любых автоматизаций. Кнопка двухпозиционная. Я одну позицию настроил на шторы, а другую на свет в этой комнате. Ретранслятор тоже привязал к HA, он пробрасывает Zigbee в удаленную комнату.5) При подключении через Home Assistant прекрасно управляется из алисы, в том числе процент открытия.Вообщем идеальное, готовое решение без костылей. Сейчас они немного дороговаты, но я недавно смог купить по акции за 5200."
    },
    {
      "id": 26849437,
      "author": "DMGarikk",
      "datetime": "2024-05-22T08:27:45.000Z",
      "text": "Сейчас они немного дороговаты, но я недавно смог купить по акции за 5200.5200 это в какой валюте?"
    },
    {
      "id": 26880967,
      "author": "Didimus",
      "datetime": "2024-05-30T11:25:59.000Z",
      "text": "А можно было солнечную батарею поставить. Как раз где штора, там свет"
    },
    {
      "id": 26843993,
      "author": "SpiderEkb",
      "datetime": "2024-05-21T00:57:55.000Z",
      "text": "А не слишком примитивно? Для того, чтобы вообще об этом думать...Нет, понять, что оно прикольно когда шторы сами по себе ездят... Но тем не менее...Мой опыт.В спальнях висят обычные шторы - это интерьерное решение. И там да. На ночь закрыто, днем открыто.Рулонные шторы висят в кабинете (окно на запад) и в общей комнате (гостиная с кухонной зоной) - два окна, одно на юг, второе на север.Реально используются только две - в кабинете и в гостиной на окне которое на юг. При этом используются в качестве защиты от солнца. Т.е. только тогда, когда солнце светит в глаза и мешает. И опускаются ровно настолько, чтобы в глаза не светило.И вот как прикажете это автоматизировать? Тут явно нужен как-то датчик, который будет реагировать на яркий солнечный свет. А скорее даже несколько датчиков на разных уровнях. Чтобы штора опускалась ровно настолько, насколько светит солнце (но не ниже). Особенно в кабинете - часа в три дня солнце светит так, что достаточно немного опустить штору, а часам к шести (это примерно летнее \"расписание\", зимой время другое) опускать нужно уже сильнее - угол изменился. А в пасмурный день вообще не надо...А просто опустить руками - я в кабинете это делаю не вставая со стула, просто протянув руку...Так вот стоит ли овчинка выделки в \"автоматизации\", которая заключается просто в \"открыть-закрыть\"?"
    },
    {
      "id": 26844017,
      "author": "empenoso",
      "datetime": "2024-05-21T01:57:50.000Z",
      "text": "Так получилось что в квартире 8 окон и именно в спальне я изначально решил никакой автоматизации не делать - во первых какое никакое физическое движение, а во вторых когда привод сломается - со светом спать лично мне очень неудобно.Поэтому на других окнах есть разные приводы, а спальне хотя есть розетки и они закрыты шторами, но никаких приводов нет"
    },
    {
      "id": 26844063,
      "author": "GennPen",
      "datetime": "2024-05-21T02:53:00.000Z",
      "text": "Тут явно нужен как-то датчик, который будет реагировать на яркий солнечный свет.Есть же датчики освещения. Поставить закрытие шторы при превышении определенного порога."
    },
    {
      "id": 26844113,
      "author": "SpiderEkb",
      "datetime": "2024-05-21T03:38:04.000Z",
      "text": "Есть. Но датчик должен быть расположен так, чтобы реагировал в тот момент, когда солнце начинает в глаза светить. А не просто в окошко. Свет работать не мешает. Мешает когда солнце светит через окно в глаза."
    },
    {
      "id": 26844167,
      "author": "GennPen",
      "datetime": "2024-05-21T04:12:24.000Z",
      "text": "Но датчик должен быть расположен так, чтобы реагировал в тот момент, когда солнце начинает в глаза светить.Ну, поставить в нужное место. Они все сейчас беспроводные, провода не нужно тянуть."
    },
    {
      "id": 26844551,
      "author": "abutorin",
      "datetime": "2024-05-21T06:32:09.000Z",
      "text": "Солнце двигается по заранее известной траектории. Зная дату и время можно определить на какую величину нужно опускать штору. Датчик освещённости нужен чтобы знать \"солнце сейчас светит\". В результате алгоритм простой: 1. Есть солнце? 2. Рассчитываем величину опускания шторы в зависимости от даты и времени."
    },
    {
      "id": 26844573,
      "author": "empenoso",
      "datetime": "2024-05-21T06:36:25.000Z",
      "text": "Практично, но от времени года зависит"
    },
    {
      "id": 26844653,
      "author": "abutorin",
      "datetime": "2024-05-21T06:57:49.000Z",
      "text": "Да, для этого я и написал \"дата и время\".Вот например не плохой \"калькулятор\" солнца:https://www.suncalc.org/#/55.6627,37.5993,8/2024.05.21/09:55/1/3"
    },
    {
      "id": 26846605,
      "author": "fio",
      "datetime": "2024-05-21T15:01:45.000Z",
      "text": "По-моему, в HomeAssistant есть возможность задействовать гелиокалькулятор"
    },
    {
      "id": 26844209,
      "author": "pes_loxmaty",
      "datetime": "2024-05-21T04:31:52.000Z",
      "text": "Так вот стоит ли овчинка выделки в \"автоматизации\"Ну еще заявляется имитация жизнедеятельности при отъезде)А так, из эстетических побуждений еще можно. Например если не нравятся рулонные шторы и свисающие веревочки-цепочки, то можно всё это скрыть. Но конечно такая реализация с розетками (да еще двойными) под потолком - особый вид искусства."
    },
    {
      "id": 26844399,
      "author": "empenoso",
      "datetime": "2024-05-21T05:37:04.000Z",
      "text": "Вторая 12в"
    },
    {
      "id": 26844861,
      "author": "pes_loxmaty",
      "datetime": "2024-05-21T07:45:18.000Z",
      "text": "забавно было бы увидеть прибор с обычной вилкой, который ожидает получить через нее 12 вольтовое питание. Особенно смешно будет, если ребенок или незадачливый гость обнаружит такое устройство лежащим где-то на столе )))"
    },
    {
      "id": 26844951,
      "author": "empenoso",
      "datetime": "2024-05-21T08:13:30.000Z",
      "text": "Да, плохо что розетка внешне похоже на обычную"
    },
    {
      "id": 26846923,
      "author": "Noradan",
      "datetime": "2024-05-21T16:27:35.000Z",
      "text": "У меня от застройщика в тех местах, где предполагается кондей, есть розетка наверху) всё шторы туда подключил."
    },
    {
      "id": 26844561,
      "author": "DmSting",
      "datetime": "2024-05-21T06:33:30.000Z",
      "text": "И вот как прикажете это автоматизировать?К примеру у ABB в их инфраструктуре KNX есть логический модуль в котором реализована функция отслеживания положения солнца. Там в идеале ещё нужно добавлять уличную метеостанцию, но в целом не обязательно.Достаточно включить функцию, в ней задаются географические координаты дома, угол поворота стены/окна и расстояние от окна до стола. И оно рассчитывает \"вид из окна\" как солнце ходит по небу и выдаёт сигналы на управление шторами так, чтобы солнце всегда светило вниз под стол, но не выше столешницы.Эта же штука позволяет снизить теплопоступление в помещение, если система охлаждения не справляется."
    },
    {
      "id": 26844577,
      "author": "empenoso",
      "datetime": "2024-05-21T06:37:42.000Z",
      "text": "Очень круто, но цена там наверное х100 от китайского привода в статье?"
    },
    {
      "id": 26844609,
      "author": "DmSting",
      "datetime": "2024-05-21T06:46:20.000Z",
      "text": "Не, где-то х50 :DНо это только за логический блок, а если со всей обвязкой что дополнительно понадобится - то выйдет как-бы не х200, наверное."
    },
    {
      "id": 26844713,
      "author": "Mitya78",
      "datetime": "2024-05-21T07:12:03.000Z",
      "text": "Этих солнечных калькуляторов для любой платформы и устройства, на любой вкус.Можно и на компьютере считать.У нас в проекте ПЛК Сименс, на них считается положение солнца, скоро поставим метеостанцию, будем освещённость от неё получать. Можно в жаркий день шторы прикрывать автоматически по ходу движения солнца."
    },
    {
      "id": 26849481,
      "author": "rustavelli",
      "datetime": "2024-05-22T08:34:09.000Z",
      "text": "Звучит как описание плагина к home assistant."
    },
    {
      "id": 26846509,
      "author": "Xius",
      "datetime": "2024-05-21T14:34:14.000Z",
      "text": "Тут явно нужен как-то датчик, который будет реагировать на яркий солнечный свет. А скорее даже несколько датчиков на разных уровнях.Возможно обойтись одним датчиком освещенности для определения пасмурной или солнечной погоды. А слепящее Солнце, вернее, время, когда Солнце начинает слепить, определять по его углу (зависит от времени года, есть библиотека ephem у Python). Но это нужен интерес :-)"
    },
    {
      "id": 26846919,
      "author": "Lexiff",
      "datetime": "2024-05-21T16:26:49.000Z",
      "text": "А не проще считать угол солнца по календарю и времени?"
    },
    {
      "id": 26847637,
      "author": "serafims",
      "datetime": "2024-05-21T19:36:02.000Z",
      "text": "еще можно взять датчик освещенности, надеть на него конусообразную трубку и направить в сторону солнца по линии от места, где не должно слепить. Но это не слишком технологично))"
    },
    {
      "id": 26848145,
      "author": "VladimirChspb",
      "datetime": "2024-05-22T01:24:43.000Z",
      "text": "Для этого можно высчитываьь азимут и угол нахождения солнца и от этих данных создать автоматизацию. У меня так"
    },
    {
      "id": 26848147,
      "author": "Bobr12",
      "datetime": "2024-05-22T01:24:47.000Z",
      "text": "У нас в гостиной три окна, плюс второй свет, изначально задача была дистанционно управлять шторой на окне второго света, потому что физически туда со стандартной цепочкой рулонной шторы не дотянуться. У Tuya есть и zeegbee, и Wi-Fi привод для рулонных штор, подсоединяющийся к цепочке. Имеет встроенный аккумулятор, солнечную панель для подзарядки и внешний адаптер питания. Обратная связь, состояние уровня открытия в процентах. Интегрируется в Home Assistant.Оставшиеся окна вручную закрывать и открывать можно, но неудобно, поскольку надо тянуться за диван и обходить кресло. Два окна из трех выходят на Юг, напротив окон - тв. Удобно закрыть одной кнопкой на телефоне или с панели управления, когда необходимо. Солнце ушло - открыть обратно. Плюс сценарии: закрыть все вечером и открыть утром. В будние дни по расписанию, в выходной - одной кнопкой.В городской квартире я бы с радостью реализовал закрытие штор при включении света."
    },
    {
      "id": 26843999,
      "author": "BugM",
      "datetime": "2024-05-21T01:03:28.000Z",
      "text": "Как-то совсем по колхозному сделано. Неужели нельзя заплатив совсем немного побольше сделать нормально? Чтобы с процентом открытия и батарейкой на месяц (лучше год) хотя бы. И чтобы ничего лишнего не видно было."
    },
    {
      "id": 26844019,
      "author": "empenoso",
      "datetime": "2024-05-21T01:58:37.000Z",
      "text": "Я сам проектировал, обвинить некого. Батарейки в этом приводе как раз на месяц и хватает примерно"
    },
    {
      "id": 26844007,
      "author": "kmmbvnr",
      "datetime": "2024-05-21T01:18:49.000Z",
      "text": "Спасибо за толковое описание минусов дешёвого решения. Так как описано в статье делать не хочется"
    },
    {
      "id": 26844013,
      "author": "SpiderEkb",
      "datetime": "2024-05-21T01:46:25.000Z",
      "text": "Автоматизация ради автоматизации.встать с дивана, набрать чайниксесть на диван, сказать \"Алиса, включи чайник\"дождаться по Алиса скажет \"чайник вскипел\"встать с дивана, пойти налить чайвернуться на диван, выпить чай"
    },
    {
      "id": 26844021,
      "author": "empenoso",
      "datetime": "2024-05-21T01:59:20.000Z",
      "text": "Вроде не про чайник статья-то."
    },
    {
      "id": 26844033,
      "author": "SpiderEkb",
      "datetime": "2024-05-21T02:19:59.000Z",
      "text": "Это просто пример \"автоматизации ради автоматизации\". Т.е. не чтобы было удобно, функционально, а просто \"чтобы было\".Как пример - есть лестница. И два проходных выключателя. Внизу и вверху. Подходя к лестнице ткнул - свет включился. Отходя ткнул - выключился. Это просто быстрее чем два раза проговаривать \"Алиса включи свет на лестнице\", \"Алиса выключи свет на лестнице\".При этом свет на крыльце - по датчику движения. Отопление, вентиляция - полностью автоматизированы - поддерживают температуру, удаляют лишнюю влажность и т.п. Один раз настроил и оно работает.Со шторами - максимум что имеет смысл - пульт. Но не как описано, а нажал одну кнопку - штора опускается. Пока держишь кнопку. Отпустил - остановилась. Нажал другую - поднимается. Пока кнопку держишь.Любая автоматизация начинается с определения сценария как это будет использоваться и зачем. А дальше уже автоматизируем сценарий."
    },
    {
      "id": 26844043,
      "author": "empenoso",
      "datetime": "2024-05-21T02:29:14.000Z",
      "text": "На пульте как раз так и получается: можно выбрать канал какой именно шторой хочешь управлять, после этого нажимаешь например вниз ждёшь пару секунд нажимаешь стоп. То есть визуально контролируешь насколько хочется открыть штору и на каком окне."
    },
    {
      "id": 26844055,
      "author": "SpiderEkb",
      "datetime": "2024-05-21T02:40:13.000Z",
      "text": "Вопрос - стоит ли оно того?"
    },
    {
      "id": 26844099,
      "author": "empenoso",
      "datetime": "2024-05-21T03:29:07.000Z",
      "text": "У меня была задача сделать в тех комнатах которые я хочу автоматическое открытие утром и закрытие вечером. Эти дешёвые (относительно) приводы с этой задачей полностью справились"
    },
    {
      "id": 26844115,
      "author": "SpiderEkb",
      "datetime": "2024-05-21T03:38:37.000Z",
      "text": "Ну отлично тогда. Свою задачу решили и хорошо."
    },
    {
      "id": 26875107,
      "author": "nitro80",
      "datetime": "2024-05-29T06:26:37.000Z",
      "text": "Тоже мечтаю так сделать... Мне важно, что бы до часов 10 шторы были закрыты, и после 18 что бы закрывались... 1й этаж, собачники, да и просто соседи, постоянно под окнами шарахаются"
    },
    {
      "id": 26844203,
      "author": "13werwolf13",
      "datetime": "2024-05-21T04:30:35.000Z",
      "text": "Как пример - есть лестница. И два проходных выключателя. Внизу и вверху. Подходя к лестнице ткнул - свет включился. Отходя ткнул - выключился. Это просто быстрее чем два раза проговаривать \"Алиса включи свет на лестнице\", \"Алиса выключи свет на лестнице\".простите, но ваш пример не корректныйкричать на алису это не автоматизация, автоматизация это когда для тебя в коридоре свет всегда горит и ты даже не замечаешь что когда тебя нет рядом он не горит."
    },
    {
      "id": 26844271,
      "author": "SpiderEkb",
      "datetime": "2024-05-21T05:02:48.000Z",
      "text": "Тут вопрос в том, насколько все это оправданно. Т.е. сколько будет стоить замена \"ткнуть выключатель проходя мимо\". Денег и усилий. И соизмеримы ли затраты с удобством. И какие побочные эффекты возникнут.Скажу так - просто датчиком движения тут вряд ли обойдешься. Потому что свет должен включаться когда я именно к лестнице подхожу. Не просто мимо по коридору прошел. И человек, а не кошка или собака..."
    },
    {
      "id": 26844273,
      "author": "13werwolf13",
      "datetime": "2024-05-21T05:04:34.000Z",
      "text": "всё ситуативнов 90% случаев мне не лень ткнуть выключатель проходя мимоно оставшиеся 10% это когда в руках 100500 пакетов, на спине ребёнок, в зубах поводок и сильно торопишься. в таких ситуациях ооочень хочется чтобы свет включился сам, двери распахнулись заранее и всё такое."
    },
    {
      "id": 26847741,
      "author": "Rorg",
      "datetime": "2024-05-21T20:27:01.000Z",
      "text": "При моей \"конструкции коридора\" я заменил выключатели на герконы. По моему удобно."
    },
    {
      "id": 26844453,
      "author": "unC0Rr",
      "datetime": "2024-05-21T06:00:12.000Z",
      "text": "Пока кнопку держишь.На практике такое времяпрепровождения будет бесить, уж лучше вручную тогда крутить цепочку.  Опускаться-подниматься нужно или до отсечки, или до второго нажатия кнопки. Кроме того, на пульте может быть кнопка или несколько для заранее запрограммированных позиций на случай, если вам нравится (иногда) держать шторы в каком-то среднем положении."
    },
    {
      "id": 26844589,
      "author": "nronnie",
      "datetime": "2024-05-21T06:41:00.000Z",
      "text": "Голосовое управление это вообще, по-моему, очередная чушь. На телефонах голосовой набор был еще сто лет до появления смартфонов и я до сих пор ни разу не видел, чтобы им вообще хоть кто-то пользовался."
    },
    {
      "id": 26844605,
      "author": "empenoso",
      "datetime": "2024-05-21T06:44:14.000Z",
      "text": "Удобно сказать Алисе закрой все шторы"
    },
    {
      "id": 26846307,
      "author": "nronnie",
      "datetime": "2024-05-21T13:47:10.000Z",
      "text": "Но ведь еще удобней запрограммировать какую-нибудь кнопку на \"Закрыть все шторы\", разве нет?"
    },
    {
      "id": 26847757,
      "author": "Rorg",
      "datetime": "2024-05-21T20:31:41.000Z",
      "text": "Зависит от количества \"элементов\" и \"сценариев\", если можно так выразиться. Условно говоря, сколько кнопок нужно будет запрограмировать если у вас 3 комнаты, в каждой шторы, разные светильники и прочее. И есть десяток сценариев поведения."
    },
    {
      "id": 26847771,
      "author": "nronnie",
      "datetime": "2024-05-21T20:38:22.000Z",
      "text": "Ну так голосовое управление точно так же придется конфигурировать-программировать?"
    },
    {
      "id": 26847831,
      "author": "Rorg",
      "datetime": "2024-05-21T21:12:08.000Z",
      "text": "Проблема не в конфигурировать, проблема в количестве кнопок и/или пультов, которые мне надо будет с собой таскать или где-то искать/хранить. Возьмем мой сценарий. Я могу \"дозваться\" Сири из каждой комнаты. При этом я могу запустить как заранее подготовленные сценарии, так и просто сказать сделать отдельные действия.Например сценарий \"Я на сегодня все\": выключает свет в кабинете через 5 мин, приглушает свет во всех комнатах, закрывает шторы, включает телевизор, фоновую инструментальную музыку. А также проверяет напоминания. Если есть напоминание, что я хотел что-то почитать перед сном, его озвучит, и вместо включения телевизора, включит настенный светильник возле кровати и подсветку на книжных полках.Сценарий \"Я буду спать\": выключает весь свет, телевизор, включает фоновые звуки типа прибоя или дождя с таймером на час.Если я захочу что-то поменять, мне достаточно сказать об этом. Грубо говоря давай не дождь, а грозу. Или оставь светильник на 10 процентов яркости. Да и сделай звук тише. Кстати разбуди меня в 5:30, открой шторы и включи \"Так говорил Заратустра Штрауса\" на средней громкости.Сколько мне нужно таскать с собой кнопок/пультов для этого. И где их держать."
    },
    {
      "id": 26847915,
      "author": "nronnie",
      "datetime": "2024-05-21T22:00:50.000Z",
      "text": "проблема в количестве кнопок и/или пультов, которые мне надо будет с собой таскать или где-то искать/хранитьКнопки программные - простое приложение на смартфоне наподобие \"универсального пульта\" (вспомнился сразу сюжет из \"Сопрано\" где Крис с Поли пришли на квартиру к бывшему русскому десантнику разбираться :)))"
    },
    {
      "id": 26848123,
      "author": "BugM",
      "datetime": "2024-05-22T00:49:33.000Z",
      "text": "Удобно и то и другое чтобы было. Проснулся - удобно или выключатель над кроватью или «Алиса включи свет». Сидишь с телефоном в руках - удобно на нем кнопку нажать.Не ограничивайте себя. Сделайте оба сценария."
    },
    {
      "id": 26861915,
      "author": "empenoso",
      "datetime": "2024-05-25T09:43:29.000Z",
      "text": "?"
    },
    {
      "id": 26846633,
      "author": "fio",
      "datetime": "2024-05-21T15:08:29.000Z",
      "text": "Подходя к лестнице ткнул - свет включился. Отходя ткнул - выключился.Идеально было бы ничего не тыкать. Свет должен зажигаться и выключаться автоматически . В технических помещениях и коридорах. Есть датчики движения, присутствия"
    },
    {
      "id": 26846643,
      "author": "BugM",
      "datetime": "2024-05-21T15:10:33.000Z",
      "text": "Свет должен зажигаться и выключаться автоматически . В технических помещениях и коридорах. Есть датчики движения, присутствияЭто самое ужасное решение из возможных.Вышел и размахивай руками как дурак чтобы свет зажегся. Остановился посреди лестницы на минутку и свет погас. И снова махай руками, может повезет и датчик тебя увидит и включит свет. А может и не увидит и иди в темноте дальше.Проходные выключатели удобнее просто на порядок.Хуже всего такое же решение в туалете. Сиди и махай руками, если в темноте оказаться не хочешь."
    },
    {
      "id": 26846675,
      "author": "fio",
      "datetime": "2024-05-21T15:17:58.000Z",
      "text": "\"Вы просто не умеете их готовить\" (датчики)Лестница. Ставим 2 датчика - внизу и сверху, настраиваем, чтобы надёжно видели человека у лестницы. Алгоритм контроллера учитывает возможное залипание на лестнице. Для коротких лестниц можно использовать датчик присутствияТуалет. Ставим датчик присутствия (не движения!). Можно хоть уснуть на унитазе, свет будет гореть пока ты там."
    },
    {
      "id": 26846679,
      "author": "GennPen",
      "datetime": "2024-05-21T15:18:47.000Z",
      "text": "Вышел и размахивай руками как дурак чтобы свет зажегся. Остановился посреди лестницы на минутку и свет погас. И снова махай руками, может повезет и датчик тебя увидит и включит свет. А может и не увидит и иди в темноте дальше.Уже давно есть микроволновые датчики присутствия, лишенные этого недостатка. С ними можно хоть стоять на месте не двигаясь - они будут выдавать сигнал что кто то есть в помещении. К тому же, есть более продвинутые версии, определяющие положение (до нескольких одновременно) человека, можно сделать зонное освещение."
    },
    {
      "id": 26848221,
      "author": "Moog_Prodigy",
      "datetime": "2024-05-22T03:06:51.000Z",
      "text": "Вот например HLK-LD2450 позволяет детектить до трех людей на расстоянии до 7 метров. Отдает координаты уартом. На животных не реагирует."
    },
    {
      "id": 26849175,
      "author": "GennPen",
      "datetime": "2024-05-22T07:48:22.000Z",
      "text": "Ну, это если нужно отслеживать положение людей в двумерном пространстве. Если просто наличие людей, то достаточно HLK-LD2410. К тому же, у HLK-LD2450 нет сигнала выхода детектора (в отличие от HLK-LD2410, который может работать автономно), только UART по которому передаются данные, поэтому ему нужен контроллер для обработки данных."
    },
    {
      "id": 26854713,
      "author": "Moog_Prodigy",
      "datetime": "2024-05-23T12:09:46.000Z",
      "text": "Увы, нет (а я думал что есть). Впрочем прикрутить туда любой копеечный МК проблем не составит, протокол в даташите весь разжеван."
    },
    {
      "id": 26846683,
      "author": "nronnie",
      "datetime": "2024-05-21T15:19:55.000Z",
      "text": "В одном доме где я жил (за границей) было полуавтоматическое решение - включаешь руками когда заходишь в парадное с улицы или выходишь из квартиры, выключается потом само по таймеру."
    },
    {
      "id": 26847575,
      "author": "saboteur_kiev",
      "datetime": "2024-05-21T19:11:44.000Z",
      "text": "Как пример - есть лестница. И два проходных выключателя. Внизу и вверху.  Подходя к лестнице ткнул - свет включился. Отходя ткнул - выключился.  Это просто быстрее чем два раза проговаривать \"Алиса включи свет на  лестнице\", \"Алиса выключи свет на лестнице\".А почему Алиса, а не два датчика движения снизу и сверху?"
    },
    {
      "id": 26847785,
      "author": "nronnie",
      "datetime": "2024-05-21T20:45:03.000Z",
      "text": "Ну так, типа, круто же. Каждый пару раз попробует, а потом все снова будут по старинке кнопкой включать. У меня вот и на смартфоне  и на двух ноутбуках вход по отпечатку пальца есть. Настроил, попробовал, типа, да, прикольно, а дальше стал везде всё так же как раньше по ПИН-коду входить."
    },
    {
      "id": 26844071,
      "author": "korolevdd",
      "datetime": "2024-05-21T02:57:44.000Z",
      "text": "Что вам мешает доливать чайник после того, как налили чай. Один раз сказал семье, что чайник пустым не ставить и проблем нет.У меня например, кухня далеко и я уже забыл, когда его с кнопки включал. На работе не привычно ходить включать чайник и ждать. Так что автоматизация не только ради автоматизации"
    },
    {
      "id": 26844123,
      "author": "SpiderEkb",
      "datetime": "2024-05-21T03:43:36.000Z",
      "text": "Беда в том, что он сам чай не нальет и к дивану не принесет. Т.е. все равно вставать.В отличии от тог же отопления, где один раз подобрал режим (расписание - где и в какое время потеплее, где и когда попрохладнее). Я вот люблю чтобы когда ложишься и встаешь было потеплее, а спать - попрохладнее. Все это реализуется автоматически, по расписанию. Я вообще все это давно уже не трогаю - оно просто само работает. А уж если что-то вдруг приспичило - с телефона все можно порегулировать."
    },
    {
      "id": 26844403,
      "author": "empenoso",
      "datetime": "2024-05-21T05:38:05.000Z",
      "text": "Статья же не про чайник?"
    },
    {
      "id": 26847727,
      "author": "Rorg",
      "datetime": "2024-05-21T20:21:02.000Z",
      "text": "Это ваш сценарий использования чайника. У меня, например, чайник всегда наполнен водой (пьем много чая). И в принципе \"правило хорошего тона\" у нас: если после того, как ты сделал себе чай в чайнике осталось мало воды – наполнить его до максимума. Соответственно во время работы, если у меня заканчивается чай, я просто говорю \"Siri, turn on the kettle\" (или просто нажимаю на shortcut на рабочем столе или телефоне) и жду сообщения, что чайник закипел. И только после этого иду делать себе чай. Так что, лично для меня такой вариант удобен."
    },
    {
      "id": 26857697,
      "author": "nronnie",
      "datetime": "2024-05-24T09:05:07.000Z",
      "text": "Может вам тогда практичней вместо чайника просто термопот завести?"
    },
    {
      "id": 26856933,
      "author": "yaniks",
      "datetime": "2024-05-24T06:04:09.000Z",
      "text": "Ну зачем же так, у меня процесс такой, ещё лёжа в кровати говоришь Алисе поставить чайник и пока раскачивается/досыпаешь, а по \"чайник вскипел\" уже встаёшь и принимаешь безысходность ситуации, что надо на работу"
    },
    {
      "id": 26875093,
      "author": "nitro80",
      "datetime": "2024-05-29T06:24:12.000Z",
      "text": "Я люблю чай примерно одной температуры: 75. С заваркой получается наверно около 60. И да, удобно просить Алису согреть именно до 75."
    },
    {
      "id": 26844185,
      "author": "empenoso",
      "datetime": "2024-05-21T04:18:28.000Z",
      "text": "Другие люди прочитают и сделают выводы надо это им или нет.Свою задачу по открытию окон утром и закрытию вечером в некоторых комнатах - я смог решить за счёт этих приводов."
    },
    {
      "id": 26844009,
      "author": "eps",
      "datetime": "2024-05-21T01:26:13.000Z",
      "text": "В заголовке:без необходимости питания 220ВВ статье:они требуют периодической [...] подзарядки батарей.Ну что за clickbait. Думал, что-то механическое. Или солнечная батарея. Или беспроводное питание. А тут провод и 220В"
    },
    {
      "id": 26844023,
      "author": "empenoso",
      "datetime": "2024-05-21T01:59:42.000Z",
      "text": "Можно солнечную батарею прикрутить, но у нас регион не очень солнечный."
    },
    {
      "id": 26847015,
      "author": "ABy",
      "datetime": "2024-05-21T16:57:05.000Z",
      "text": "Можно завести лакея, который будет шторы опускать и поднимать:)"
    },
    {
      "id": 26866653,
      "author": "nronnie",
      "datetime": "2024-05-27T05:30:11.000Z",
      "text": "Я дворецкого себе позволить, пожалуй, не потяну, но, вот, уже давненько подумываю о том чтобы найти себе приходящую на время домработницу, потому что на все домашние дела времени просто катастрофически не хватает."
    },
    {
      "id": 26875145,
      "author": "nitro80",
      "datetime": "2024-05-29T06:33:50.000Z",
      "text": "Соседка - главный бухгалтер.Уже много лет у неё есть домашняя помощница, которая делает уборку, стирку, глажку и пр. домашние дела, пока та на работе."
    },
    {
      "id": 26844225,
      "author": "Shajtan",
      "datetime": "2024-05-21T04:39:38.000Z",
      "text": "Ценник не написан, но что то мне кажется - это не то чтобы и сильно дёшево. Готовый привод на цепочку, уже с zegbee, аккумулятором и подзарядкой от сети и от солнечной батарие в комплекте - что-то в районе 4 у китайцев было, у меня в детской стоит."
    },
    {
      "id": 26844409,
      "author": "empenoso",
      "datetime": "2024-05-21T05:38:51.000Z",
      "text": "Я покупал уже больше года, в районе 3-5 тр цена наверное сейчас"
    },
    {
      "id": 26844401,
      "author": "ErshoffPeter",
      "datetime": "2024-05-21T05:37:59.000Z",
      "text": "Повесил четыре привода Aqara Roller Shade Driver E1 (два в спальной и два в гостиной) - возможность ручного привода сохранилось (они на цепочку вешаются), но грохочат довольно сильно этой самой цепочкой."
    },
    {
      "id": 26845053,
      "author": "tipsoid",
      "datetime": "2024-05-21T08:40:48.000Z",
      "text": "Использую таких 2 шт.Удалось вылечить от грохота натяжкой цепи (переклеил мотор на несколько мм подальше)."
    },
    {
      "id": 26844963,
      "author": "OldManES",
      "datetime": "2024-05-21T08:13:56.000Z",
      "text": "Статья толковая, всё здорово, интерфейсы, сценарии и тд. Что НЕ здорово ? Так это подобные розетки в зоне видимости. Рулонную штору автор скрыл в нише, а вот розетки еа виду.    И еще вопрос, почему откосы такие узкие? Из чего дом?"
    },
    {
      "id": 26844971,
      "author": "empenoso",
      "datetime": "2024-05-21T08:14:58.000Z",
      "text": "Розетки в видимости только у рулонный штор. Откосы не узкие, больше 60 см просто ракурс такой у фотографии"
    },
    {
      "id": 26844967,
      "author": "vbifkol",
      "datetime": "2024-05-21T08:14:54.000Z",
      "text": "Не очень понятно что натолкнуло на мысль сделать статью \"я купил и поставил привод штор\" и ждать ли статьи \"я покушал\"."
    },
    {
      "id": 26844979,
      "author": "empenoso",
      "datetime": "2024-05-21T08:16:41.000Z",
      "text": "Зря смеётесь кстати. Когда смотрел как можно бюджетно автоматизировать рулонные шторы материалов - особо не было. А этому решению уже около 2 лет всё работает и полёт нормальный"
    },
    {
      "id": 26846227,
      "author": "vbifkol",
      "datetime": "2024-05-21T13:24:54.000Z",
      "text": "Когда смотрел как можно бюджетно автоматизировать рулонные шторы материалов - особо не было.я думаю если сейчас забить в гугл \"как empenoso покушал\" результатов тоже не будет. \"Как чиркнуть спичкой\" тоже не факт что есть, как нет и массы других интересных ответов.  Но это не значит что надо писать статьи.ЗЫ. о, чёрт.оно есть. Слава Богу, что не на Хабре."
    },
    {
      "id": 26845127,
      "author": "DMGarikk",
      "datetime": "2024-05-21T09:05:45.000Z",
      "text": "Во, а знает ктото как организовать управление жалюзями? какиенить типовые моторчики которые можно присобачить к обычным жалюзям? (ну и потом в HA)почему мне важно в плане автоуправления (я почитал комменты в плане \"зачем это надо, можно руками задернуть\") у меня частный дом, но за окном многоэтажный дом прям в окна смотрит...и пришлось ставить жалюзи чтобы днем в комнате было светло, а вчером 10 этажей дома не смотрело в окно ко мне...и хотелось бы чтобы жалюзи закрывались сами, без ручного задергивания штор..."
    },
    {
      "id": 26845281,
      "author": "empenoso",
      "datetime": "2024-05-21T09:42:01.000Z",
      "text": "Я делал так:https://habr.com/ru/articles/480690/Но лучше заводское изделие взять, если хочется чтобы поставил и всё работает."
    },
    {
      "id": 26845441,
      "author": "DMGarikk",
      "datetime": "2024-05-21T10:20:39.000Z",
      "text": "я вот к такомуже решению склоняюсь (уже и моторчики прикупил) мне не нравится что чисто ручной привод теряется в таком решенииp.s. меня не отпускает ощущение что я гдето видел такой моторчик куда вставляется эта шестригранная палочка откр-закр и ее можно вытаскивать для ручного управления...но не могу найти ни единого упоминания"
    },
    {
      "id": 26846629,
      "author": "Xius",
      "datetime": "2024-05-21T15:08:18.000Z",
      "text": "Понравился аккумуляторный подход. Люблю просыпаться когда ☀️ светит и как раз окна в спальне на северо-восток. С открытыми шторами летом начинает светить задолго до 06:30, мешает спать. Было бы отлично открывать шторы именно в это время. Но проводку до ниш не заложили, почему-то вообще о шторах не думали во время ремонта."
    },
    {
      "id": 26846841,
      "author": "j_larkin",
      "datetime": "2024-05-21T16:03:30.000Z",
      "text": "Рекомендую посмотреть на проект LazzyRoll. Цена в 2 бутерброда, если делать самому и, внезапно, у них есть возможность выставлять положение штор.https://github.com/ACE1046/LazyRollsСделал себе такие с год назад, очень доволен. И самое интересное, что эта самоделка в разы меньше, чем все \"магазинные\". Там только один минус - WiFi, а не зигби. Но, проект опенсорсный, так, что никто не мешает..."
    },
    {
      "id": 26847219,
      "author": "fLegmatik",
      "datetime": "2024-05-21T17:45:58.000Z",
      "text": "Я купил два таких привода у самого автора на imlazy.ru . Не сильно дороже вышло - около 20 долларов за штуку. Смонтировал только один, прекрасно работает года три, легко подключился как cover в home assistant через mqtt."
    },
    {
      "id": 26848149,
      "author": "LeoricBY",
      "datetime": "2024-05-22T01:26:48.000Z",
      "text": "У того же земисмарта есть модель которая адекватнее работает с зигби -https://www.zigbee2mqtt.io/devices/ZM16EL-03_33.html#zemismart-zm16el-03%252F33Покупается на том же Али на 1000 дороже.Пара месяцев - полет нормальный, отвалов нет, промежуточные положения умеет."
    },
    {
      "id": 26861919,
      "author": "empenoso",
      "datetime": "2024-05-25T09:44:05.000Z",
      "text": "А для какого диаметра подходит?"
    },
    {
      "id": 26861929,
      "author": "LeoricBY",
      "datetime": "2024-05-25T09:49:14.000Z",
      "text": "Этот на 17 и 25, там в комплекте 3 адаптера"
    },
    {
      "id": 26875639,
      "author": "Teemon",
      "datetime": "2024-05-29T07:55:04.000Z",
      "text": "Подскажите, тоже озадачен оснащением приводами рулонных штор(коттедж). Я хочу их встроить в верхний откос, сделав нишу внутри откоса. Таким образом, рулонные шторы будут внутри оконного проема и не будут при этом мешать открываться окнц, если штору убрать.Возле каждого окна заложил пожрозетник, в него ввел Ввг 3х1.5 и от подрозетника к шторе.Планирую использовать штору 220в, а выключатель уже с Зигби.Первая проблема это сделать нишу в проеме а вторая: я не могу найти 17/25мм штору, только 32мм на 220В. Такая большая штора потребует более глубокую нишу..."
    }
  ]
}