{
  "url": "https://habr.com/ru/articles/817117/comments/",
  "article_id": 817117,
  "title": "Как получить видео с камеры обычного квартирного домофона в умный дом",
  "comments": [
    {
      "id": 26866403,
      "author": "vbifkol",
      "datetime": "2024-05-27T03:02:26.000Z",
      "text": "Когда-то очень давно меня был проект с прокидкой домофона в телевизионную сеть. Даже какой-то прототип делали, но забили - вариант что какая-нибудь бабулька сидит и постоянно пырится на всех входящих людям не зашел."
    },
    {
      "id": 26866439,
      "author": "basn63",
      "datetime": "2024-05-27T03:49:08.000Z",
      "text": "а на телек трансляция велась бы или только один кто-то мог смотреть?"
    },
    {
      "id": 26866577,
      "author": "vbifkol",
      "datetime": "2024-05-27T05:10:01.000Z",
      "text": "Это в 2011 году было, делали транскодинг в ТВ-сигнал на какую-то стандартную частоту из неиспользовавшихся. Ну то есть на условно (точно не помню) 11 программе вещалось изображение с камеры домофона на весь подъезд, кто включил тот и смотрит, вне зависимости от того, какой телик - даже на ч/б с механическим селектором частоты."
    },
    {
      "id": 26866595,
      "author": "empenoso",
      "datetime": "2024-05-27T05:12:22.000Z",
      "text": "Необычное решение, я про проводное подключение подумал"
    },
    {
      "id": 26866667,
      "author": "vbifkol",
      "datetime": "2024-05-27T05:34:15.000Z",
      "text": "Не, проводное конечно же, не в эфир же гадить. Если забыли - аналоговое ТВ шло с коллективной антенны в общеподъездную шину, туда и подключались."
    },
    {
      "id": 26867101,
      "author": "sansar",
      "datetime": "2024-05-27T07:08:28.000Z",
      "text": "модулятор от сеги так в 3х подъездах использовал еще в том-же 11 году."
    },
    {
      "id": 26866463,
      "author": "empenoso",
      "datetime": "2024-05-27T04:18:45.000Z",
      "text": "По моему иногда застройщики так делают сейчас"
    },
    {
      "id": 26867353,
      "author": "starik-2005",
      "datetime": "2024-05-27T08:16:44.000Z",
      "text": "В нашем доме в подъезде одном на отдельный канал кабельного трансляция с камеры. Как сделали - ваще не в курсе, но работает. Может быть это та самая трансляция на ТВ-канал."
    },
    {
      "id": 26871335,
      "author": "Vitimbo",
      "datetime": "2024-05-28T08:31:59.000Z",
      "text": "У нас такое работает. Включаешь определенный канал на телевизоре и можешь 24*7 залипать в камеру на домофоне."
    },
    {
      "id": 26866441,
      "author": "legioner",
      "datetime": "2024-05-27T03:49:34.000Z",
      "text": "После того картинка появилась необходимо будет программно как будтосоздать IP-камеру на базе Armbian, которая состоит из картывидеозахвата, подключенной к/dev/video0и транслировать RTSP с помощью MediaMTX (ранее назывался RTSP Simple Server).Я искал готовые устройства именно для цели захвата картинки с домофона в RTSP и даже нашел, но жаба пока пересиливаетhttps://aliexpress.ru/item/1005003783248003.html"
    },
    {
      "id": 26866455,
      "author": "empenoso",
      "datetime": "2024-05-27T04:08:39.000Z",
      "text": "Ого! Даже не знал, что такие есть. В целом самодельное решение дешевле, но надо тратить время на настройку.Устройство по ссылке выше:"
    },
    {
      "id": 26866809,
      "author": "Poison48",
      "datetime": "2024-05-27T05:54:58.000Z",
      "text": "Можно приобрести плату от простого китайского аналогово видео регистратора на 4 канала (меньше нет). Они все умеют отдавать поток в RTSP. Необходимо только корпусприколхозить\\напечатать. Получится в 2 раза дешевле."
    },
    {
      "id": 26867117,
      "author": "legioner",
      "datetime": "2024-05-27T07:11:44.000Z",
      "text": "Они все умеют отдавать поток в RTSPНе знал, спасибо"
    },
    {
      "id": 26872943,
      "author": "ArtRoman",
      "datetime": "2024-05-28T14:06:48.000Z",
      "text": "Я столкнулся с тем, что у этих дешёвых IP-камер вещание без мультикаста, и ограничение в 4 одновременных клиента."
    },
    {
      "id": 26876315,
      "author": "legioner",
      "datetime": "2024-05-29T10:34:23.000Z",
      "text": "Мне достаточно одного - лишь бы ZoneMinder показывал"
    },
    {
      "id": 26867373,
      "author": "MaFrance351",
      "datetime": "2024-05-27T08:19:25.000Z",
      "text": "А ещё есть специальные девайсы - \"видеосерверы\", по сути просто начинка от IP-камеры, но вместо матрицы композитный вход."
    },
    {
      "id": 26867135,
      "author": "sekuzmin",
      "datetime": "2024-05-27T07:19:36.000Z",
      "text": "Это устройство стоит как половина Raspberry Pi 5. А с постоянным видеопотоком с камеры на Raspberry Pi 5 можно добавить face и т.п. recognition, записывать и транслировать видео куда хотите в удобном формате. И отсылать алерты в тот же телеграм в текстовом виде, если лицо успешно распознано, или в виде фото, если не распознано."
    },
    {
      "id": 26868025,
      "author": "Awalder",
      "datetime": "2024-05-27T11:04:42.000Z",
      "text": "У Beward тоже раньше были так называемые видеокодеры, B101S, B1018. Сейчас снято с производства, наверняка на авито можно найти. Прошивки русскоязычные."
    },
    {
      "id": 26874727,
      "author": "wolverin-a",
      "datetime": "2024-05-29T04:56:36.000Z",
      "text": "v4l2rtspserver из репозитория сделает тоже самое, настройка элементарная"
    },
    {
      "id": 26867055,
      "author": "Cpsskipper",
      "datetime": "2024-05-27T07:00:05.000Z",
      "text": "Зачем усложнять? Берется NVR с поддержкой аналоговых камер и оттуда передается в HA по RTSP"
    },
    {
      "id": 26867181,
      "author": "VasiliyLiGHT",
      "datetime": "2024-05-27T07:35:36.000Z",
      "text": "У нас в подъезде стоит древний визит без камер, недавно к нему приделали \"умный дом\" в виде отдельного модуля с камерой. Интересно, как это соединяют?В квартире на щитке никаких модулей как у автора нет, просто трубка у двери висит. ? Управление дверью предполагается с мобильного приложения, там же просмотр фото/видео. Вопрос доступа к потоку решается через УК (скорее всего отрицательно)..."
    },
    {
      "id": 26867383,
      "author": "MaFrance351",
      "datetime": "2024-05-27T08:21:53.000Z",
      "text": "Подключается в разрыв коммутатора домофона. При вызове определяет, в какую квартиру позвонили, при ответе с приложения перехватывает управление линией."
    },
    {
      "id": 26868997,
      "author": "MaFrance351",
      "datetime": "2024-05-27T15:26:59.000Z",
      "text": "Так понимаю, у вас стоит пепяка типа такой?"
    },
    {
      "id": 26869165,
      "author": "VasiliyLiGHT",
      "datetime": "2024-05-27T16:17:16.000Z",
      "text": "Во такая пепякаУсомнился, визит ли установлен, сходил сфоткал :D"
    },
    {
      "id": 26869663,
      "author": "MaFrance351",
      "datetime": "2024-05-27T18:47:42.000Z",
      "text": "Такие я не видел. Но, уверен, принцип не сильно отличается."
    },
    {
      "id": 26870201,
      "author": "Spyman",
      "datetime": "2024-05-27T22:52:40.000Z",
      "text": "Если в мобильном приложение непрерывно можно смотреть стрим - то доступ к потоку скорее всего можно получить и без ук.Берется рутованный андроид смартфон, на нем ставится кэпчер трафика с дешифровкой https, записываем трафик, находим url потока - вуаля, вы восхитительны.Собсвтенно ровно так себе и сделал, теперь камера домофона выведена в умный дом.Конечно всё может быть на так просто, если ссылка на поток меняется например раз в сутки или чаще, и для получения новой нужна авторизация. Но в целом все равно возможно."
    },
    {
      "id": 26870621,
      "author": "VasiliyLiGHT",
      "datetime": "2024-05-28T05:08:45.000Z",
      "text": "Стрим отпадает - теперь в приложухе доступно фото или видео на момент набора номера квартиры. Простым смертным поток недоступен будет, хотя недели две назад писали, что в любой момент можно будет смотреть. Видимо, много желающих было, а железо не тянет"
    },
    {
      "id": 26872647,
      "author": "Ilya_Vedigoo",
      "datetime": "2024-05-28T13:06:07.000Z",
      "text": "Приложение МТС домофон пишет об отсутсвии интернета при запущенном кэпчере. Использовал PCAPdroid."
    },
    {
      "id": 26872955,
      "author": "Spyman",
      "datetime": "2024-05-28T14:08:48.000Z",
      "text": "А Pcapdroid стоит под рутом и с mitm модулем для https?Есть вероятность, что приложение mts использует для проверки подлинности сервера свои собственные вшитые ключи - тогда его нужно перепаковывать заменив ключ но тот, который даёт pcap. Но странно если они так заморочились."
    },
    {
      "id": 26873631,
      "author": "Ilya_Vedigoo",
      "datetime": "2024-05-28T17:31:04.000Z",
      "text": "К сожалению без рута, но mitm работает.Сейчас загуглил и нашел сайт ЛК, там поток проще получилось вытащить. Почему-то раньше поиск его не показывал. Оставлю ссылку, если кому еще понадобитсяhttps://lk.vdome.mts.ru/home"
    },
    {
      "id": 26873777,
      "author": "Spyman",
      "datetime": "2024-05-28T18:22:18.000Z",
      "text": "Ну вот без рута у меня mitm не работал. В чем была проблема не помню, но кажется в том, что  приложения пользовательским сертификатам с андроит 7 не доверяют и они работают только в браузере, а системные без рута не подменить."
    },
    {
      "id": 26916597,
      "author": "Moon_darker",
      "datetime": "2024-06-10T04:18:12.000Z",
      "text": "Скорее всего SSL Pinning, все стандартные реализации обходятся скриптами через Frida"
    },
    {
      "id": 26867463,
      "author": "ifap",
      "datetime": "2024-05-27T08:36:24.000Z",
      "text": "Как получить видео с камеры обычного квартирного домофона в умный дом...... и бонусом - приговор по ст.137 УК РФ ;)"
    },
    {
      "id": 26867509,
      "author": "MaFrance351",
      "datetime": "2024-05-27T08:46:52.000Z",
      "text": "Так площадка перед подъездом общественная территория, не?"
    },
    {
      "id": 26867543,
      "author": "ifap",
      "datetime": "2024-05-27T08:52:59.000Z",
      "text": "Несомненно, но есть нюанс, и не один, начиная с того, что в определенный момент изображение гражданина (хорошо еще если совершеннолетнего) становится основным, и заканчивая скрытой съемкой."
    },
    {
      "id": 26869057,
      "author": "K0styan",
      "datetime": "2024-05-27T15:42:04.000Z",
      "text": "Видеодомофон и без связки с умным домом тогда по той же статье должен был бы проходить."
    },
    {
      "id": 26869065,
      "author": "ifap",
      "datetime": "2024-05-27T15:44:45.000Z",
      "text": "На мой взгляд, он и проходит (если он с записью) - его владельцу можно задать все те же вопросы."
    },
    {
      "id": 26869309,
      "author": "edogs",
      "datetime": "2024-05-27T17:01:57.000Z",
      "text": "в определенный момент изображение гражданина (хорошо еще если совершеннолетнего) становится основнымЭто может иметь значение только при публикации, съемка разрешена в любом случае.заканчивая скрытой съемкой.Домофон это не скрытая съемка. Скрытая съемка это замаскированное устройство так или иначе. Домофон с камерой это не оно."
    },
    {
      "id": 26869717,
      "author": "ifap",
      "datetime": "2024-05-27T19:00:48.000Z",
      "text": "Это может иметь значение только при публикации, съемка разрешена в любом случае.Ст.137 УК РФ считает иначе, охватывая съемку понятием \"сбора\".Домофон это не скрытая съемка. Скрытая съемка это замаскированное устройство так или иначе. Домофон с камерой это не оно.ЕМНИП продавец чего-то вроде GoPro считал так же, пока к нему в дверь не постучала ФСБ, у которойсвой взглядна то, что является скрытой съемкой."
    },
    {
      "id": 26869803,
      "author": "edogs",
      "datetime": "2024-05-27T19:27:32.000Z",
      "text": "137 ук рф ничего такого не считает, прочитайте внимательнее.Пример с продавцом о статье за несертифицированноое оборудование."
    },
    {
      "id": 26869875,
      "author": "ifap",
      "datetime": "2024-05-27T19:58:56.000Z",
      "text": "Серьезно? ФСБ пришла из-за отсутствия сертификата?"
    },
    {
      "id": 26867951,
      "author": "Javian",
      "datetime": "2024-05-27T10:54:34.000Z",
      "text": "Если не выкладывать в соцсетях и чатах, то никто и не узнает."
    },
    {
      "id": 26867993,
      "author": "ifap",
      "datetime": "2024-05-27T10:59:01.000Z",
      "text": "Дык, если душить в перчатках, то тоже... ;)"
    },
    {
      "id": 26868179,
      "author": "piton_nsk",
      "datetime": "2024-05-27T11:37:37.000Z",
      "text": "Есть ли примеры таких приговоров за камеру с домофона?"
    },
    {
      "id": 26868223,
      "author": "ifap",
      "datetime": "2024-05-27T11:50:16.000Z",
      "text": "Не знаю."
    },
    {
      "id": 26869729,
      "author": "Kurochkin",
      "datetime": "2024-05-27T19:02:40.000Z",
      "text": "У вас несчастные случаи на стройке были?"
    },
    {
      "id": 26868059,
      "author": "Anyuta1166",
      "datetime": "2024-05-27T11:10:45.000Z",
      "text": "У нас вот тоже поставили подъездные камеры. Только они с домофоном никак не связаны - домофон отдельно, камеры - отдельно. И что самое печальное, все построено на оборудовании Dahua (камеры + сетевой видеорегистратор). Смотреть камеры можно только через программу от производителя. Программа получает видеопоток с помощью технологии P2P с китайских серверов. Вот бы как-то это в умный дом интегрировать, но все кого я спрашивала говорят это невозможно."
    },
    {
      "id": 26868131,
      "author": "empenoso",
      "datetime": "2024-05-27T11:28:21.000Z",
      "text": "Если у вас есть доступ, то эти камеры тоже должны отдавать rtsp поток, а его потом хоть куда можно использовать"
    },
    {
      "id": 26868215,
      "author": "Anyuta1166",
      "datetime": "2024-05-27T11:46:31.000Z",
      "text": "Я же говорю, программа получает поток с помощью технологии P2P с китайских серверов. В программе вводится не IP-адрес, а некий идентификатор, а также логин и пароль. Программа коннектится к серверам производителя, через какое-то проприетарное API, и с них получает поток. Доступ к регистратору напрямую по IP-адресу не предоставляется (наверное по соображениям безопасности - чтобы не выставлять китайский девайс голой задницей в интернет)."
    },
    {
      "id": 26868661,
      "author": "sekuzmin",
      "datetime": "2024-05-27T13:45:24.000Z",
      "text": "В программе вводится не IP-адрес, а некий идентификатор, а также логин и парольНекий идентификатор это возможно серийный номер NVR DHI-NVR4116-4KS2/L на скриншоте.На Гитхабе есть проект \"RTSP Streaming with Dahua P2P Protocol Implementation\", с имплементацией на \"Ржавчине\" и Pyhon. Выглядит очень многообещающе. К сожалению не знаю имя и пароль от камеры, и есть всего 4 попытки, чтобы попробовать."
    },
    {
      "id": 26869835,
      "author": "Naves",
      "datetime": "2024-05-27T19:44:00.000Z",
      "text": ">Доступ к регистратору напрямую по IP-адресу не предоставляетсяЧтобы интегрировать в умный дом, нужно чтобы у вас был доступ к локальной сети с камерами или с регистратором. А этот доступ никто вам не дает.Обычно у камер и регистраторов доступны стандартные протоколы Onfiv и RTSP.У вас не техническая проблема, а организационная.Интеграция с китайскими серверами по проприетарным протоколам - это как бы не совсем задача самого умного дома. И в этом не заинтересован производитель камер, у него скорее всего есть свой умный дом, который ему нужно продавать."
    },
    {
      "id": 26868501,
      "author": "AshGrey",
      "datetime": "2024-05-27T13:06:22.000Z",
      "text": "А на Вашем устройстве нет проблемы с холодным стартом в 5-10 секунд?У меня была похожая идея с подключением к ХА, но не от подъездного домофона, а от вызывной панели по типу AVC от Activision. Чтобы после нажатия на кнопку распознавалось (или нет) лицо нажавшего и потом Алиса мне сообщала кто пришел. Но я столкнулся с тем, что EasyCap на чипе ms2100e очень долго синхронизирует сигнал. А если не отключаться от камеры панели и постоянно распознавать лица, то панель заметно греется, градусов так до 40-50. Затем купил на авито старый ТВ-тюнер, с ним такой проблемы уже нет, можно быстро захватить картинку и успешно стримить как из под ffmpeg, так и из под VLC. Но в этом варианте, к сожелению, оказалось, что OpenCV самостоятельно не может захватить картинку, даже если предварительно настроить с какого выхода и канала её забирать."
    },
    {
      "id": 26871111,
      "author": "sekuzmin",
      "datetime": "2024-05-28T07:45:09.000Z",
      "text": "У меня работает похожийвелосипедна EasyCap подобном свистке (ID 534d:0021 MacroSilicon MS210x Video Grabber [EasierCAP]) , камера от домофона шлет видео только когда кто-то позвонил. Холодного старта не замечено, но между камерой и EasyCap есть сплиттеры, и сигнал передается в дифференциальном виде, т.е. есть еще и преобразователи в дифф сигнал и обратно в композитный. Распознавалка работает на Pythonface_recognitionи получает видео с указанного источника. Скрипт открывает дверь и сообщает кто пришел через HA TTS -> Google home mini."
    },
    {
      "id": 26870077,
      "author": "buratino",
      "datetime": "2024-05-27T21:18:31.000Z",
      "text": "чуток не по теме, но таки спрошу. А как к Home Assitant интегрировать IP камеру с Onvif... есть интеграция Onvif, камеру оно обнаруживает и что-то показывает. Но только статическую картинку, а при попытке показать видео бесконечно \"крутит круги\".  Вертеть камерой тоже нельзя, файлы с флеш-карты недоступны"
    },
    {
      "id": 26870109,
      "author": "suprimex",
      "datetime": "2024-05-27T21:39:33.000Z",
      "text": "Посмотрите в сторону Frigate NVR"
    },
    {
      "id": 26871721,
      "author": "buratino",
      "datetime": "2024-05-28T09:39:52.000Z",
      "text": "посмотрю обязательно.Однако \"крутит круги\" похоже последняя версия Firefox, в Хроме все показывается. Остальное так же недоступно."
    },
    {
      "id": 26870339,
      "author": "Teemon",
      "datetime": "2024-05-28T02:11:50.000Z",
      "text": "А кто посоветует видео домофон сразу с возможностью интеграции а УД?.. Т..Е НУЖНО ЧТОБЫ onvif ил и rstp был?"
    },
    {
      "id": 26870403,
      "author": "empenoso",
      "datetime": "2024-05-28T03:35:03.000Z",
      "text": "Вызывные панели типа Hikvision DS-KV8413-WME1https://github.com/pergolafabio/Hikvision-Addons/blob/main/doorbell/README.md"
    },
    {
      "id": 27222454,
      "author": "s60",
      "datetime": "2024-08-29T08:01:25.000Z",
      "text": "@empenoso, можете пояснить для тех кто в танке: если вот такой домофон и примерно такая трубка с двумя проводками (видео с камеры и управление дверью провайдер домофона предлагает через их приложение за 100 руб/мес):1) есть ли возможность получить видео?2) достаточно ли двух проводков или надо переподключать 4 из коробки в щитке на лестничной площадке ?3) в общем , если можно то как ?4) может вообще есть вариант трубки с видео (картинка то нужна только в момент звонка в домофон) ?фото домофона и трубки"
    },
    {
      "id": 27240444,
      "author": "empenoso",
      "datetime": "2024-09-03T05:43:12.000Z",
      "text": "У меня координатный домофон, а у вас ведь это современный."
    },
    {
      "id": 27240456,
      "author": "Javian",
      "datetime": "2024-09-03T05:48:29.000Z",
      "text": "Многоабонентский IP домофон Beward DKS15125. У него сервисы как у IP камеры, но доступны внутри сети по логину/паролю. А снаружи видео доступно через приложение (фактически это SIP звонок).Многоабонентский IP домофон Beward DKS15125 с поддержкой SIP открывает пользователям новые возможности. Благодаря универсальному и открытому протоколу, SIP-видеодомофон BEWARDDKS1512 можно подключать к SIP-устройствам других производителей (SIP-домофоны, IP-телефоны, IP-видеофоны, SIP-мониторы, IP-трубки, SIP-софтфоны, мобильные SIP-клиенты для различных платформ и т.д). IP-домофон может работать через IP-АТС или связываться с другим SIP устройством напрямую.DKS15125дает возможность принимать вызов и открывать дверь (тональный набор DTMF) при переадресации на обычный сотовый или городской телефон. На каждого абонента возможно настроить до 5 направлений вызова."
    }
  ]
}