{
  "url": "https://habr.com/ru/articles/820249/comments/",
  "article_id": 820249,
  "title": "Как сделать так, чтобы на последнем листе Экселя оказались не только подписи директоров, но и суммы",
  "comments": [
    {
      "id": 26916519,
      "author": "TomskDiver",
      "datetime": "2024-06-10T03:09:23.000Z",
      "text": "Как я понимаю, на предпоследней странице получится что несколько последних строк больше по высоте? Как вариант можно просто HPageBreaks вставить свой где надо. Тогда высоты будут одинаковые, но предпоследний лист будет чуть-чуть не весь заполнен на бумаге."
    },
    {
      "id": 26916525,
      "author": "empenoso",
      "datetime": "2024-06-10T03:18:21.000Z",
      "text": "Да, на последней странице несколько последних строк будут больше по высоте"
    },
    {
      "id": 26918937,
      "author": "Beast2040",
      "datetime": "2024-06-10T13:40:36.000Z",
      "text": "Проще чуть уменьшить масштаб листа чтобы подписи влезли на полный лист."
    },
    {
      "id": 26916739,
      "author": "Kahelman",
      "datetime": "2024-06-10T05:31:28.000Z",
      "text": "Делюсь лайк-хаком: пишите письмо на одной странице с основными параметрами, пишите детали как в приложении 1.Руководитель подписывает письмо а сама смета -по барабану.Если надо очень официально-то все равно каждая страница внизу подписывается"
    },
    {
      "id": 26916941,
      "author": "empenoso",
      "datetime": "2024-06-10T05:42:19.000Z",
      "text": "Хороший совет, но в конце каждой сметы всё равно подписи ставят - там форма такая"
    },
    {
      "id": 26917077,
      "author": "Kahelman",
      "datetime": "2024-06-10T06:28:44.000Z",
      "text": "Форму поменяйте.  На многих документах подпись стоит на первом листе с пометкой «утверждаю»."
    },
    {
      "id": 26919207,
      "author": "necr0x",
      "datetime": "2024-06-10T15:06:38.000Z",
      "text": "Итог важен, а иначе в середину можно понапихать разного."
    },
    {
      "id": 26925179,
      "author": "wepp",
      "datetime": "2024-06-11T21:41:43.000Z",
      "text": "Форма определена НПА, это не просто смета к КП. Да, на первом (титульном) листе подписи и печати выглядят солидно, но тут смысл в итоговых цифрах, поэтому вполне логично именно такое расположение подписи."
    },
    {
      "id": 26917083,
      "author": "Kahelman",
      "datetime": "2024-06-10T06:30:45.000Z",
      "text": "Есть ещё лайфх: посылаем по email и без подписи.Весь загнивающий запад так работает. Подпись только под договором, детали по e-mail."
    },
    {
      "id": 26917351,
      "author": "qyix7z",
      "datetime": "2024-06-10T07:39:55.000Z",
      "text": "For Each ws In wb.WorksheetsActiveWindow.View = xlPageBreakPreviewПеребор листов в книге не делает лист активным. Зачем в цикле каждый раз выполняетсяActiveWindow.View = xlPageBreakPreview?Лучше написатьws.DisplayPageBreaks = True- это заставит эксель пересчитать разделение на страницы на каждом листе.Вообще, если директору так надо видеть сумму перед подписью, то я в таких случаях просто ставлюHPageBreaksнад строкой с суммой и не надо строчки раздвигать."
    },
    {
      "id": 26981274,
      "author": "qyix7z",
      "datetime": "2024-06-28T05:55:15.000Z",
      "text": "Вообще, если директору так надо видеть сумму перед подписью, то я в таких случаях просто ставлюHPageBreaksнад строкой с суммой и не надо строчки раздвигать.Попался на глаза этот код, вдруг кому полезно будет:With myWorkbook\n    ActiveWindow.View = xlPageBreakPreview\n    If .ActiveSheet.HPageBreaks.Count > 0 Then\n        Set rPodpis = .ActiveSheet.Cells.Find(\"Итого:\", LookIn:=xlValues, LookAt:=xlWhole)\n        If Not rPodpis Is Nothing Then\n            bSplit = False\n            For Each myHPageBreak In ActiveSheet.HPageBreaks\n                If myHPageBreak.Location.Row > rPodpis.Row Then\n                    bSplit = True\n                    Exit For\n                End If\n            Next\n            If bSplit Then .ActiveSheet.HPageBreaks.Add rPodpis\n        End If\n    End If\n    ActiveWindow.View = xlNormalView\nEnd With* В моем случае в книге был заведомо один лист, поэтому обращаюсь кActiveSheet"
    },
    {
      "id": 26919089,
      "author": "necr0x",
      "datetime": "2024-06-10T14:33:24.000Z",
      "text": "Обоже, я думал в Германии бюрократия, ан нет, в России)) в Германии достаточно отправить на электронку ангебот (ценовое предложение, в котором будет перечень услуг и цен за квадратный метр, а так же общее количество метров). И всё. Даже подпись не нужна ни с чьей стороны. Это и является официальным договором по ценам для объекта в контексте которого идёт переписка.Есть конечно так называемый Verhandlungstermin на котором самой сутью встречи является не наличие подписи, а переговоры с целью понизить некоторые позиции. Таким образом цены координируются сторонами и уже в этой версии документа необходимы подписи обоих участников.Но как можно подписывать смету не видя при этом всего перечня? Это звучит как какая-то формальность. Если ты подписываешь видя только итоговую сумму, то это чисто формальная подпись, в таком случае можно и не видя сумму подписать.Идиоты))"
    },
    {
      "id": 26919669,
      "author": "Kahelman",
      "datetime": "2024-06-10T18:09:11.000Z",
      "text": "«Безумие и отвага»Сами себе проблемы создаём, потом их героически преодолеваем.Все таки не ясно о какого уровня руководителе идёт речь. Если директор- то по идее он не  должен подписывать сметы только договоры с приложениями.Если начальник уровня отдела, то надо бы директору настучать ему по голове, чтобы на ровном месте проблему не создавали."
    },
    {
      "id": 26924915,
      "author": "wepp",
      "datetime": "2024-06-11T19:46:14.000Z",
      "text": "Речь про сметы в составе проектно-сметной документации на строительство.Образец рекомендуемый, но в целом все придерживаютсяПодпись можно и \"электронно\" поставить, но тут даже по оформлению будет выглядеть некрасиво, если подпись будет в отрыве от остального содержимого."
    },
    {
      "id": 26920867,
      "author": "qyix7z",
      "datetime": "2024-06-11T05:13:48.000Z",
      "text": "Если ты подписываешь видя только итоговую сумму, то это чисто формальная  подпись, в таком случае можно и не видя сумму подписать.Смысл в том, что подписывается один лист. Остальные листы ретивые исполнители могут заменить. Если на листе с подписями будет итоговая сумма, то хотя бы она останется неизменной.В целом предложенное решение автором - костыль, так как проблема не в технической плоскости, а в административной. Если уж ты при подписании не доверяешь, то подписывай каждую страницу или требуй, чтобы сшивали документ."
    },
    {
      "id": 26920337,
      "author": "enabokov",
      "datetime": "2024-06-10T23:03:51.000Z",
      "text": "Ооо, у меня была такая проблема в Crystal Reports в 2007 году для банковского отчёта. Нормального решения в CR не было, и я как-то извратился. Не помню уже как. Вроде я вставлял принудительный page break при некоторых условиях, чтобы часть строк и Итого попадали на новую страницу. Форму поменять было нельзя, потому как она была утверждена ЦБ."
    },
    {
      "id": 26920467,
      "author": "KEugene",
      "datetime": "2024-06-11T00:19:40.000Z",
      "text": "Я знаю, как случайно поломать скрипт. На любой строке ниже \"визульно\" последней (383 на примере) в ячейку ввести пробел. Например, где-то на четырехсотой.Если люди, создающие сметы, не способны сразу сделать нормальную разметку, то от них вполне можно ожидать подобных сюрпризов.Наверное, в скрипт надо ввести проверку, что выявленная последняя строка содержит значимую информацию. Можно сцепить значения ячеек, удалить пробелы и проверить длину того, что останется. Ну и определить порог. Если длина больше, то продолжаем. Меньше-ошибку в лог и к следующему файлу.Кстати, при массовой обработке лучше не использовать msgbox, а писать лог или в консоль, или в текстовик. Нельзя отойти от компьютера, постоянно требуется нажатие кнопки. А уже в конце полноценное уведомление, типа, Успешно обработано Х файлов, ошибок Y. Детали в логе."
    },
    {
      "id": 26920831,
      "author": "qyix7z",
      "datetime": "2024-06-11T05:03:49.000Z",
      "text": "Если люди, создающие сметы, не способны сразу сделать нормальную разметку, то от них вполне можно ожидать подобных сюрпризов.Это не люди:Сметы создаются в приложении ГРАНД-Смета, версия 2024.2 - это  указывается в колонтитуле Эксель файла и, возможно, у этого приложения  есть такая кнопка, чтобы сделать всё красиво и не делать так, чтобы на  последнем листе оставались только подписи.Но организация,  которая составляет эти сметы, и передаёт их на печать к нам в другую  организацию, похоже с этой кнопкой не знакома.Не будет там пробела в 400й строке.Про  msgbox  и логи согласен."
    }
  ]
}