{
  "url": "https://habr.com/ru/articles/833648/comments/",
  "article_id": 833648,
  "title": "Вычисление отсрочки старта приготовления каши на завтра",
  "comments": [
    {
      "id": 27127168,
      "author": "Javian",
      "datetime": "2024-08-05T03:09:11.000Z",
      "text": "Я так точно не высчитываю - мультиварка останавливается когда выкипает вода. Мне важнее залить воды в количестве необходимом для готовности. Выкипит раньше - будет каша недоваренная. Будет немного больше необходимого - лишнее выкипит пока она будет стоять на подогреве после окончания программы варки."
    },
    {
      "id": 27127174,
      "author": "empenoso",
      "datetime": "2024-08-05T03:14:22.000Z",
      "text": "Это видимо от каши зависит, я литра полтора наливаю и вроде проблем ни разу не было."
    },
    {
      "id": 27127178,
      "author": "Javian",
      "datetime": "2024-08-05T03:17:29.000Z",
      "text": "У меня ориентир - не ниже чем \"на палец над уровнем крупы\"."
    },
    {
      "id": 27127386,
      "author": "MarijQA",
      "datetime": "2024-08-05T05:30:25.000Z",
      "text": "От каши, конечно. Гречку вот вообще варить не надо. С вечера залить, утром разогреть)"
    },
    {
      "id": 27128296,
      "author": "McKinseyBA",
      "datetime": "2024-08-05T09:05:37.000Z",
      "text": "С вечера залить, утром разогреть)А через 10 лет рассказывать гастроэнтерологу/онкологу, чтоГречку вот вообще варить не надоНа пабмеде (пару лет назад так точно) легко гуглились статьи и даже метанализы исследований на тему \"каши, которые требуют варки - надо варить, а хлопья не требующие варки - не надо потреблять\". Не врач и не ставлю диагнозы, но если у вас прокатило - это не значит, что прокатит у других"
    },
    {
      "id": 27129300,
      "author": "MarijQA",
      "datetime": "2024-08-05T12:02:47.000Z",
      "text": "Как раз относительно гречки гастроэнтерологи и не настаивают на варке. Коричневая, не зеленая!, гречка уже после тепловой обработки продаётся, поэтому она и коричневая. Так что залить кипятком и оставить на несколько часов или варить - разница только во вкусе."
    },
    {
      "id": 27127190,
      "author": "slog2",
      "datetime": "2024-08-05T03:24:32.000Z",
      "text": "Для каши не надо ничего высчитывать. Вечером засыпал крупы, залил воды, нажал старт. Когда программа приготовления завершится мультиварка сама переходит в режим \"подогрев\" и стоит с горячей кашей до утра. Каша только лучше становится."
    },
    {
      "id": 27127204,
      "author": "empenoso",
      "datetime": "2024-08-05T03:41:22.000Z",
      "text": "Слишком долго подогревать будет - потратит электроэнергию?А так старт готовки прямо перед завтраком, и крупа заодно разбухнет - больше станет."
    },
    {
      "id": 27129056,
      "author": "berez",
      "datetime": "2024-08-05T11:11:33.000Z",
      "text": "Слишком долго подогревать будет - потратит электроэнергию?Корпус мультиварки достаточно неплохо теплоизолирует, да и температуру на подогреве держат не очень большой - на моей, например, градусов 60. Так что энергии там уходит не сильно больше, чем когда она просто индикаторным табло светит в пустоту.Опять же, не обязательно запускать ее прямо с вечера. Можно поставить задержку в 2-3 часа, чтобы она начала готовить ночью и к утру гарантированно закончила. Ну постоит на подогреве пару часиков, это не страшно. Заодно попадаем в ночной тариф, если тарификация ЭЭ раздельная (день-ночь).А так старт готовки прямо перед завтраком, и крупа заодно разбухнет - больше станет.Если дома жарко, за ночь крупа вполне может начать бродить. Ну и есть горячущую, только что приготовленную кашу - так себе удовольствие. Постояв на подогреве, она слегка остынет и температура будет более комфортная для поедания.В общем, точность в вычислениях нужна только в случае, если у вас мультиварка без режима подогрева или если он глючный и на нем каша подгорает."
    },
    {
      "id": 27130370,
      "author": "vvzvlad",
      "datetime": "2024-08-05T15:45:47.000Z",
      "text": "Так что энергии там уходит не сильно больше, чем когда она просто индикаторным табло светит в пустоту.Ну сильно больше, на самом деле, индикатор это 1-2 ватта, а подогрев ватт 15-20, на порядок больше. Другое дело, что даже 24/7 эти 20вт это 50р/месяц(по одному тарифу 5р/квтч), а час в день это рубля 2 в месяц."
    },
    {
      "id": 27130532,
      "author": "BITniki",
      "datetime": "2024-08-05T16:29:23.000Z",
      "text": "А на подогреве она бродит не станет?"
    },
    {
      "id": 27130768,
      "author": "berez",
      "datetime": "2024-08-05T17:31:44.000Z",
      "text": "На подогрев она становится после приготовления. Приготовление - это термообработка. Термообработка, в частности, убивает всякую микрофлору (впрочем, споры остаются).Но даже если оставить на подогреве на месяц, там будет держаться температура около 60 градусов - для дрожжей это многовато. Не забродит."
    },
    {
      "id": 27131574,
      "author": "Dlmas",
      "datetime": "2024-08-06T01:13:45.000Z",
      "text": "Мне интересно, что с кашей потом будете делать? Готовите, наверное, не одну порцию за раз. Как остатки храните и разогреваете, тоже в мультиварке с расчётом?"
    },
    {
      "id": 27131764,
      "author": "Javian",
      "datetime": "2024-08-06T05:00:49.000Z",
      "text": "Микроволновка же."
    },
    {
      "id": 27127272,
      "author": "CitizenOfDreams",
      "datetime": "2024-08-05T04:29:17.000Z",
      "text": "Високосные секунды не забыли учесть?"
    },
    {
      "id": 27127280,
      "author": "empenoso",
      "datetime": "2024-08-05T04:31:58.000Z",
      "text": "Ой"
    },
    {
      "id": 27127282,
      "author": "sasha_semen",
      "datetime": "2024-08-05T04:33:08.000Z",
      "text": "В приложении Sky, в котором можно мультиваркой Redmont по Bt управлять именно время окончания программы задается, задержка рассчитывается сама. И еще опцию подогрева по окончании можно отключить.Но я всё равно \"в уме\" прикидываю, не особо сложно."
    },
    {
      "id": 27127298,
      "author": "empenoso",
      "datetime": "2024-08-05T04:45:09.000Z",
      "text": "У меня древняя"
    },
    {
      "id": 27127320,
      "author": "DeFANCE",
      "datetime": "2024-08-05T04:54:12.000Z",
      "text": "У меня раньше, до того как выгорели датчики температуры, была R., там отсрочка означала, через сколько начнётся готовка, ровно как у автора. Теперь P., у которой отсрочка означает, через какое время будет готово, а по умолчанию оно равно времени приготовлении, и это гораздо удобнее. Это ещё один пример современности, когда дизайнеры интерфейсов обычно не пользуются своими же дизайнами."
    },
    {
      "id": 27127376,
      "author": "randomsimplenumber",
      "datetime": "2024-08-05T05:27:36.000Z",
      "text": "дизайнеры интерфейсов обычно не пользуются своими же дизайнамиПонимаю. Бесит. Иногда сколько неочевидной магии напихают, что просто удивляешься. RGB индикатор степени готовности. Чуваки, выведите цифры, можно проценты, можно время, можно даже прогресс бар, я пойму, правда. Индикация окончания программы - только звуковая. У вас не нашлось лишнего светодиода, и теперь нужно внимательно слушать чтобы не пропустить? Вид программы подписать не буквами а иконкой? Используй фантазию, бро. Мы смогли и ты сможешь. Таймер отсрочки начала программы? Да всем пофигу когда она начнется. Интересно когда закончится. Код ошибки изобразить светодиодами, пусть некоторые светятся, некоторые мигают, а некоторые красные. Привет из 80-х?"
    },
    {
      "id": 27128418,
      "author": "juray",
      "datetime": "2024-08-05T09:26:59.000Z",
      "text": "Самое удобное - это ввод непосредственно целевого момента времени, к которому блюдо должно быть готово. Вот требуется готовая каша в 6:30 - так и вводить 06:30, и ничего не высчитывать.Отсрочка от текущего момента программирования - выглядит каким-то легаси, оставшимся от времен, когда таймеры были механические, с обратным отсчетом."
    },
    {
      "id": 27128478,
      "author": "empenoso",
      "datetime": "2024-08-05T09:37:40.000Z",
      "text": "В данном случае мультиварке лет 15 наверное, а то и больше, так что точно - легаси."
    },
    {
      "id": 27128822,
      "author": "randomsimplenumber",
      "datetime": "2024-08-05T10:42:36.000Z",
      "text": "15 лет назад микроконтроллеры уже были."
    },
    {
      "id": 27129160,
      "author": "Iv38",
      "datetime": "2024-08-05T11:29:35.000Z",
      "text": "Но большинство производителей кухонной техники и до сих пор почему-то считает, что часов реального времени не существует."
    },
    {
      "id": 27129266,
      "author": "CitizenOfDreams",
      "datetime": "2024-08-05T11:55:42.000Z",
      "text": "Есть и худший вариант - когда производитель считает, что десять строчек в программе микроконтроллера это и есть часы реального времени. В результате все бытовые приборы в доме показывают разное время или мигают 12:00."
    },
    {
      "id": 27129772,
      "author": "esaulenka",
      "datetime": "2024-08-05T13:35:13.000Z",
      "text": "Вообще-то, так оно и есть. Кварц, приделанный к любому контроллеру, и кварц, приделанный к DS1307, дадут абсолютно одинаковую точность.Батарейки для бэкапа в духовки и стиральные машины всё равно ставить никто не будет, так что вопрос энергопотребления тут не важен."
    },
    {
      "id": 27130054,
      "author": "randomsimplenumber",
      "datetime": "2024-08-05T14:34:32.000Z",
      "text": "А жаль. Цена батарейки роли не играет, а удобства добавляет."
    },
    {
      "id": 27130118,
      "author": "esaulenka",
      "datetime": "2024-08-05T14:46:46.000Z",
      "text": "Ну так батарейка помрёт в любом случае через несколько лет. Т.е. надо аккумулятор ставить со схемой заряда.Тоже, конечно, не особо большая проблема - в компьютерах 30 лет назад ведь ставили, и если подобрать не такую ядрёную жижу (стандартная проблема 386 материнок в XXI веке - NiCd аккумулятор протёк и проел дырку во всех ближайших дорожках), то оно и работать будет.У меня, кстати, часы касио на одном единственном аккумуляторе уже больше 10 лет работают. Они, правда, стоили как не самая дешёвая стиралка :-))"
    },
    {
      "id": 27130398,
      "author": "randomsimplenumber",
      "datetime": "2024-08-05T15:51:24.000Z",
      "text": "Ну так батарейка помрёт в любом случае через несколько летСтиралка, скорее всего, помрёт раньше. Хотя батарейку можно и поменять. А можно и не менять, если не напрягает."
    },
    {
      "id": 27151812,
      "author": "Pinkbyte",
      "datetime": "2024-08-11T10:25:19.000Z",
      "text": "Новомодные - возможно.Но у меня тут ошибка выжившего - Indesit с механической крутилкой для выставления программы.>20 лет девайсу - 1 ремонт за все время - накрылся двигатель, который барабан крутит. Ну и ТЭН заодно поменяли, а то он \"малость\" зарос за это время - вода у меня дома жесткая"
    },
    {
      "id": 27131352,
      "author": "CitizenOfDreams",
      "datetime": "2024-08-05T21:09:07.000Z",
      "text": "Кварц, приделанный к любому контроллеру, и кварц, приделанный к DS1307, дадут абсолютно одинаковую точность.Только если специально озаботиться согласованием кварца и подгонкой частоты. Ну и DS1307 - это так себе планка, термокомпенсации у него нет.Батарейки для бэкапа в духовки и стиральные машины всё равно ставить никто не будетНу вот и получаются \"часы\", которые показывают точное время два раза в сутки, в 12:00AM и в 12:00PM. К счастью, разработчик моей кухонной плиты предусмотрел опцию \"погасить часы на хрен\", разработчики стиральной и сушильной машины были достаточно умными, чтобы удержаться от имплементации \"часов из десяти строчек кода\", а разработчик микроволновки поставил в нее старый добрый суперудобный и неубиваемый механический таймер."
    },
    {
      "id": 27129484,
      "author": "sappience",
      "datetime": "2024-08-05T12:36:56.000Z",
      "text": "Удивительно, но многие производители бытовой техники до сих пор тактируют внутренние часы от сети. Нет, не от интернета, от осветительной сети 50Hz или 60Hz."
    },
    {
      "id": 27129754,
      "author": "esaulenka",
      "datetime": "2024-08-05T13:31:56.000Z",
      "text": "Я тут изучал вопрос. По моим расчётам выходит, что в российской розетке частота стабильнее, чем отклонение 1/20e6 среднестатистического кварца (это если верить документации и допустить, что кварц имеет комнатную температуру, а не разогревается со всей духовкой. Может быть и сильно хуже).По форумам любителей японских Flip Clock (рекомендую сразу искать это слово на ютубе - залипательное зрелище) аналогично - 50 герц выдерживается довольно хорошо."
    },
    {
      "id": 27130058,
      "author": "randomsimplenumber",
      "datetime": "2024-08-05T14:35:51.000Z",
      "text": "кварц стоит дешевле отдельной обмотки трансформатора."
    },
    {
      "id": 27130166,
      "author": "slog2",
      "datetime": "2024-08-05T14:59:50.000Z",
      "text": "Трансформатор в принципе не нужен, можно через оптрон получить сетевые 50гц. Тут уже не однозначно что будет дешевле."
    },
    {
      "id": 27130382,
      "author": "randomsimplenumber",
      "datetime": "2024-08-05T15:48:39.000Z",
      "text": "оптрон+выпрямитель+ограничить тока, однозначно дороже кварца."
    },
    {
      "id": 27130914,
      "author": "Javian",
      "datetime": "2024-08-05T18:24:51.000Z",
      "text": "Там не отдельная обмотка. Ремонтировал свою микроволновку  после аварии в электросети, которая повысила напряжение и несколько ночных часов жарила мои приборы. Трансформатор в конце концов сгорел, закоротил цепь и отключил сеть. Кроме микроволновки никто не пострадал. Познакомился с конструкцией. Две обмотки трансформатора. Одна для питания реле, вторая для питания микроконтроллера и с нее же до диодного моста берутся импульсы для часов.За оригинальный трансформатор хотят ненормальных денег - около 1000 руб.Купил за 300 руб однообмоточный, с которого запитал и реле и микроконтроллер.Что интересно, если вместо переменного подать постоянный ток, то микроволновка включается, но не реагирует на кнопки. Импульсы часов как-то используются для работы микроконтроллера."
    },
    {
      "id": 27131364,
      "author": "CitizenOfDreams",
      "datetime": "2024-08-05T21:13:39.000Z",
      "text": "Что интересно, если вместо переменного подать постоянный ток, то микроволновка включается, но не реагирует на кнопки. Импульсы часов как-то используются для работы микроконтроллера.Да скорее всего макак-программист написал там \"while (ждем_импульс)\"."
    },
    {
      "id": 27131770,
      "author": "Javian",
      "datetime": "2024-08-06T05:03:54.000Z",
      "text": "Подозреваю, что это импульс вызывает прерывание, в котором много чего обрабатывается т.к. функционирование микроволновки связано с отсчетом времени."
    },
    {
      "id": 27132154,
      "author": "CitizenOfDreams",
      "datetime": "2024-08-06T06:23:25.000Z",
      "text": "Ну, лично я бы написал внутренний таймер, который синхронизируется с сетью. Там арифметики будет на десяток строк, зато случайную помеху или короткое пропадание сети отфильтрует."
    },
    {
      "id": 27132944,
      "author": "Javian",
      "datetime": "2024-08-06T08:56:13.000Z",
      "text": "Случайная помеха - это 0,02 секунды. Вероятность события очень низкая. Часы не отсчитывают секунды поэтому уйти далеко не смогут. Скорее сам владелец раз в год свет выключит для каких-то работ."
    },
    {
      "id": 27127422,
      "author": "PavelBelyaev",
      "datetime": "2024-08-05T05:41:29.000Z",
      "text": "Идея у вас есть и это прекрасно, а теперь можете написать бота в телеге, которому пишите надо включить в 6-30, а он спрашивает сколько готовить (выкидывает значения на выбор) и отвечает сколько отсрочку ставить, а если дальше пойти, то прям будет для каждой каши считать своё время.Я тоже по бытовой ситуации начал свой проект, учет бюджета, включать и выключать домашний сервер через телегу, но уже полгода его пишу по выходным чисто для души..."
    },
    {
      "id": 27127832,
      "author": "empenoso",
      "datetime": "2024-08-05T07:34:30.000Z",
      "text": "Да нет, именно в этом случае кажется что одной табличке именно мне хватит"
    },
    {
      "id": 27127438,
      "author": "Lelant0s",
      "datetime": "2024-08-05T05:44:10.000Z",
      "text": "Что за каша готовится 40 минут и в каких объемах вы ее потребляетеежедневно, учитывая, что воды на сухую массу берете 1.5 литра?"
    },
    {
      "id": 27127834,
      "author": "empenoso",
      "datetime": "2024-08-05T07:34:42.000Z",
      "text": "Я люблю гречку"
    },
    {
      "id": 27127474,
      "author": "yurikmellon",
      "datetime": "2024-08-05T05:59:54.000Z",
      "text": "У меня древняя Мультиварка Panasonic SR-TMH18. Там не надо ничего высчитывать. Для пшёнки 1 к 4 (4,5) и время отсрочки, это время когда каша готова. Например, в 23:00 надо выставить отсрочку на 7 часов, чтобы каша была готова к 6:00 следующего утра.Всё настолько просто, что я удивлён: а разве у других мультиварок отсрочка работает по другому?"
    },
    {
      "id": 27127494,
      "author": "randomsimplenumber",
      "datetime": "2024-08-05T06:05:41.000Z",
      "text": "я удивлён: а разве у других мультиварок отсрочка работает по другому?Вы не поверите.. ;)"
    },
    {
      "id": 27128458,
      "author": "juray",
      "datetime": "2024-08-05T09:33:03.000Z",
      "text": "не надо ничего высчитывать.Например, в 23:00 надо выставить отсрочку на 7 часов, чтобы каша была готова к 6:00Кажется, эти две фразы противоречат руг другу.А если готовность нужна в 6:15, а сейчас 22:37?Таки минимум одно действие высчитывания требуется - вычисление разности между текущим моментом и моментом готовности. Еще и на часы посмотреть сначала (что, в ринципе, не проблема - они ж на мультиварке выводятся?)В идеале, хорошо бы и это вычитание не надо было делать - ввёл \"6:00\" и неважно, сколько сейчас на часах - прибор сам всё высчитает."
    },
    {
      "id": 27128530,
      "author": "esaulenka",
      "datetime": "2024-08-05T09:47:29.000Z",
      "text": "А если готовность нужна в 6:15, а сейчас 22:37?Те же 7 часов. И пусть полчасика на подогреве постоит. Во-первых, считать надо, а во-вторых, вводить неудобно.хорошо бы и это вычитание не надо было делать - ввёл \"6:00\"Героев, которые напишут свою прошивку под мультиварку, я что-то не видел, а до инженеров-дизайнеров редмонда это что-то не доходит. Или, как минимум, не доходило три-пять лет назад - с последними их творениями не знаком. А так - я только за, в уме действительно считать неудобно (особенно когда уже собрался спать, и только потом вспомнил, что завтрака-то и нет)."
    },
    {
      "id": 27129398,
      "author": "Maxik12",
      "datetime": "2024-08-05T12:20:25.000Z",
      "text": "Героев, которые напишут свою прошивку под мультиварку, я что-то не виделНе мультиварка, да и прошивкой дело не ограничилось, но всё же: https://youtube.com/watch?v=ple5knuPTKQ"
    },
    {
      "id": 27129696,
      "author": "esaulenka",
      "datetime": "2024-08-05T13:22:31.000Z",
      "text": "Чем хороши неумные бытовые устройства - к ним не нужно никаких мобильных приложений, никакой JS лабуды. Несколько кнопок и экранчик - этого достаточно, чтобы включить подогрев до N градусов на T минут через D часов. Не у всех, правда, хорошо получается (это я про редмонд).Ну а этому товарищу повезло, что там унутре у ейнеонкаатмега. Обычно в такой простой бытовухе что-то совсем тупое и довольно экзотическое. Т.е. извольте сами найти документацию, компилятор, сваять из спичек с желудями программатор (какой ещё отладчик?!)."
    },
    {
      "id": 27127882,
      "author": "sdelaypausu",
      "datetime": "2024-08-05T07:49:03.000Z",
      "text": "Я не завтракаю. Поэтому не мучаюсь с тем, насколько выставить мультиварку, чтобы откушать кашку. И судя по комментам, я скучно живу :)"
    },
    {
      "id": 27127992,
      "author": "randomsimplenumber",
      "datetime": "2024-08-05T08:09:13.000Z",
      "text": "Я не завтракаюЛекция для колхозников (:"
    },
    {
      "id": 27128400,
      "author": "primedia",
      "datetime": "2024-08-05T09:23:44.000Z",
      "text": "а что, никто не готовит кашу на молоке? просто, насколько я понимаю, на молоке на ночь не оставишь. оно ж испортится."
    },
    {
      "id": 27128464,
      "author": "Javian",
      "datetime": "2024-08-05T09:35:01.000Z",
      "text": "Сейчас такое молоко, что быстрее испортится упаковка /s"
    },
    {
      "id": 27129216,
      "author": "Flashget",
      "datetime": "2024-08-05T11:43:45.000Z",
      "text": "Читал лайфхак, что вечером вместе с холодным молоком в мультиварку кидаешь ещё несколько кубиков льда, это помогает молоку продержатся до того как утром включится готовка. Сам правда не пробовал, не люблю молочные каши :-)"
    },
    {
      "id": 27129710,
      "author": "esaulenka",
      "datetime": "2024-08-05T13:25:03.000Z",
      "text": "Если молоко пастеризованное (т.е. хранится несколько месяцев в закрытом пакете), ничего с ним за ночь не случается, даже в тёплой мультиварке.А непастеризованное может и в холодильнике скиснуть..."
    },
    {
      "id": 27129724,
      "author": "BaRoN",
      "datetime": "2024-08-05T13:29:21.000Z",
      "text": "Только ультрапастеризованное молоко годится для этого. UHT, если за границей."
    },
    {
      "id": 27130032,
      "author": "voldemar_d",
      "datetime": "2024-08-05T14:24:19.000Z",
      "text": "Ультрапастеризованное не испортится."
    },
    {
      "id": 27128848,
      "author": "boroda_el",
      "datetime": "2024-08-05T10:48:10.000Z",
      "text": "Крутейшая программа которая складывает 3 числа."
    },
    {
      "id": 27129128,
      "author": "empenoso",
      "datetime": "2024-08-05T11:22:20.000Z",
      "text": "Это не программа, а облегчение самому себе жизни для взаимодействия со старой мультиваркой."
    },
    {
      "id": 27129366,
      "author": "DOKL57",
      "datetime": "2024-08-05T12:15:13.000Z",
      "text": "Всё же это программа :)"
    },
    {
      "id": 27129676,
      "author": "Gromilo",
      "datetime": "2024-08-05T13:19:07.000Z",
      "text": "Важен не размер программы, а умение приносить пользу (:"
    },
    {
      "id": 27131442,
      "author": "muxa_ru",
      "datetime": "2024-08-05T22:00:44.000Z",
      "text": "Программа хрень и не решает поставленной задачи.У нас в условиях \"пользователь-идиот\", а раз он идиот, то мы не можем быть уверены в том, что он введёт правильно вычисленное время.То есть, нужно приложение, которому будет скармливаться фотография запущенного таймера, а приложение будет сверяться с текущим временем и убеждаться что таймер установлен верно."
    },
    {
      "id": 27131986,
      "author": "randomsimplenumber",
      "datetime": "2024-08-06T05:27:52.000Z",
      "text": "скармливаться фотография запущенного таймераНужно упрощать жизнь а не усложнять."
    },
    {
      "id": 27133696,
      "author": "muxa_ru",
      "datetime": "2024-08-06T11:07:27.000Z",
      "text": "По условиям задачи, пользователь склонен к путанице и мы делаем решение которое не даёт ему эту путаницу совершить."
    },
    {
      "id": 27151734,
      "author": "Visier",
      "datetime": "2024-08-11T10:04:20.000Z",
      "text": "По правде говоря, мне кажется, что для таких вычислений нет необходимости писать скрипты, а можно обойтись просто формулами Google Sheets или Эксель.Позволю чебе поделиться своим опытом. Показалось, что заниматься Шитами долго и неудобно  как правило время окончания готовки и длительность 1) одинаковы, 2) двольно простые. Например: готово в 6:45, длительность 3:30 (я использую режим медленной готовки, так молоко не пригарает к дну). Легко посчитать в уме, что старт готовки должен быть в 3:15. Далее я просто тихо, чтобы никого не разбудить говорю в телефон:— эй, Гугл, сколько времени до трёх пятнадцатиЕсли бы это не работало, я бы смотрел в сторону бота для телеги."
    },
    {
      "id": 27151736,
      "author": "empenoso",
      "datetime": "2024-08-11T10:05:42.000Z",
      "text": "В статье есть ссылка на таблицу, и в ней как раз два варианта: первые формулы, второй-скрипт."
    },
    {
      "id": 27151826,
      "author": "Visier",
      "datetime": "2024-08-11T10:27:54.000Z",
      "text": "Спасибо. Просто плохо понимаю, зачем считать через скрипты, но как упражнение для изучения этих скриптов, наверное, подойдёт."
    },
    {
      "id": 27151742,
      "author": "empenoso",
      "datetime": "2024-08-11T10:06:16.000Z",
      "text": "Например Алиса не умеет вычислять время"
    },
    {
      "id": 27151832,
      "author": "Visier",
      "datetime": "2024-08-11T10:28:51.000Z",
      "text": "\"Моя\" Алиса только что смогла :)"
    },
    {
      "id": 27152230,
      "author": "empenoso",
      "datetime": "2024-08-11T12:29:16.000Z",
      "text": "Какой запрос сказали?"
    },
    {
      "id": 27152302,
      "author": "Visier",
      "datetime": "2024-08-11T12:52:45.000Z",
      "text": "Скажу честно, когда писал текстом, Алиса меня поняла не с первого раза. Но в тот раз, когда не поняла, она отправила меня в Яндекс, где был неплохой сайт calculat.io где тоже хорошо и просто считается. Судя по всему, там можно сохранить вычисление как ссылку в браузере и получать то, что нужно за 1 тык в будущем."
    }
  ]
}