{
  "url": "https://habr.com/ru/articles/835202/comments/",
  "article_id": 835202,
  "title": "А что если вместо банковского вклада использовать облигации после резкого повышения ставки Банком России?",
  "comments": [
    {
      "id": 27154176,
      "author": "edogs",
      "datetime": "2024-08-12T00:44:56.000Z",
      "text": "Какие у облигаций есть особенности?Покупать облигации всегда выгоднее, когдаключевая ставка высокая (сейчас 18%).  В таких случаях рыночная цена облигаций будет ниже, а доходность к погашению -больше.При покупке облигаций доходность фиксирует на всё время владения облигациями до их погашения.Когда  Банк России начнет снижать ставку, доходность облигаций начнет падать,  а цена -расти, но доходность облигаций, которые уже куплены останется  неизменной.В список особенностей, раз уж проговариваем такие очевидные вещи, имхо, надо добавить не только оптимистично позитивные, но и пессимистично негативные.Как-то. Если эмитент облигаций скажет \"ой всё\" (критерии \"ой всё\" у разных выпусков могут быть разные), то выплаты могут быть заморожены/отменены (например, если в выпуске указано условием отмены выплат показатели доходности ниже какой-то цифры) или вообще можно оказаться кредитором последней очереди без шансов что-то получить (если эмитент ушел в банкротство). Так же если ключевая ставка вырастет, то рыночная цена облигации упадет и останется либо продавать дешевле чем купил, либо ждать конца срока облигации получая при этом доход ниже актуального рыночного.p.s.: А скрипт полезный, спасибо:)"
    },
    {
      "id": 27154182,
      "author": "litos",
      "datetime": "2024-08-12T00:49:04.000Z",
      "text": "Можно покупать облигации ОФЗ, если по ним государство скажет \"ой всё, платить не будем\", то и вклады в таком случае тоже вряд-ли получите обратно."
    },
    {
      "id": 27154224,
      "author": "tuxi",
      "datetime": "2024-08-12T02:16:12.000Z",
      "text": "По офз такой красивой картинки (я про % в статье) уже не будет. А корпоративные облигации как верно заметили, можно держать только если есть либо хороший инсайд внутри самой компании, либо в банке который кредитует эту компанию. Раз корпораты готовы сейчас занимать под 20% (+-), то значит банки им уже не готовы давать под такой процент. Подумайте почему."
    },
    {
      "id": 27154242,
      "author": "empenoso",
      "datetime": "2024-08-12T02:32:16.000Z",
      "text": "Не обязательно покупать одну облигацию - можно 100% денег на облигации разбить по 5% на одну облигацию - получится 20 бумаг. Диверсификация."
    },
    {
      "id": 27154250,
      "author": "tuxi",
      "datetime": "2024-08-12T02:40:51.000Z",
      "text": "И чем она поможет, если рынок корпоративных облигаций посыпется? Поймите, биржа/рынок созданы не для того, чтобы мы с вами заработали или сохранили свои сбережения, они созданы, чтобы легально отбирать их. В текущий момент времени, корпоративные облигации одни из самых рискованных вложений. При потере даже четверти таких вложений, вы проиграете банковскому депозиту.Плюс, в облигациях  есть понятие оферты, когда (если) ситуация начнет нормализовываться, компания просто направит оферту и погасит облигации досрочно, и планируемая доходность никак не получится."
    },
    {
      "id": 27154264,
      "author": "empenoso",
      "datetime": "2024-08-12T02:51:49.000Z",
      "text": "Не согласен с вашей позицией.На счёт оферт - они заранее объявляются. Скрипт их учитывает - посмотрите код. Можно исключить эти бумаги"
    },
    {
      "id": 27155124,
      "author": "shares-caisson",
      "datetime": "2024-08-12T06:20:54.000Z",
      "text": "биржа/рынок созданы не для того, чтобы мы с вами заработали или сохранили свои сбережения, они созданыБиржа/рынок созданы для того, чтобы участники рынка имели доступ к необходимым им финансовым инструментом, а если при этом происходит переток денег от глупых к смелым или от умных к удачливым -- это просто естественный ход событий, в конце концов, никто на рынок силком не тянет, дело строго добровольное."
    },
    {
      "id": 27155138,
      "author": "empenoso",
      "datetime": "2024-08-12T06:24:17.000Z",
      "text": "Точно"
    },
    {
      "id": 27155770,
      "author": "tuxi",
      "datetime": "2024-08-12T08:30:45.000Z",
      "text": "Но мы же с вами относимся к категории \"удачливых\"? Это первый признак желания поиграть в казино кстати."
    },
    {
      "id": 27155826,
      "author": "Balling",
      "datetime": "2024-08-12T08:45:35.000Z",
      "text": "Мы арестовали 70% всех акций Мосбиржы, те, что принадлежат Blackrock и др. из США и Еаропы. А значит там всё двигают физики."
    },
    {
      "id": 27155880,
      "author": "shares-caisson",
      "datetime": "2024-08-12T08:56:23.000Z",
      "text": "Не... Я в категории осторожных, из тех кто вкладывается только в то, что понимает и понимаю что я либо достаточно глуп, чтобы предсказывать рыночные ветра, либо просто не готов выделять достаточно усилий на анализ. Зная что делают (в том плане какие усилия прикладывают) те кто на рынке успешен, я понимаю что мой удел это не торговля и ловля интересных инструментов, а условный пассивный индекс, да пара нвидий, которые я могу понять почему растут"
    },
    {
      "id": 27162460,
      "author": "Dmi3yD",
      "datetime": "2024-08-14T04:44:18.000Z",
      "text": "А я вот вложился в акции -RM, и теперь у меня больше 1 млн заморожено, по обмену на 100 000 вернули 4... Ну вот так вот..."
    },
    {
      "id": 27162616,
      "author": "empenoso",
      "datetime": "2024-08-14T05:45:40.000Z",
      "text": "Инфраструктурный риск, но от этого не легче"
    },
    {
      "id": 27160128,
      "author": "charypopper",
      "datetime": "2024-08-13T10:02:50.000Z",
      "text": "Про силком не толкает - это если б была альтернатива, а так есть инфляция, и все кроме цены на труд, дорожает. И инструментов кроме как ,,рынок,, - нет. Можно посидеть вне рынка, и кроме как обесценивание это ничего не даст, хотя порой на рынке можно прогореть в разы быстрее - похоже в этом и предоставленный выбор"
    },
    {
      "id": 27162594,
      "author": "shares-caisson",
      "datetime": "2024-08-14T05:30:27.000Z",
      "text": "С этим согласен, к сожалению, инфляция, создаваемая правительствами, действительно заставляет людей по сути изучать дополнительную профессию и заниматься второй (непроизводительной) работой в инвестиции только для того чтобы остаться при своих. Но это не вина рынка, это вина окружения в котором рынок существует. Было бы большим плюсом, если бы можно было просто заработать, положить в банку и дальше иметь возможность распоряжаться в любой момент, без обесценивания. И чтобы в цене жилища не было инвестиционной составляющей и чтобы золото было промышленным металлом, а бонды были инструментом, который корпорации продают друг другу для разделения рисков, а не физикам для спекуляций"
    },
    {
      "id": 27154258,
      "author": "Anton_Menshov",
      "datetime": "2024-08-12T02:45:15.000Z",
      "text": "многое будет зависеть от вашего трейдера и абсолютного значения 100% . Ибо часто такое разделение влечет увеличение комиссии в, упрощенно, 20 раз. При достаточной сумме инвестиции - это могут быть копейки и диверсификация вещь хорошая."
    },
    {
      "id": 27158750,
      "author": "edogs",
      "datetime": "2024-08-12T23:03:19.000Z",
      "text": "Не  обязательно покупать одну облигацию - можно 100% денег на облигации  разбить по 5% на одну облигацию - получится 20 бумаг. Диверсификация.Диверсификация это хорошо разрекламированная идея о том, что ставить в казино на красное и черное одновременно отличный ход. Мол - в любом случае хоть где-то деньги да останутся. Но если внимательно присмотреться к этой идее, то диверсификация по сути это стратегия при которой при любом движе будут потери, к том уже стратегия провоцирующая на риск, т.к. типа потери небольшие, можно и рискнуть."
    },
    {
      "id": 27160350,
      "author": "jinn50k",
      "datetime": "2024-08-13T10:57:15.000Z",
      "text": "Что? Вы понимаете что вы сейчас написали полную чушь? Сравнение финансовых инструментов с казино это отличная идея (нет) если бы не одно но, игра в казино это деятельность с отрицательным мат ожиданием, тк всегда есть владельцы казино и они имеют свой процент с каждой вашей ставки явным или не явным образом. Акции же, облигации и прочие на них деривативы обладают одним важным преимуществом - они имеют положительную премию за риск и генерируют денежный поток сами по себе. Да, конечно, существуют разнообразные налоги и комиссии, но они, как правило, существенно ниже премии за риск. Что касается такого явления как Диверсификация, это инструмент контроля за рисками и риски нужно контролировать согласно вашим инвестиционным целям, а не просто от балды. Так вот, это один из немногих инструментов, который позволяет снизить некомпенсируемые риски, а некомпенсируемые риски это то, от чего вам нужно избавляться."
    },
    {
      "id": 27160858,
      "author": "edogs",
      "datetime": "2024-08-13T13:00:22.000Z",
      "text": "Вы понимаете что вы сейчас написали полную чушь?То что у Вас другая точка зрения - не значит что оппонент пишет чушь. А то что мы не согласны с Вашей точкой зрения, не делает нас идиотами не понимающими что они пишут чушь.игра в казино это деятельность с отрицательным мат ожиданием, тк всегда  есть владельцы казино и они имеют свой процент с каждой вашей ставкиВладельцы брокерских компаний так же имеют свой процент. А еще бОльший процент с рынка акций в целом имеют те, кто им в той или иной мере управляет. Для обычного пользователя это точно так же игра с отрицательным мат.ожиданием, естественно, с поправкой на удешевление стоимости денег.Акции же, облигации .... генерируют  денежный поток сами по себе.Ничего не возникает и не исчезает само по себе.и прочие на них деривативы обладают одним важным  преимуществом - они имеют положительную премию за рискТермин \"премия за риск\" изначально маркетологический, как диверсификация. Он направлен на создание впечатления, что покупателю выплачивают премию просто за то, что он рискует. В реальности покупатель просто рискует и либо выигрывает либо нет, без всяких премий в традиционном понимании.Диверсификация, это инструмент контроля за рискамиНе контроля рисков, а распределения рисков.Если Вы поставили на красное и черное разом, Вы не снизили этим риски и не стали их контролировать, Вы их просто распределили."
    },
    {
      "id": 27170812,
      "author": "3Demon",
      "datetime": "2024-08-16T06:11:42.000Z",
      "text": "Вы хороши в софистике, снимаю шляпу"
    },
    {
      "id": 27155436,
      "author": "xSVPx",
      "datetime": "2024-08-12T07:24:07.000Z",
      "text": "Так по ним % меньше чем по депозиту.Из депозита всегда есть выход с потерей процентов, а из облигаций нету.Смысл ?"
    },
    {
      "id": 27155476,
      "author": "empenoso",
      "datetime": "2024-08-12T07:31:16.000Z",
      "text": "Как раз из облигации можно выйти в любой момент и получить накопленный купонный доход ещё сверху"
    },
    {
      "id": 27155738,
      "author": "cliver",
      "datetime": "2024-08-12T08:23:08.000Z",
      "text": "Нельзя выйти в любой момент. Зависит от количества у вас на балансе и ликвидности на рынке в данный момент. Может получиться так, что этот \"любой момент\" упадет ликвидность и вам придется продавать по плохой цене (это еще в лучшем случае). Два года назад вот вообще торги закрыли на месяц - это тоже говорит о том, что \"любой момент\" - слишком оптимистичное утверждение.Короче, если вы не понимаете про ликвидность, не советую лезть в рынок корпоративных облиг."
    },
    {
      "id": 27160890,
      "author": "edogs",
      "datetime": "2024-08-13T13:07:20.000Z",
      "text": "Нельзя выйти в любой момент. Зависит от количества у вас на балансе и ликвидности на рынке в данный момент.С ликвидностью и потерями в ряде случаев может быть немного прощенапример народные облигацииОсновное преимущество зеленых/народных облигаций для населения  —  вложенные средства можно вернуть в любой момент со всеми накопленными  процентами, не дожидаясь даты погашения. Эмитент выкупит их обратно по  цене покупки плюс накопленный купонный доход.https://finuslugi.ru/invest/bonds/moscow/calculatorhttps://finuslugi.ru/invest/bonds/mts/calculator"
    },
    {
      "id": 27168874,
      "author": "xSVPx",
      "datetime": "2024-08-15T15:03:43.000Z",
      "text": "Ээээ выйти и получить доход ;)?Ну т.е. я сегодня покупаю десятилетние облигации с 20% купоном, завтра ставка рефинансирования 18->100% и я смогу вернуть из облигаций свои деньги, да еще с доходом :)?Зачем вы меня.... обманываете ?"
    },
    {
      "id": 27169002,
      "author": "Antra",
      "datetime": "2024-08-15T15:46:22.000Z",
      "text": "ставка рефинансирования 18->100%Что это значит? Если ставка рефинансирования резко увеличтся (скажем, удвоится), значит \"альтернативные методы\" (например, вклад) на каждую вложенную тысячу рублей станут приносить доход вдвое больше. И тогда вашу облигацих за 1000 руб не купят, вы ее сможете продать лишь за полцены.Если ставка рефинансирования вдвое снизится, тогда вы сможете продать ее дороже. Либо остаться с ней и получать доход больше, чем по новым вкладам. Как, собственно, по давно открытым долгосрочным вкладам.И получается, что \"если вы угадали, что скоро ставка понизится\" и вложились надолго, вы молодец. И с таким везением неважно, вложились вы надолго в облигацию или во вклад. Будете свои 20% годовых получать, когда остальные только 10%.А если не угадали (и ставка удвоилась) - вклад можно закрыть, потеряв чуть-чуть процентов, и открыть по новой, высокой ставке. А с облигами упс."
    },
    {
      "id": 27169900,
      "author": "xSVPx",
      "datetime": "2024-08-15T21:29:46.000Z",
      "text": "Вы отвечаете в тред, где я писал, что при любом развитии событий депозит можно расторгнуть, и вернуть деньги, а мне задвигали, что и из облигаций \"можно выйти да еще и купонный доход получить\".Основной мой вопрос звучит так: в чём смысл краткосрочно вкладывать в облигации, если депозит дает не меньше?"
    },
    {
      "id": 27170542,
      "author": "Antra",
      "datetime": "2024-08-16T05:10:18.000Z",
      "text": "Просто не поyял \"18->100%\". А по существу - да, совершенно с вами согласен. Вкладываться краткосрочно в облигации, да еще сейчас - странная затея."
    },
    {
      "id": 27170870,
      "author": "3Demon",
      "datetime": "2024-08-16T06:27:04.000Z",
      "text": "Депозит обычно даёт меньше и \"замораживает\" деньги в нём."
    },
    {
      "id": 27171746,
      "author": "xSVPx",
      "datetime": "2024-08-16T09:45:06.000Z",
      "text": "Как вы планируете придать ликвидность деньгам вложенным в облигации если ставка вырастет вдвое ?   Просто зафиксировать убыток, скажем в половину тела :)?Депозит, повторюсь, можно расторгнуть в любой момент и получить 100% тела...  Что он замораживает?  Что это слово означает вообще :)?"
    },
    {
      "id": 27170858,
      "author": "3Demon",
      "datetime": "2024-08-16T06:23:09.000Z",
      "text": "Вы описали сценарий облигаций с постоянным купоном, но также существуют и облиги с плавающим купоном и для них высказывание справедливо. Доходность не фиксирована, но в моменте превышает доходности вкладов. Разве что вы не сможете зафиксировать условные \"20%\" на условные 10 лет. Но если вы ждёте/боитесь повышения ставки до условных 100% на горизонте этих 10 лет то лезть в 20% нет никакого смысла, в т.ч. и во вклады. В том и соль биржи: она даёт инструменты, и если грамотно использовать правильно подобранный инструмент то можно получить выгоду, ну а если неправильно и неправильный - убыток."
    },
    {
      "id": 27170874,
      "author": "Antra",
      "datetime": "2024-08-16T06:27:47.000Z",
      "text": "Можно пример облигации, которую вы считаете выгодной, если в середине следующего года ставка рефинансирования станет 24%?"
    },
    {
      "id": 27171390,
      "author": "3Demon",
      "datetime": "2024-08-16T08:21:23.000Z",
      "text": "Вводных данных мало: как долго по вашему мнению будет держаться такая ставка, куда пойдет дальше, ваш срок инвестирования, желаемый доход и допустимый риск. По итогу приведу максимально консервативные офз со ставкой руониа: к примеру офз-пк 29024. Если рассматривать корпоратов то можно выбрать к примеру какой-нибудь газпнф3P94R со ставкой руониа+1.4.Ну и я не зря говорил про правильный выбор инструментов: выбирать их надо под свои нужды, цели и параметры (сроки/риски/доходность и т.д.). Работа с ценными бумагами на рынке требует хотя бы базовых знаний о инструментах и понимания чего вы хотите добиться. Вклады, как альтернатива - предлагают доходность ниже, практически никакой гибкости, но зато почти не требуют знаний. Хотя там тоже надо понимать чего вы хотите, на каком промежутке времени и допустимые риски - вклады ведь тоже можно открывать лесенкой чтобы уменьшить потери если ставка будет расти, но сохранить повышенную доходность хотя бы частично если ставка будет падать."
    },
    {
      "id": 27171750,
      "author": "xSVPx",
      "datetime": "2024-08-16T09:46:15.000Z",
      "text": "Какие облигации с переменным купоном дают ныне 18+% годовых ?"
    },
    {
      "id": 27171842,
      "author": "tuxi",
      "datetime": "2024-08-16T10:08:26.000Z",
      "text": "в ОФЗ такого нет, только если корпоративные. А там могут быть сюрпризы, раз банки уже не дают этим корпоратам деньги взаймы."
    },
    {
      "id": 27173628,
      "author": "xSVPx",
      "datetime": "2024-08-16T18:02:08.000Z",
      "text": "Так и чего он нам втирает про \"правильный выбор облигаций\" :)?Пока такие депозиты смысла в облигациях... немного.  Интересно как будут в этот раз \"брить\", но вряд ли будут топ банки банкротить...Зы. Там если большое усреднение по руониа, то на обратном склоне горба он будет выгоднее ставки. Но толку от этого не так много как кажется."
    },
    {
      "id": 27173974,
      "author": "tuxi",
      "datetime": "2024-08-16T20:00:34.000Z",
      "text": "Один умный человек сказал месяц назад: \"ждите, скоро придут люди и начнут публично агитировать за облигации. бегите от них.\""
    },
    {
      "id": 27174166,
      "author": "xSVPx",
      "datetime": "2024-08-16T21:24:06.000Z",
      "text": "Они за что агитировать то могут ?  Вкорячьте в облигации под 16% вместо депозитов под 18% :)?  Как-то совсем тупо.Единственный аут видится в \"наберите под 16%, и подлиннее, а когда ставка вернется к 5% за счет переоценки тела заработаете 100500 денег\".  Но этож только на лудоманов может подействовать, которым сыграть в предсказание ставки не терпится. Остальные по идее должны понять, что если ставка станет скажем 30, то получится какая-то форменная фигня..."
    },
    {
      "id": 27173986,
      "author": "tuxi",
      "datetime": "2024-08-16T20:04:02.000Z",
      "text": "Но ОФЗ глубоко сливать тоже опасно. Основные держатели - те же топ банки. Что-то придумают наверняка, чтобы накернить, вопрос что именно."
    },
    {
      "id": 27174170,
      "author": "xSVPx",
      "datetime": "2024-08-16T21:25:23.000Z",
      "text": "Да понятно же уже. В субборды загонят и их спишут потом. И всё.А с бизнеса потом деньги возьмут. С них уже один раз взяли. \"Добровольно\"."
    },
    {
      "id": 27174576,
      "author": "Antra",
      "datetime": "2024-08-17T04:58:04.000Z",
      "text": "Например, можно повысить всякие лимиты на обеспечение кредитов так, что банкам будет выгодно на деньги вкладчиков брать ОФЗ не потому, что ставки по ним привлекательные, а потому что по другим вариантам придется морозить уйму средств, и это станет крайне невыгодно.Вот депозиты населения и перетекут в ОФЗ так, что мы даже и не узнаем. А потом расплатиться - \"печать\"  в том или ином виде никто не отменял.А то, что будут ставки по кредитам бизнесу запредельные и рост цен изумляющий - так счастливой жизни уж давно никто даже не обещает."
    },
    {
      "id": 27155498,
      "author": "asdfddsa",
      "datetime": "2024-08-12T07:39:14.000Z",
      "text": "Можно покупать облигации ОФЗ, если по ним государство скажет \"ой всё,  платить не будем\", то и вклады в таком случае тоже вряд-ли получите  обратно.Дефолт государства не означает одновременного банкротства банков. К тому же вклады застрахованы, а облигации нет. Погашение гособлигаций может быть заморожено и отсрочено, без объявления дефолта. Государство - это самый бессовестный жулик на финансовых рынках, которому никакие правила не писаны.Статья - реклама говняшки, их всегда очень много появляется в такие моменты, когда какой-то скам впаривают хомякам. Полгода назад из всех щелей впаривали замещающие облигации, можете посмотреть, насколько это говно упало, там речи не идет даже свое вернуть, не говоря о доходности."
    },
    {
      "id": 27155596,
      "author": "empenoso",
      "datetime": "2024-08-12T07:58:25.000Z",
      "text": "Реклама?"
    },
    {
      "id": 27155772,
      "author": "cliver",
      "datetime": "2024-08-12T08:31:09.000Z",
      "text": "Дефолт государства не означает одновременного банкротства банков.В идеале - да, в реальности - нет. То что банки используют достаточно большие позиции ОФЗ в качестве залога на рынке РЕПО, говорит о том, что есть огромный системный риск, который может реализоваться при дефолте."
    },
    {
      "id": 27157912,
      "author": "Ivan22",
      "datetime": "2024-08-12T16:43:14.000Z",
      "text": "был дефолт по ОФЗ в 98-м году.  Много банков тогда тоже посыпалось, но в целом меньшинство по рынку. 90% депозитов не пострадало (ну всего-то обесценились, но это другая история)"
    },
    {
      "id": 27158038,
      "author": "tuxi",
      "datetime": "2024-08-12T17:12:01.000Z",
      "text": "Про ГКО почему-то многие быстро забыли...PS: ну и как обесценились.. тем кому в итоге выплатили спустя год, их сбережения  обнулились практически, я про покупательную способность денег."
    },
    {
      "id": 27168882,
      "author": "xSVPx",
      "datetime": "2024-08-15T15:04:43.000Z",
      "text": "Вроде бы с гко физикам вернули ?"
    },
    {
      "id": 27171846,
      "author": "tuxi",
      "datetime": "2024-08-16T10:09:10.000Z",
      "text": "Насколько помню, физлица напрямую в ГКО не могли играть, только через схемы."
    },
    {
      "id": 27158748,
      "author": "edogs",
      "datetime": "2024-08-12T23:01:15.000Z",
      "text": "Можно покупать облигации ОФЗ, если по ним государство скажет \"ой всё,  платить не будем\", то и вклады в таком случае тоже вряд-ли получите  обратно.И тем не менее есть существенная разница в ситуации, когда не \"ой всё\", но все же \"сложной\".По вкладам - Вы в принципе хоть завтра можете получить тело вклада, пусть даже за вычетом выплаченных процентов, по любому вкладу.По ОФЗ - гарантированная выплата только в случае окончания срока ОФЗ.Грубо говоря если завтра вдруг ставка взлетает (как допустим в турции или аргентине) до 50% и без внятных перспектив, а Вы сидите с ОФЗ по которым платится 12%, то за какие-нибудь значимые деньги Вы из них них не выйдете. А вот из вкладов выйдите.Полного отказа от выплат по ОФЗ государство не допустит, ну, потому что а зачем? Достаточно поменять ключевую скажем на 50% и те же офз можно будет выкупить за полцены:)"
    },
    {
      "id": 27154216,
      "author": "empenoso",
      "datetime": "2024-08-12T01:52:20.000Z",
      "text": "В инвестициях нет гарантий"
    },
    {
      "id": 27154406,
      "author": "lexore",
      "datetime": "2024-08-12T04:22:47.000Z",
      "text": "Вы сами дали прекрасный ответ на главный вопрос статьи:А что если вместо банковского вклада использовать облигации после резкого повышения ставки Банком России?Со вкладами есть хоть какое-то подобие гарантий с АСВ. Выходит, проценты те же, риск выше, смысла нет."
    },
    {
      "id": 27154418,
      "author": "empenoso",
      "datetime": "2024-08-12T04:29:51.000Z",
      "text": "Это просто ещё один из вариантов.Я смотрю иногда канал на Ютубе Железная ставка - расследования про разные пирамиды и мошенничество - меня очень удивляет какое огромное число людей продает свою единственную квартиру и несут эти деньги в пирамиду.С облигациями так никто не делает. Облигации это просто понятный инструмент безо всякого мошенничества."
    },
    {
      "id": 27154438,
      "author": "lexore",
      "datetime": "2024-08-12T04:40:39.000Z",
      "text": "Низкая финансовая грамотность населения - это еще один бич современности, да.Кстати, облигации - это не на столько простой инструмент, как может показаться. На другом канале, \"rational answer\" автор уже 9 постов накатал про нюансы облигаций. Я даже уверен, что не все могут сходу ответить, что такое \"Дюрация\". Но потерять все деньги на облигациях сложнее, соглашусь."
    },
    {
      "id": 27155244,
      "author": "geirby",
      "datetime": "2024-08-12T06:45:22.000Z",
      "text": "Низкаяфинансоваяграмотность населенияПоправил."
    },
    {
      "id": 27155260,
      "author": "empenoso",
      "datetime": "2024-08-12T06:48:16.000Z",
      "text": "Мне кажется всё таки финансовая.Или ситуация вообще патовая у человека - и он знает, но хватается за последнюю соломинку."
    },
    {
      "id": 27155316,
      "author": "geirby",
      "datetime": "2024-08-12T06:56:26.000Z",
      "text": "Финансы это одно из базисных слагаемых нашей жизни. Думаю, что не ошибусь, если скажу, что это наличие элементарных знаний в финансовой области может служить показателем наличия элементарных знаний в других областях. И тотальная безграмотность населения в финансах (как микро, так и макро) хорошо коррелирует с состоянием общества (экономическим и в целом).Самый первый вопрос, который должен задавать себе взрослый и начинающий разбираться в экономической/финансовой составляющей это \"а сколько налогов я плачу?\"."
    },
    {
      "id": 27155364,
      "author": "empenoso",
      "datetime": "2024-08-12T07:09:15.000Z",
      "text": "Если только зп получать, то вопрос налогов не стоит совершенно"
    },
    {
      "id": 27156010,
      "author": "Kanut",
      "datetime": "2024-08-12T09:20:02.000Z",
      "text": "Почему? Даже если у вас нет возможности \"оптимизировать\" для себя уплату налогов, то на мой взгляд всё равно полезно понимать сколько налогов ты платишь, что это за налоги и на что они должны идти.И точно так же хорошо бы примерно понимать что за налоги платят все остальные, почему они их платят и на что они должны идти. Хотя бы в контексте основных и наиболее распространённых налогов."
    },
    {
      "id": 27156058,
      "author": "empenoso",
      "datetime": "2024-08-12T09:31:08.000Z",
      "text": "Как вы представляете это в реальной жизни для какого-нибудь рабочего?"
    },
    {
      "id": 27156088,
      "author": "Kanut",
      "datetime": "2024-08-12T09:39:09.000Z",
      "text": "А в чём вы видите проблему?  Это не то чтобы вот прямо необъёмное для среднего человека количество информации. Банальный запрос в гугле даёт кучу страничек где это более-менее нормально подано.Ну то вот первая же ссылка:https://journal.tinkoff.ru/fns-loves-you/Думаете рабочий с завода её не осилит? И по хорошему это всё можно и ещё лучше оформить.И такое даже спокойно можно и в школе преподавать. Что собственно и делается в куче стран мира."
    },
    {
      "id": 27156174,
      "author": "empenoso",
      "datetime": "2024-08-12T09:52:13.000Z",
      "text": "Невозможно оптимизировать налоги, когда вы только наёмный работник на зарплате.Или вы о другом? Не спать ночами, узнав сколько денег не доходит до своего кармана?"
    },
    {
      "id": 27156196,
      "author": "Kanut",
      "datetime": "2024-08-12T09:56:33.000Z",
      "text": "Ну да, я же написал \"даже если у вас нет возможности \"оптимизировать\" для себя уплату налогов\".  То есть речь именно  о понимании сколько ты отдаёшь государству и на что должны пойти эти деньги.И не знаю как там насчёт не спать по ночам, но на мой взгляд если большинство будет понимать сколько налогов они на самом деле платят, то политикам-чиновникам будет гораздо сложнее делать заявления а ля \"вам государство вообще в принципе ничего не должно \""
    },
    {
      "id": 27156236,
      "author": "empenoso",
      "datetime": "2024-08-12T10:04:06.000Z",
      "text": "Мне кажется вы описываете какой-то идеальный мир. В реальности *мне кажется* всё не так"
    },
    {
      "id": 27156278,
      "author": "Kanut",
      "datetime": "2024-08-12T10:11:54.000Z",
      "text": "Что \"не так\"? Что lюди по другому спрашивают с правительства-чиновников  если понимают сколько денег они ему отдают?Ну то есть как минимум в той реальности где я живу это вполне себе так. То есть конкретно в  этом контексте я вижу заметную разницу между Россией и целым рядом стран бывшего СССР и теми же странами западной Европы."
    },
    {
      "id": 27156218,
      "author": "geirby",
      "datetime": "2024-08-12T10:01:54.000Z",
      "text": "Финансовая грамотность это не про \"оптимизацию налогов\", очевидно же.И почему надо издеваться над рабочим? Потому что он рабочий или что? \"Не спать ночами\" -- это какой-то запредельный уровень снобизма.Кажется, в первую очередь КАЖДОМУ рабочему независимо от страны проживания неплохо бы знать, СКОЛЬКО он отдает ЗАРАБОТАННОГО. Возможно, тогда он начнет спрашивать \"почему\" и \"зачем\", приобретая таким образом чувство самоуважения, которое, судя по вашему комментарию, он не заслуживает исключительно из рода своей деятельности."
    },
    {
      "id": 27165640,
      "author": "LiquidBlasted",
      "datetime": "2024-08-14T18:41:09.000Z",
      "text": "Налоговые вычеты же. Не только за лечение, обучение (в т.ч. за детей), покупки квартир - но и в том числе за инвестирование (если на ИИС). Кроме того, полезно знать, а правильно ли тебе насчитали налоги. Например, в 2015 в базе налоговой произошел какой-то сбой, и у них вдруг мои паспортные данные сменились на старый паспорт (тот самый первый, который в 14 лет дают). А поскольку прописан я был по нему в другом регионе - мне автомобильный налог считали неправильно по более высокой ставке. Если б не перепроверил за налоговиками начисленное по формуле - так бы и платил лишнее. Как вам такое?"
    },
    {
      "id": 27156402,
      "author": "patex",
      "datetime": "2024-08-12T10:33:49.000Z",
      "text": "Это смотря где, во многих странах можно хорошо оптимизировать налоги с зарплаты"
    },
    {
      "id": 27160756,
      "author": "edogs",
      "datetime": "2024-08-13T12:27:29.000Z",
      "text": "Если только зп получать, то вопрос налогов не стоит совершенноЕсли только зп получать, то да. А вот если еще к доктуру сходить или в спортзал или квартиру купить в ипотеку или еще что-то, то возникает вопрос с налоговыми вычетами."
    },
    {
      "id": 27155836,
      "author": "hw_store",
      "datetime": "2024-08-12T08:47:06.000Z",
      "text": "тут надо рекламировать книжку \"Финансы для нефинансистов\". В ней, правда, много лишнего, но зато она даёт общее понимание, что такое финансово-хозяйственная деятельность"
    },
    {
      "id": 27155864,
      "author": "empenoso",
      "datetime": "2024-08-12T08:54:14.000Z",
      "text": "Гораздо лучше: «Деньги без дураков» — это и учебник по инвестированию для  начинающих, и пособие для трейдеров, и введение в поведенческие финансы.  Автор Александр Силаев"
    },
    {
      "id": 27155448,
      "author": "xSVPx",
      "datetime": "2024-08-12T07:27:15.000Z",
      "text": "Все сложнее в депозитах.Половину в облигациях легко. Покупаете, получаете ставку 30% надолго и всё, денежки тютю...И это без банкротств."
    },
    {
      "id": 27155478,
      "author": "empenoso",
      "datetime": "2024-08-12T07:31:42.000Z",
      "text": "30% ?"
    },
    {
      "id": 27156304,
      "author": "czz",
      "datetime": "2024-08-12T10:15:45.000Z",
      "text": "Вот что имеется в виду:Взял облигации с купоном 10% на 10 лет.Внезапно раз, что-то случилось, ставка 30%.Профит!"
    },
    {
      "id": 27156656,
      "author": "empenoso",
      "datetime": "2024-08-12T11:33:45.000Z",
      "text": "Мало ли что за 10 лет произойдёт - мне кажется больше чем 1,5 года облигации не стоит рассматривать. Но это только моё мнение."
    },
    {
      "id": 27154220,
      "author": "empenoso",
      "datetime": "2024-08-12T02:06:14.000Z",
      "text": "На мой взгляд в облигациях всегда имеет смысл держать до погашения - именно поэтому в скрипте есть фильтр дюрации - чтобы подобрать нужный срок."
    },
    {
      "id": 27154222,
      "author": "Anton_Menshov",
      "datetime": "2024-08-12T02:15:55.000Z",
      "text": "Облигацию не всегда имеет смысл держать до погашения. Пример: через какое-то время после покупки облигации на рынке появился инструмент (другая облигация, портфель акций, арбитраж, и т.д.), который вы оцениваете как более выгодный (риск-доход) даже с учетом потерь связанных с досрочной продажей уже имеющейся облигации с дисконтом."
    },
    {
      "id": 27155748,
      "author": "1nd1go",
      "datetime": "2024-08-12T08:26:40.000Z",
      "text": "Диапазон дюрации: от 3 до 18 месяцев.А почему дюрации ограничены 18 месяцами? Не полезно было бы иметь возможность искать длинные облигации для фиксирования высокой ставки на более длительный период (5, 10 лет)?"
    },
    {
      "id": 27155858,
      "author": "hw_store",
      "datetime": "2024-08-12T08:53:22.000Z",
      "text": "....например, купили ОФЗ 26238 за 50% и держим до м̶о̶р̶к̶о̶в̶к̶и̶н̶о̶г̶о̶ ̶з̶а̶г̶о̶в̶е̶н̶и̶я̶   2041 года, имея к погашению ~18% годовых. Вместо того чтобы продать её за 75%, когда ставку ЦБ снизят до 10%, и получить 50+ годовых однократно, а до того момента иметь свои 14-15 годовых."
    },
    {
      "id": 27155968,
      "author": "Ninil",
      "datetime": "2024-08-12T09:11:07.000Z",
      "text": "Тут не все так однозначно. Получить 50% годовых разово, конечно, заманчиво. Но вот что дальше с ними делать? Вкладывать под 8% ? В зависимости от горизонта инвестирования и целей, порою лучше 18% годовых на 20 лет зафиксировать, чем гнаться за сиюминутными 50% годовых на год."
    },
    {
      "id": 27156314,
      "author": "hw_store",
      "datetime": "2024-08-12T10:18:22.000Z",
      "text": "Например, поменять одну недвижимость на другую. Ведь деньги копят всё же для того чтобы их когда-нибудь тратить. Мы же тут не про управляющую компанию, у которой задача иметь долгосрочную доходность. Например, я может 20 лет и не проживу. ))...Кстати, 18% у таких бумаг получаетсяк погашению, то есть если на купоны от них приобретать эти же бумаги. А текущая доходность, т.е. отношение купона к текущей рыночной цене, значительно меньше."
    },
    {
      "id": 27156504,
      "author": "Ninil",
      "datetime": "2024-08-12T10:57:31.000Z",
      "text": "Кстати, 18% у таких бумаг получается к погашению, то есть если на купоны от них приобретать эти же бумагиНе совсем так. Предполагается, что на купоны ту инвестируешь в актив, с такой же доходностью к погашению(а не обязательно в эту бумагу). Если идет тренд на снижение % ставок, то да, реинвестируешь ты из явно под более низкую доходность. Но загадывать на 20 лет вперед - дело неблагодарное (можно посмотреть изменение ставки за период 2004 - 2024 ))))В любом случае, надо считать итоговые денежные потоки. Кстати, есть же облигации и просто дисконтные - в этом случае заморочек с реинвестированием купонов нет.Например, поменять одну недвижимость на другую.Мы говрим вроде о бумагах, а не недвижке) Все зависит от суммы. В облигации ты можешь вложить условно пару-тройку млн, на которые ты никакую недвижку не купишь приличную сейчас, да еще инвестиционно привлекательную."
    },
    {
      "id": 27156532,
      "author": "hw_store",
      "datetime": "2024-08-12T11:08:24.000Z",
      "text": "Если вдруг свалился на голову нежданный-негаданный доход в миллион-полтора (который мог бы плавно растянуться на 2-3 года, если не продавать эту ОФЗ), то можно миллион потратить на улучшение жилищных условий, а оставшиеся полмиллиона инвестировать дальше. Впрочем, лично у меня размеры инвестиций пока сильно скромнее."
    },
    {
      "id": 27156550,
      "author": "Ninil",
      "datetime": "2024-08-12T11:11:19.000Z",
      "text": "....миллион потратить на улучшение жилищных условийПо текущим ценам миллион - это не улучшение жилищных условий( это скорее легкий ремонт в одной из комнат только..."
    },
    {
      "id": 27156558,
      "author": "empenoso",
      "datetime": "2024-08-12T11:12:32.000Z",
      "text": "💯"
    },
    {
      "id": 27156628,
      "author": "hw_store",
      "datetime": "2024-08-12T11:29:53.000Z",
      "text": "По текущим ценам пара-тройка млн - это не инвестиция, а баловство. ;)"
    },
    {
      "id": 27156552,
      "author": "empenoso",
      "datetime": "2024-08-12T11:12:02.000Z",
      "text": "Я живу в Перми и за миллион никакие жилищные условия у нас в городе улучшить не получится. Если мы про квартиры говорим."
    },
    {
      "id": 27156624,
      "author": "hw_store",
      "datetime": "2024-08-12T11:28:37.000Z",
      "text": "Кучеряво живёте. По месту моей прописки двухкомнатная квартира стоит 2,5-3 млн., за миллион вполне можно переехать из старого дома в более новый"
    },
    {
      "id": 27170974,
      "author": "3Demon",
      "datetime": "2024-08-16T06:49:36.000Z",
      "text": "Страна большая, города разные. Не все хотят переехать в маленький городок в квартиру 40м² без транспортной доступности."
    },
    {
      "id": 27156060,
      "author": "empenoso",
      "datetime": "2024-08-12T09:31:28.000Z",
      "text": "Такие длинные сроки мне кажется очень плохая идея"
    },
    {
      "id": 27156302,
      "author": "hw_store",
      "datetime": "2024-08-12T10:14:52.000Z",
      "text": "Для людей, хорошо разбирающихся в экономике, - может быть неплохой идеей, т.к. при определённых обстоятельствах может иметь хороший спекулятивный потенциал. Но сейчас не то время, т.к. нет никакой ясности со сроком понижения ставки ЦБ."
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2024-08-12T08:54:57.000Z",
      "text": "Сейчас в бумажном виде нет"
    },
    {
      "id": 27155870,
      "author": "empenoso",
      "datetime": "2024-08-12T08:54:57.000Z",
      "text": "Сейчас в бумажном виде нет"
    },
    {
      "id": 27156690,
      "author": "Zenitchik",
      "datetime": "2024-08-12T11:41:12.000Z",
      "text": "Т.е. их ещё и не найдёшь."
    },
    {
      "id": null,
      "author": "Неизвестный пользователь",
      "datetime": "Дата не найдена",
      "text": "Комментарий пуст"
    },
    {
      "id": 27154244,
      "author": "lrrr11",
      "datetime": "2024-08-12T02:34:39.000Z",
      "text": "Все профессиональные инвесторы всегда говорят: сначала определитесь, чего вы хотите добиться, и только потом подбирайте себе инструменты под эти цели. Иначе вы неизбежно потеряете деньги. Если рассматривать облигации как альтернативу банковскому вкладу, тооблигаций есть очень много разных типов, и все эти типы могут вести себя совершенно по-разному в разных рыночных условиях. Дальше буду писать только про ОФЗ с фиксированным купоном.цена на облигации может не только повышаться, но и снижаться. Если вы например сейчас купите длинные ОФЗ с погашением лет через 10, а Эльвира Шахипзадовна в сентябре повысит ключевую ставку до 20%, то вы увидите интересные красные цифры у себя на счете и не сможете продать их без убытка либо до погашения через 10 лет, либо до тех пор, пока ключевую ставку снова не понизят. А когда это случится (иными словами, когда государство перестанет разгонять инфляцию большими военными расходами) - никто не знает.покупать облигации в расчете на то, что ключевую ставку рано или поздно понизят, и тогда они вырастут в цене - вот только при этом не учитывают, что после понижения ставки и на рынке акций (который сейчас как раз просел) начнется ралли. Причем вероятно куда более сильное, чем на рынке облигаций. Инвестировавшие в акции во время повышения ключевой ставки в 2022 году увеличили свои капиталы не на десятки процентов, а в разы.есть еще куча нюансов, о которых я не в курсе, типа налогов, налоговых вычетов, вероятности дефолта и т.п.Покупать ОФЗ вполне можно, если вы хотите получать гарантированный купонный доход и не собираетесь их продавать до погашения. Например, когда купоны покрывают ваши платежи по ипотеке - это хорошая тема."
    },
    {
      "id": 27154350,
      "author": "cathome_official",
      "datetime": "2024-08-12T04:07:06.000Z",
      "text": "\"цена на облигации может не только повышаться, но и снижаться. Если вы например сейчас купите длинные ОФЗ с погашением лет через 10, а Эльвира Шахипзадовна в сентябре повысит ключевую ставку до 20%, то вы увидите интересные красные цифры у себя на счете и не сможете продать их без убытка либо до погашения через 10 лет, либо до тех пор, пока ключевую ставку снова не понизят. А когда это случится (иными словами, когда государство перестанет разгонять инфляцию большими военными расходами) - никто не знает.\"для этого там есть фильтр по долгосрочности, лучше брать не более чем 1,5-2 года до окончания, т.к. это небольшой срок для ожидания в случае падения цены облигации."
    },
    {
      "id": 27154364,
      "author": "empenoso",
      "datetime": "2024-08-12T04:10:07.000Z",
      "text": "Можно и короче срок - скрипт даже 1 или 3 месяца находит иногда"
    },
    {
      "id": 27154362,
      "author": "randomsimplenumber",
      "datetime": "2024-08-12T04:08:31.000Z",
      "text": "купоны покрывают ваши платежи по ипотеке - это хорошая темаНе лучше сразу приобрести недвижимость на всю котлету денег?"
    },
    {
      "id": 27154368,
      "author": "empenoso",
      "datetime": "2024-08-12T04:10:42.000Z",
      "text": "У многих ли она есть?А облигации от тысячи рублей"
    },
    {
      "id": 27154484,
      "author": "DaneSoul",
      "datetime": "2024-08-12T04:59:46.000Z",
      "text": "А облигации от тысячи рублейНу так для выполнения условия \"Например, когда купоны покрывают ваши платежи по ипотеке - это хорошая тема.\" облигаций не на тысячи, а на миллионы надо набрать."
    },
    {
      "id": 27154494,
      "author": "empenoso",
      "datetime": "2024-08-12T05:02:29.000Z",
      "text": "Про ипотеку не я написал. У меня только скрипт для поиска"
    },
    {
      "id": 27155024,
      "author": "positroid",
      "datetime": "2024-08-12T05:58:54.000Z",
      "text": "Если ипотека под 5%, а сбережения дают 17% - нет, не лучше"
    },
    {
      "id": 27155946,
      "author": "randomsimplenumber",
      "datetime": "2024-08-12T09:08:23.000Z",
      "text": "Дешёвая ипотека это хорошо. а в чем подвох?"
    },
    {
      "id": 27156074,
      "author": "positroid",
      "datetime": "2024-08-12T09:35:20.000Z",
      "text": "Для покупателя недвижимости - одни плюсы. Для государства - необходимость дотации таких инструментов в долгосрок и вытекающая из этого повышенная бюджетная нагрузка."
    },
    {
      "id": 27156090,
      "author": "randomsimplenumber",
      "datetime": "2024-08-12T09:40:06.000Z",
      "text": "Ну, если платит кто-то другой, тогда конечно глупо платить котлетой сразу. Котлету нужно инвестировать и расплачиваться процентами."
    },
    {
      "id": 27156434,
      "author": "Antra",
      "datetime": "2024-08-12T10:40:08.000Z",
      "text": "И при этом учитывать риск, что котлету могут и отобрать (заморозить...), как уже бывало не раз.В эпоху перемен принимать решения становится намного труднее :("
    },
    {
      "id": 27168922,
      "author": "xSVPx",
      "datetime": "2024-08-15T15:13:19.000Z",
      "text": "В рисках. Вам при заключении брокерского договора должны были дать на подпись 2-3 листа мелким шрифтом. Там \"какая то абракадабра\".  По факту это перечисление всякого рода обобщенных звездецов.Того, чего не может произойти никогда.Например, всем совершенно очевидно, что свободная страна, такая как США если продала вам акций обратно их не отнимет и не заблокирует. Но описывающий подобную \"фантастическую\" фигню риск там скорее всего есть.Имеете ипотеку - один набор рисков.Имеете ипотеку и депозит - два набора.+Брокерский - еще один набор рисков.Итд итп.Лично я не стал бы играться с единственным жильём. С неединственным стал бы"
    },
    {
      "id": 27154346,
      "author": "cathome_official",
      "datetime": "2024-08-12T04:03:12.000Z",
      "text": "на самом деле круто, особенно если учесть, что есть сайты, которые за это берут деньги."
    },
    {
      "id": 27154420,
      "author": "empenoso",
      "datetime": "2024-08-12T04:30:14.000Z",
      "text": "Спасибо 🙏"
    },
    {
      "id": 27154424,
      "author": "azesm08",
      "datetime": "2024-08-12T04:32:16.000Z",
      "text": "С рисунком товарища Франклина хорошие облигации, а так скрипт отличный."
    },
    {
      "id": 27154464,
      "author": "empenoso",
      "datetime": "2024-08-12T04:53:08.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 27155482,
      "author": "xSVPx",
      "datetime": "2024-08-12T07:31:56.000Z",
      "text": "Фиг знает. В США не такая уж редкость двухзначная инфляция.  Куда эту зеленую бумагу девать и на что менять тот еще вопрос..."
    },
    {
      "id": 27155730,
      "author": "DracoL1ch",
      "datetime": "2024-08-12T08:22:33.000Z",
      "text": "А есть история и кол-во двухзначных инфляций сша?"
    },
    {
      "id": 27155974,
      "author": "tuxi",
      "datetime": "2024-08-12T09:11:47.000Z",
      "text": "Я помню, что в 80-х годах было такое. С большим трудом победили. И в 2022 году уже подбиралось к 10%, там не хватило полпроцента. Но система подсчета постоянно меняется, думаю, что если считать по системе 70-х..80-х годов, то и в 22м году была прилично большая."
    },
    {
      "id": 27157070,
      "author": "DracoL1ch",
      "datetime": "2024-08-12T13:07:06.000Z",
      "text": "Ну т.е. почти на протяжении 40 лет она была однозначной. На мой век инвестиций этого бы вполне хватило."
    },
    {
      "id": 27168862,
      "author": "xSVPx",
      "datetime": "2024-08-15T14:57:15.000Z",
      "text": "Отлично, когда есть машина времени.Плохо, когда ее нету."
    },
    {
      "id": 27157934,
      "author": "Ivan22",
      "datetime": "2024-08-12T16:48:10.000Z",
      "text": "9.1% в одном месяце было, а в среднем за год - меньше 8% было.  Так что ни разу не 2-х значная"
    },
    {
      "id": 27158020,
      "author": "tuxi",
      "datetime": "2024-08-12T17:09:14.000Z",
      "text": "А там интересная схема у них. Сначала публикуют данные, по ним охи ахи, потом в следующих данных выходит корректировка предыдущих. Манипулируют как хотят.Ну и совокупная инфляция  - это очень размытый термин. Надо смотреть по-секторно. А там было очень по разному, особенно в продовольствии и в энергетике."
    },
    {
      "id": 27158504,
      "author": "tuxi",
      "datetime": "2024-08-12T20:04:28.000Z",
      "text": "Аргументация минуса будет? А то предлагаю найти и ознакомиться из чего складывается \"инфляция\" в зависимости от страны и как меняются весовые коэффициенты. Тогда и вопросов не будет, почему имеет смысл сравнивать год к году по-секторно."
    },
    {
      "id": 27157518,
      "author": "SaX_KT",
      "datetime": "2024-08-12T14:55:19.000Z",
      "text": "Ну вкладываться в бумаги, эмитент которых имеет долгов на полтора ВВП, и просто процентов платит процентов 15 бюджета, тоже рискованно. Эта пирамида долго стоит, но ведь и рухнуть может когда-нибудь."
    },
    {
      "id": 27157608,
      "author": "Antra",
      "datetime": "2024-08-12T15:11:39.000Z",
      "text": "Если это долги в собственной валюте, рухнуть сложно. Народ до сих пор удивляется дефолту в России с ГКО.Эмиссию никто не отменял. Да, инфляция подскочит, да, ваши вернувшиеся к вам денежки будут уже не те. Но рухнуть - вряд ли."
    },
    {
      "id": 27157942,
      "author": "Ivan22",
      "datetime": "2024-08-12T16:50:05.000Z",
      "text": "ну если бы выриантов не было то да.  А так - если альтернатива - от биткоина до недвиги,  и то и другое не подвержено влиянию эмиссии ни рублей ни даже долларов. Накой ляд покупать те активы которые подвержены, и потом утешать себя что не все потерял, а часть :)"
    },
    {
      "id": 27154574,
      "author": "betax",
      "datetime": "2024-08-12T05:37:10.000Z",
      "text": "Отлично проделанная работа. Было бы вообще шикарно, подтягивать еще столбец \"Надежность\" (кредитный рейтинг) эмитента."
    },
    {
      "id": 27154598,
      "author": "empenoso",
      "datetime": "2024-08-12T05:41:04.000Z",
      "text": "Не уверен, что Мосбиржа его транслирует"
    },
    {
      "id": 27155896,
      "author": "hw_store",
      "datetime": "2024-08-12T08:59:13.000Z",
      "text": "можно со смартлаба взять"
    },
    {
      "id": 27156666,
      "author": "empenoso",
      "datetime": "2024-08-12T11:35:04.000Z",
      "text": "Это только на АПИ Мосбиржи всё написано."
    },
    {
      "id": 27154614,
      "author": "EvilTeacher",
      "datetime": "2024-08-12T05:43:44.000Z",
      "text": "Единственный гарантированный вариант беспроигрышного скрипта в казино - стать владельцем этого казино. Но даже в этом скрипте не учитываются все форс-мажоры... Особенно в нашей стране.... (Извините за эзопов язык)"
    },
    {
      "id": 27154652,
      "author": "empenoso",
      "datetime": "2024-08-12T05:46:51.000Z",
      "text": "Не стоит опускать руки. К тому же это не панацея и не волшебная таблетка.Это просто инструмент."
    },
    {
      "id": 27155222,
      "author": "cryptoscam",
      "datetime": "2024-08-12T06:40:58.000Z",
      "text": "ох уж эти людишки(С)сначала они накапливают рублики, а потом узнают, что у деняк есть скоропортящийся эффект (инфляция).Тогда все бегут в банки, солить бабосики, и видят там какие-то баснословные проценты (скажем 20%), и у них рождается в голове бизнес-модель. Эффект ее тоже скоропортящийся, ведь вскоре \"инвесторЪ\" узнает, что процентная ставка едва ли перекрывает инфляцию. Становится страшно от осознания, как быстро деньги теряют свою стоимость. Так умирает вера в \"магию деняк\". Оказывается, банки, так охотно берущие у людей деньги на сохранение, далеко не добрые самаритяне, и никого таким образом не спонсируют (раздавая проценты), максимум что могут предложить \"оставаться плюс-минус при своих\" на фоне инфляции. Ононо как Михалыч.Но раз рпубль так сильно проседает к доллару, тогда может лучше хранить в долларах? (инфа - актуалочка доСВО-шной эпохи). И тут их ждет сюрпрайз! Онли 1%. Не густо. Хотя сами скупают UST (те самые трежерис) с доходностью 3.5-6%. Ну а вкладчику 1%, за беспокойство.Тогда вот вам обрыгации, от независимых брокеров \"Остап Бендер и Ко\": те же самые баснословные проценты, но есть нюансик - выплаты по разумению брокера. То есть могут заплатить, а могут и нет. И что же они выберут? Догадайтесь с одной попытки...Вариантов тут всего 2:1. количество \"надонативших\" крайне мало (ввиду плохого маркетинга или иных условий), казалось бы дело-дрянь. Так оно и есть, но и тут есть плюсы. Чем меньше тел в обороте - тем проще выплатить проценты, непременно заявив об этом во всеуслышанье, что \"такой-то - такой-то выплачивает проценты по облигациям\", тем самым обеспечивая себе сарафан и \"очки надежности\". Глядя на такое, многие считают, что так будет всегда и несут деньги.2. Количество \"уверовавших и занесших деньги\" благодаря маркетингу (или бренду) слишком велико и выплата грозит неплохими затратами. Опасносте. Но выход есть: нужно всего-лишь провести \"аналитику\", перемножить все кризисы и пандемии на инфляции и сужения рынков, логистику и страховые риски, нестабильности рынков углеводородов и прочих ресурсодобыч и смешать обильно все это с лапшой и развесисто навешивать своим клиентам, мол, сейчас компания все еще в зоне убыточности и \"если мы вам выплатим проценты то нам придется уволить половину штата,\" фиг вам а не выплаты. Подождите когда закончатся все негативные факторы(спойлер: никогда), и тогда-то заживем богато как на ютубах.Звучит смешно, но Яндекс к примеру так и делает. Ну то есть недавно он все-такивпервыевыплатил проценты. Надо же, заставили похоже. Впервые. То есть все это время инвесторы просто хлопали глазками в ожидании \"с моря погоды\". Не ну а что? Вы же там богатые все, потЕрпите.Ужос? Паника? Грядущий крах?может быть. Но вот Трамп к примеру смекнул что делать. Не обошлось без американского максимализма конечно же, но на то они и американцы. Давайте мол превратим Амереку в Биткоиновую сверхдержаву! Отличный план, запоздавший лет на 10. Большее число биткоинов итак в Америке, но они в руках инвесторов, а не Госдепа, а это уже проблема. Просто так отобрать, навесив на себя флажок \"борьбы за демократию и безопасную безопасность всего мира\" не получится. Поэтому рисуют хитрые схемы. Раньше бы за такие \"схемы\" грозила статья за спекуляцию или инсайдерскую торговлю, но знаете, это ведь страна двойных (если не пятикратных) стандартов. Рынок есть рынок, и на нем нет правил. Которые бы Госдеп не мог переписать под себя.В других странах нефть дешевле и мешает нам торговать? Решаемо, агенты влияния и солдатики уже летят к вам \"вершить демократию и свержение кровавых режимов\". Неугодные будут либо завербованы, либо умерщвлены.Один только блокчейн стоит непреклонно, да и то, лишь благодаря тому, что он полностью автоматизирован и в его основе нет \"алчных двуногих\", которые легко внушаемы, управляемы, подкупны. Поэтому план \"скупить все биткоины\" нереализуем. Цена просто экспоненциально начнет расти. Отобрать их тоже не получится. Обесценить? Пробовали уже, каждый год хоронили по 50 раз... и что же они надумали?план коварен, но в нем есть рациональное зерно. Обвалить USD, и тут есть варианты:доллар рухнет(ну как рухнет, при покупке ВТС его цена (ВТС) уйдет в космос, а USD будет \"как бы стоять на месте\", он ведь пока что еще все еще \"мерило стоимости\"), затем ЮСА резко \"отказывается от доллара\", сразу начинается бурление на биржах, инвесторы панически выходят из доллара и бегут в драгметаллы и крипту. Временный крах и хаос обеспечен.Как только обвал достигнет дна - ЮСА (переобувается - кто бы сомневался?) обратно выкупает обесцененный USD и пока он стОит сущие копейки - закрывает свой каноничный гештальт - выплачивает госдолг, отдав вместо 34 трлн. существенно меньшие деньги. Профит. STONKS и прочие умные словечки, означающие \"очередное обогащение богатых путем ловких манипуляций, за счет слегка обделавшихся бедных\"Если же \"план не пойдет по плану\" - то и выкупать USD \"можно не надо\", знаете ли, новая администрация - новые правила(С) Тогда и 34 трлн. просто канут в лету. Ну было и было, чего бухтеть теперь?\"Нынешняя святая церковь не несет ответственности за былые просчеты и ляпы(С) Папа Римский. \"Догма\".Но вот вам наш новый \"Камала-доллар\" или \"Дональддоллор\", покупайте наши новые ракушки!"
    },
    {
      "id": 27155280,
      "author": "empenoso",
      "datetime": "2024-08-12T06:50:05.000Z",
      "text": "А как это к рублёвым облигациям относится?"
    },
    {
      "id": 27155264,
      "author": "Urg1n",
      "datetime": "2024-08-12T06:48:42.000Z",
      "text": "https://smart-lab.ru/q/ofz/"
    },
    {
      "id": 27155284,
      "author": "empenoso",
      "datetime": "2024-08-12T06:51:14.000Z",
      "text": "Не все ОФЗ ликвидны.Скрипт решает проблему только ликвидности"
    },
    {
      "id": 27155320,
      "author": "Antra",
      "datetime": "2024-08-12T06:56:44.000Z",
      "text": "Скрипту зачет :)А вот тут есть нюанс:Покупать облигации всегда выгоднее, когдаключевая ставка высокая (сейчас 18%).Скорее когда не просто высокая, но дальнейшего роста не ожидается, а в не слишком отдаленной перспективе ожидается снижение, Так-то и 12% считалось \"высокой\" совсем недавно. Только вот я помню, как доходность рынка Государственных Краткосрочных Облигаций, в конце лета 1996 года достигала 60–80% годовых. (80% я сейчас не жду, но дальнейшее повышения считаю практически неизбежным).В текущий момент краткосрочные вклады (3 мес) постоянно перекладываются на новые под более высокий процент (сейчас через Финуслуги Совкомбанк предлагает 17.8%, Росбанк 17.55%). По достаточно надежным (не защита АСВ, но более-менее) облигациям вряд ли больше. Но вклад вы свой скоро получите в полном объеме с процентами и примете новое решение, а с облигациями - либо продавать дешевле покупки, либо морозить потери до погашения (но когда формально потери отобьются, рубли будут уже не те).Если ближе к очередному выступлению на эту тему банки, имеющие существенно больше информации, чем я, предложат по вкладам еще больше, я решу, что стоит ждать очередного повышения ключевой ставки...Я ни разу не фанат вкладов :) Но в текущей ситуации (пока не нормализовалось, ну хотя бы стабилизировалось), вклады кажутся более практичным выбором. К сожалению."
    },
    {
      "id": 27155374,
      "author": "empenoso",
      "datetime": "2024-08-12T07:10:52.000Z",
      "text": "Зачем морозить до погашения если можно выбрать короткий срок изначально? И держать до погашения. Скрипт находит разные месяцы. Даже меньше месяца"
    },
    {
      "id": 27155410,
      "author": "Antra",
      "datetime": "2024-08-12T07:19:59.000Z",
      "text": "Так на коротких сроках выгоды не будет. Ближе к погашению ее цена начнет расти  даже при стабильной ключевой ставке. Облигацию с погашением через месяц вам за 700 руб не продадут даже если процент по ней 8% (если дефолт по ней не намечается).Рынок - консенсус исходя из прогноза. Если вы угадали с прогнозом (купили облигацию ожидая, что дальше ставка повышаться не будет) - отлично. Нет - в выигрыше тот, кто вам ее продал."
    },
    {
      "id": 27155486,
      "author": "empenoso",
      "datetime": "2024-08-12T07:32:14.000Z",
      "text": "Какая разница что будет с ценой облигации - в момент покупки доходность фиксируется до погашения"
    },
    {
      "id": 27155614,
      "author": "IvUs",
      "datetime": "2024-08-12T08:02:12.000Z",
      "text": "Так речь про цену в момент покупки."
    },
    {
      "id": 27155700,
      "author": "Antra",
      "datetime": "2024-08-12T08:15:34.000Z",
      "text": "Разница в том, что через какое-то время вас перестанет устраивать зафиксированная доходность.Условно говоря, вы купили облигацию с номиналом в 1000 руб и доходностью 12% - т.е получаете 120 руб. Но купите вы ее сейчас, разумеется не за 1000 руб, а за 700. Т.е. ваша доходность будет зафиксирована как 120/700 = 17.1%Если через пару месяцев ставка еще повысится, мой \"17%\" срочный вклад закроется, и я всю сумму [возможно вместе с процентами] переложу под 18%.А вы что сделаете? Продать облигацию сможете уже только только за 660.Будете держать до погашения под фиксированные 17%, когда я получаю 18%, потом 19% (и, не дай бог, 22%)?Конечно, через несколько лет (при погашении) вы получите дополнительный доход 300 руб. Но если ту же облигацию рассмотреть уже со сроком погашения через пару месяцев, за 700 вы ее не купите. Стоимость-процент уже сбалансированы с учетом длительности.На облигациях с близким сроком погашения вы дополнительно потеряете на комиссиях. Вряд ли это будет выгоднее вклада.А с длинным сроком погашения - либо потеряете при продаже, либо останетесь до конца срока с зафиксированным процентом, который ниже, чем могли бы получать по вкладам, к тому же гарантированно защищенным АСВ.Вот если мы ожидаем, что дальше ставка повышаться не будет (и по вкладам, соответственно, тоже), тогда да. По облигациям получаешь купонный доход как проценты по вкладам, да еще и продашь ее потом дороже, чем купил. Супер.Только причин для такого оптимизма я пока не вижу."
    },
    {
      "id": 27155440,
      "author": "sergbe",
      "datetime": "2024-08-12T07:24:16.000Z",
      "text": "На очень коротких отрезках типа нескольких месяцев прибыль от облигации может быть отрицательной -  двойная комиссия брокера (купи-продай) и НДФЛ с купона (если облига куплена с большим НКД)."
    },
    {
      "id": 27155488,
      "author": "empenoso",
      "datetime": "2024-08-12T07:32:59.000Z",
      "text": "Мы про российский рынок говорим?"
    },
    {
      "id": 27155526,
      "author": "sergbe",
      "datetime": "2024-08-12T07:44:41.000Z",
      "text": "да. российский"
    },
    {
      "id": 27156156,
      "author": "empenoso",
      "datetime": "2024-08-12T09:49:42.000Z",
      "text": "Если покупать и держать до погашения, то комиссия при покупке на 100 т.р. примерно 300 рублей. Вроде не так дорого?"
    },
    {
      "id": 27156388,
      "author": "sergbe",
      "datetime": "2024-08-12T10:32:13.000Z",
      "text": "Основной расход это НДФЛ. Комиссии это мелочь в сравнении. Все доходности облигаций надо считать как -13/15%.И на короткие сроки - покупать те выпуски, где НКД близок к нулю.Пример - чел на краткосрок покупает облигацию с \"полным НКД\" за день-другой до выплаты купона и платит с него НДФЛ. Получается, что прямой убыток."
    },
    {
      "id": 27155710,
      "author": "16-bit-cat",
      "datetime": "2024-08-12T08:17:26.000Z",
      "text": "Вкусный процент, как правило, имеют разные ФинШвырЛизинг категории /b/. Если уж дошло до них, лучше крипта, имхо.Корпораты - вообще рисковано, не все из них эту каляску вывезут, потому что просто не закладываласть в бизнес-модель такая ставка на такой длительный срок.Заманчиво сейчас выглядят лишь длинные ОФЗ с прицелом на начало снижения ставки. Те же 20% можно в итоге получить, скорее всего даже раньше чем за год. Их там 2-3 позиции наиболее подходящих, и аналитика особо не нужна."
    },
    {
      "id": 27155884,
      "author": "empenoso",
      "datetime": "2024-08-12T08:57:13.000Z",
      "text": "Вообще не специалист по крипте, но за облигации вас никто за пятую точку не возьмёт, а вот на счёт крипты в России - как там с ней? Нет проблем?"
    },
    {
      "id": 27156200,
      "author": "16-bit-cat",
      "datetime": "2024-08-12T09:58:42.000Z",
      "text": "А какие проблемы?Главное - соблюдать 2 правила:1. При операциях через P2P не переводить деньги на карты \"доверенных лиц\".2. Платить налоги =)Каких-то законодательных ограничений вроде как нет и не предвидится, судя по последним новостям. Государство справедливо беспокоится в основном за налоги и прозрачность."
    },
    {
      "id": 27362376,
      "author": "Ivan22",
      "datetime": "2024-10-01T08:31:27.000Z",
      "text": "Ну как там прицел на начало снижения ставки??"
    },
    {
      "id": 27363124,
      "author": "16-bit-cat",
      "datetime": "2024-10-01T11:20:19.000Z",
      "text": "Он стал ещё жирнее."
    },
    {
      "id": 27157312,
      "author": "empenoso",
      "datetime": "2024-08-12T14:01:16.000Z",
      "text": "Если верить статистике Хабра - мало кто дочитал, но многие осуждают эту статью.Ещё и в местную карму минусов натыкали."
    },
    {
      "id": 27157612,
      "author": "Zenitchik",
      "datetime": "2024-08-12T15:12:50.000Z",
      "text": "Кнопка голосования - внизу статьи. Т.е. те, кто проголосовал за (против) статью - как минимум просмотрели по диагонали.Большинству людей этого достаточно, чтобы составить примерное представление, о чём статья.А на карму, простите, не Вам жаловаться."
    },
    {
      "id": 27157708,
      "author": "empenoso",
      "datetime": "2024-08-12T15:40:36.000Z",
      "text": "В целом я согласен с Вами"
    },
    {
      "id": 27158048,
      "author": "tuxi",
      "datetime": "2024-08-12T17:14:02.000Z",
      "text": "Просто вы заскакиваете в тему, в которой многие уже съели не одну стаю собак, и преподносите это как серебряную пулю."
    },
    {
      "id": 27162626,
      "author": "empenoso",
      "datetime": "2024-08-14T05:47:44.000Z",
      "text": "Вы имеете ввиду, что я предлагаю простое решение сложной проблемы, которое уже было испробовано другими людьми и не принесло ожидаемого результата?"
    },
    {
      "id": 27171836,
      "author": "tuxi",
      "datetime": "2024-08-16T10:06:43.000Z",
      "text": "Я имею в виду, что посыл статьи по факту сводится \"к поиску дна\", вы исходите из предположения, что дно по облигациям уже найдено, ставка \"уже высокая\" и впереди \"нас ждет только ее снижение\". Я считаю, что это неверное предположение или как минимум ничем не обоснованное, кроме собственной веры что это так и есть. А вера - плохая помощник в инвестициях.То есть тут вопрос не к скрипту, тут вопрос к тому, что вероятность понижения ставки меньше совокупности вероятностей ее дальнейшего повышения + вероятности, что она еще год может оставаться такой же.При этом есть альтернативный инструмент, депозиты в банках, который в текущий момент является более правильной стратегией, если мы говорим о консервативных инвестициях. А облигации по сути и есть консервативные инвестиции.Если же говорить про спекулятивную модель вложений, а судя по упоминанию корпоративных облигаций эта модель Вами и выбрана, то в них нужен не скрипт, а инсайд, чтобы быстро зарезать позицию в случае \"шухера\"."
    },
    {
      "id": 27362386,
      "author": "Ivan22",
      "datetime": "2024-10-01T08:33:02.000Z",
      "text": "вероятность понижения ставки меньше совокупности вероятностей ее дальнейшегоКак в воду глядел"
    },
    {
      "id": 27159404,
      "author": "acordell",
      "datetime": "2024-08-13T06:50:15.000Z",
      "text": "Спасибо за скрипт! Мой опыт в облигациях хоть и небольшой, но негативный. Возможно, с помощью скрипта смогу это поправить."
    },
    {
      "id": 27159530,
      "author": "neobuh",
      "datetime": "2024-08-13T07:30:56.000Z",
      "text": "Хочется отметить по облигациям, сейчас Райффайзен сворачивается, они с 9-ого августа изменили тарифы по брокерскому обслуживанию, теперьлюбая покупкаоблагается комиссией в 1.9% навсехтарифах.Ссылкаhttps://www.raiffeisen.ru/retail/invest/broker/"
    },
    {
      "id": 27166380,
      "author": "empenoso",
      "datetime": "2024-08-15T04:42:02.000Z",
      "text": "Они уходят из России"
    },
    {
      "id": 27171008,
      "author": "3Demon",
      "datetime": "2024-08-16T06:56:16.000Z",
      "text": "Большое спасибо за скрипт, но нельзя ли расширить диапазон срока дюрации? 18 месяцев это прям печаль. И подбора по кредитному рейтингу тоже очень не хватает"
    },
    {
      "id": 27174488,
      "author": "empenoso",
      "datetime": "2024-08-17T02:30:06.000Z",
      "text": "Вы же можете сами изменить эти параметры"
    },
    {
      "id": 27174486,
      "author": "CrazyDiamond",
      "datetime": "2024-08-17T02:29:44.000Z",
      "text": "Я статью не прочитал, так как сходу не понял: а чем этот фильтровщик облигаций по параметрам лучше любого онлайн скринера или того же Квика, где можно задать фильтры?"
    },
    {
      "id": 27174490,
      "author": "empenoso",
      "datetime": "2024-08-17T02:30:33.000Z",
      "text": "В квике вы не можете задать проверку был ли каждый день оборот по бумаге больше того который вы сами задали как порогом"
    }
  ]
}