{
  "url": "https://habr.com/ru/articles/836450/comments/",
  "article_id": 836450,
  "title": "Как я создал систему поиска недооцененных американских акций, используя данные Яху Финанс: мой путь к разумному выбору",
  "comments": [
    {
      "id": 27180212,
      "author": "turboslon",
      "datetime": "2024-08-19T00:53:59.000Z",
      "text": "Show me your moneyКаков финансовый результат вашего портфеля за 2023 в сравнении с, например, S&P500 (X% vs 26%)? А в идеале CAGR за последние лет 5-10, это бы изрядно добавило веса подходу, реализованному Вами."
    },
    {
      "id": 27180304,
      "author": "empenoso",
      "datetime": "2024-08-19T02:30:01.000Z",
      "text": "Да, это бы прибавило веса подходу, но я ничего не продаю.Этот скрипт был сделан для такого чтобы помочь самому себе - просто инструмент."
    },
    {
      "id": 27183128,
      "author": "Dmitry_604",
      "datetime": "2024-08-19T14:13:01.000Z",
      "text": "Ну не продаете, хорошо, - сделайте оценку портфеля \"на сию\" и сравните с индексом тогда."
    },
    {
      "id": 27184812,
      "author": "Wesha",
      "datetime": "2024-08-20T00:05:50.000Z",
      "text": "я ничего не продаю.\"Нахал!\" (c)"
    },
    {
      "id": 27180218,
      "author": "excoder",
      "datetime": "2024-08-19T01:14:20.000Z",
      "text": "А есть ли данные по сбываемости прогнозов аналитиков в срезе последних лет?"
    },
    {
      "id": 27180310,
      "author": "empenoso",
      "datetime": "2024-08-19T02:32:37.000Z",
      "text": "Теоретически можно с какой-то периодичностью собирать эти прогнозы, а потом спустя полгода или год например смотреть результаты. Яху финансы технически обладает для этого всеми возможностями чтобы смотреть изменения на каком-то периоде.На гитхабе есть результаты прогнозов в 2020 году - можно просто вручную для примера посмотреть."
    },
    {
      "id": 27180276,
      "author": "Dmitri-D",
      "datetime": "2024-08-19T02:06:40.000Z",
      "text": "самое сложное в таки прогнозах - это коррекции и кризисы. Они наступают \"внезапно\", их не могут предсказать прогнозы. В целом - рынок всё равно вырастет и вырастет по сравнению с инфляцией в перспективе, скажем, 15-20 лет (2-3 кризисных периода).Воспрос лишь - вы сможете это сделать лучше аналитиков, которые не только читают, но и пишут эти прогнозы, или всё-таки лучше поверить S&P и запастись попкорном лет на 15?По поводу доступа к яхе - спасибо, было любопытно почитать. Не думал что это всё еще живо, хотя подозревал."
    },
    {
      "id": 27180314,
      "author": "empenoso",
      "datetime": "2024-08-19T02:36:24.000Z",
      "text": "Лучше запастись попкорном.Аналитики что-то должны писать, даже когда мыслей нет.Когда ты частный инвестор можно несколько лет вообще не подходить к теме, а потом продолжить."
    },
    {
      "id": 27180976,
      "author": "akod67",
      "datetime": "2024-08-19T06:34:42.000Z",
      "text": "Хороший аналитик умеет убедительно расписать, почему его предыдущий прогноз не сбылся =)"
    },
    {
      "id": 27181098,
      "author": "empenoso",
      "datetime": "2024-08-19T07:10:26.000Z",
      "text": "Сейчас даже для этого аналитик не нужен условный чат gpt всё распишет просто великолепно."
    },
    {
      "id": 27181022,
      "author": "Zaro4k0",
      "datetime": "2024-08-19T06:45:30.000Z",
      "text": "неплохо"
    },
    {
      "id": 27182124,
      "author": "excoder",
      "datetime": "2024-08-19T10:38:09.000Z",
      "text": "А как вы на Yahoo Finance получаете график с точками, соответствующими отчётам аналитиков, как у вас на первом скриншоте? Я что-то щёлкал-щёлкал по разным ссылкам на https://finance.yahoo.com/quote/AAPL/analysis/ , но так нужного вида и не получил. Отдельно график — пожалуйста, отдельно сводка по аналитикам — пожалуйста, а график с событями в виде точек с отчётами аналитиков — нет."
    },
    {
      "id": 27182172,
      "author": "empenoso",
      "datetime": "2024-08-19T10:46:35.000Z",
      "text": "График с точками как на первом скриншоте - снял с компьютера по адресу https://finance.yahoo.com/quote/AAPL"
    },
    {
      "id": 27182924,
      "author": "yrub",
      "datetime": "2024-08-19T13:18:43.000Z",
      "text": "Как я создал систему поиска недооцененных американских акцийлюди, интересующиеся финансами прочитав такое подумает о совсем других вещах, чем то, что сделали вы (какую-нибудь llm которая парсит отчеты и прогоняет их через модель экономики). Вы сделали веб интерфейс для поиска акций по yahoo аналитике (если я правильно понял, увы, времени читать все нет). Качество этой аналитики под большим вопросом. Но интересно будет посмотреть на виртуальный результат через год, будет ли какой-то профит относительно покупки индекса.Вообще поиск недооцененных акций дело не просто (компании любят приукрашивать прогнозы и прятать убытки) и в чем-то спорное (эти данные доступны всем, переиграть рынок трудновато будет, тем более с учетом китов). По этому умудренные люди больше склоняются к тех анализу и психологии рынка, ну и лучшую осведомленность (инсайд или человек на месте, который знает все про местный регион, но это уже не про рынок США)"
    },
    {
      "id": 27183060,
      "author": "empenoso",
      "datetime": "2024-08-19T13:48:43.000Z",
      "text": "Да, это просто скрипт который ищет по тем параметрам которые у них на сайте задать нельзя."
    },
    {
      "id": 27183134,
      "author": "empenoso",
      "datetime": "2024-08-19T14:14:33.000Z",
      "text": "Насчёт умудрённых опытом и теханализ - в одном предложении - я не согласен."
    },
    {
      "id": 27183174,
      "author": "Dmitry_604",
      "datetime": "2024-08-19T14:24:45.000Z",
      "text": "плюсую, тех анализ это сродни астрологии по-моему :)"
    },
    {
      "id": 27183662,
      "author": "yrub",
      "datetime": "2024-08-19T16:27:21.000Z",
      "text": "это озвучил Андрей Мовчан (ну и другой человек, который 20 лет назад многое повидал на мосбирже, добился там результатов и ушел: Сергей Чалый, русской аудитории он наверно не известен). В принципе это типичная история, когда люди со знанием математики и экономики приходят на биржу, считая что они сейчас все обсчитают, но меняют свое мнение на то, что психология двигает рынком в большей степени.Ситуаций когда фундаментальный анализ прав, но он не работает не мало. Акции во время ковида не обвалились, а всего-лишь упали до адекватного значения по фундаментальной оценка Баффета (индикатор Баффета), а потом акции технологических компаний улетели в небеса благодаря 4 триллионам помощи населению и приложению Робин Гуд, на одном только хайпе. А сотни никому неизвестных компаний, которые делали сверх прибыли на фоне дефицита полупроводников, будучи в звене их производства, прибавили быть может десятки процентов всего. Вы могли бы тут заработать, но выгоднее было понять, что хомяки разгоняют цену гугла и амазона, взять акции вместе с ними и продать их позже.Как я писал выше - вся фундаментальная информация доступна каждому, крупные фонды ее понимают скорее всего лучше вас, сами компании стремятся врать касательно своих перспектив и текущих проблем. Бесплатных прогнозов море, но реальная ценность их нулевая, по этому они и бесплатные. Добавьте сюда спекуляции, когда цена акции уже содержит в себе ожидание будущей доходности и окажется, что вашим точным фундаментальным прогнозам уже поздновато пользоваться. Скорее всего так и происходит с прогнозам на яху.В принципе опытные люди и фонды, типа того же Мовчана могут или могли стабильно зарабатывать на неэффективности рынка или арбитражем, он про это рассказывал, но этот способ никак не касается оценки акций. В остальном они для примера покупают облигации, инвестируют в развивающиеся рынки (для этого на местах должны быть свои люди, которые знают о своем регионе больше чем на Уолл Стрит), покупка облигаций с дисконтом благодаря тому что они крупный фонд. В общем вот все примеры успешных стратегий. Простому человеку они не доступны, лучше для начала просто купить индекс, а по ходу дела виртуально тестировать свою стратегию, например годик. Ну или если у вас есть реальный инсайт (как дивидендами газпрома ;) ). Хотя как рассказывал Чалый: в 98г к ним с таким инсайтом пришли, Ельцин хотел сделать премьером Немцова, дальше был вопрос что делать, очевидно что рынки как-то бы отреагировали на эту информацию. Решили ничего не предпринимать и завтра ничего не случилось: человек который принес этот инсайт клялся, что он видел приказ о назначении своими глазами, но по пути машину с ним развернули. Бывает и так.Много букв, но это я к тому, что на рынке людей очень много, и переиграть рынок одним фундаментальным анализом очень трудно. Кстати когда вы начнете так переигрывать рынок - вы станете быстро богатеть, вырастите в большую рыбу и будете вынуждены закрыть вход, потому что ваша стратегия перестанет работать на миллиардах."
    },
    {
      "id": 27183136,
      "author": "empenoso",
      "datetime": "2024-08-19T14:15:22.000Z",
      "text": "Думаете кто-то подобную модель бесплатно бы для публичного доступа стал выкладывать?"
    },
    {
      "id": 27184576,
      "author": "czz",
      "datetime": "2024-08-19T21:08:52.000Z",
      "text": "А теханализ разве не основан на данных, которые видны всем?"
    },
    {
      "id": 27188384,
      "author": "Vertoletto",
      "datetime": "2024-08-20T16:40:16.000Z",
      "text": "Эх, было бы еще здорово по факту каждого прогноза выполнять post mortem: \"сбылось\", \"не сбылось\", \"сбылось ровно наоборот\" и в итоге накапливать статистику по степени доверия их авторам, дабы отделить \"агнцев от козлищ\"."
    },
    {
      "id": 27189486,
      "author": "empenoso",
      "datetime": "2024-08-21T03:24:13.000Z",
      "text": "50/50 у каждого аналитика :)"
    },
    {
      "id": 27189836,
      "author": "Wesha",
      "datetime": "2024-08-21T05:41:16.000Z",
      "text": "Всё, перехожу наобезьян!"
    },
    {
      "id": 27189982,
      "author": "empenoso",
      "datetime": "2024-08-21T06:23:03.000Z",
      "text": "Всё уже украдено до нас: https://habr.com/ru/articles/492382/Уже есть такое, реализовано в виде кода"
    },
    {
      "id": 27189998,
      "author": "empenoso",
      "datetime": "2024-08-21T06:26:15.000Z",
      "text": "https://codepen.io/empenoso/pen/poJmJZg"
    }
  ]
}