{
  "url": "https://habr.com/ru/articles/837616/comments/",
  "article_id": 837616,
  "title": "Как быстро получить примерную стоимость оборудования на основе спецификации проекта",
  "comments": [
    {
      "id": 27268616,
      "author": "drakut",
      "datetime": "2024-09-09T16:29:43.000Z",
      "text": "В рамках похожей задачи (привязка релевантных позиций из прайса участника тендера к позициям спецификации на основании анализа строк с описаниями обоих справочников) мной был разработан инструмент, вдруг вам пригодится: https://openexchange.intersystems.com/package/ESKLP"
    },
    {
      "id": 27592922,
      "author": "XYZMoscow",
      "datetime": "2024-11-25T03:12:23.000Z",
      "text": "В Goofle console чёрт ногу сломит.Напишите пожалуйста, как именно называются нужные api ключи на английском, возможно со ссылками на получение нужных секретов. Я застрял на шаге: Перейдите в раздел «Учетные данные» в Cloud Console. Если получать  Custom Search API key, то предлагает создать сервисный аккаунт/ Это то, что нужно?"
    },
    {
      "id": 27592992,
      "author": "empenoso",
      "datetime": "2024-11-25T04:09:00.000Z",
      "text": "Пошаговое руководство по получению ключа API в Google Cloud Console:Перейдите вGoogle Cloud Console.Если у вас нет учетной записи Google, вам необходимо ее создать. Войдите, используя свои учетные данные.Создать новый проект:В Cloud Console щелкните раскрывающееся меню рядом с названием вашего проекта в верхнем левом углу.Нажмите «Новый проект», чтобы создать новый проект. Дайте ему имя и запишите идентификатор проекта (он понадобится вам позже).Включите API пользовательского поиска:Выбрав проект, перейдите вБиблиотеку API и сервисов.Найдите «API пользовательского поиска» (Custom Search API).Нажмите API пользовательского поиска, а затем нажмите «Включить», чтобы добавить его в свой проект.Создание учетных данных (ключ API):Перейдите в раздел «Учетные данные» в Cloud Console.Нажмите «Создать учетные данные» и выберите «Ключ API».Будет создан новый ключ API. Скопируйте этот ключ и сохраните его в надежном месте, так как он будет использоваться в вашем приложении для аутентификации запросов к API пользовательского поиска.Получение идентификатора системы пользовательского поиска (CSE)Доступ к системе пользовательского поиска Google:Посетите страницуСистема пользовательского поиска Google.Войдите в свою учетную запись Google.Создайте новую систему пользовательского поиска:Нажмите «Добавить», чтобы создать новую систему пользовательского поиска.Укажите имя своей поисковой системы и укажите сайты, которые вы хотите включить в область поиска (вы можете добавить определенные URL-адреса или установить область для всего Интернета).После создания Google присвоит вашей системе пользовательского поиска уникальный идентификатор поисковой системы (также известный как «cx» или идентификатор CSE).Получите свой идентификатор CSE:На панели управления системой пользовательского поиска щелкните название своей поисковой системы.Перейдите в раздел «Настройка», где вы найдете свой идентификатор системы пользовательского поиска (cx). Этот идентификатор имеет решающее значение при вызовах API, поскольку он сообщает Google, какую систему пользовательского поиска использовать для ваших запросов."
    }
  ]
}