{
  "url": "https://habr.com/ru/articles/843298/comments/",
  "article_id": 843298,
  "title": "Как я при помощи двух «костылей» смог автоматически сгенерировать опись документов для 700 страниц",
  "comments": [
    {
      "id": 27297888,
      "author": "VitoArzi",
      "datetime": "2024-09-16T06:46:26.000Z",
      "text": "Первый костыль не вызывает вопросов, типичная задач для VBA - собрать данные из файлов или листов. А вот второй костыль автор реализовал только по причине хорошей известности ему GAS, однако это не оптимальное решение по нескольким причинам: убогости форматирования гугла по сравнению с Wordом, а также облачности решения (сейчас многие компании как огня боятся загружать что-то в гугловое облако), и, в третьих, есть готовый инструмент, с которым справится даже секретарша с буклями - \"Слияние документов\" в Ворде, находится на вкладке \"Рассылки\"."
    },
    {
      "id": 27297926,
      "author": "empenoso",
      "datetime": "2024-09-16T06:54:38.000Z",
      "text": "Про слияние не знал, спасибо. GAS хорошо знаю, на счёт убогости форматирования гугла не согласен - слишком простой пример требовалось сделать.Вот из справки:Функция \"Слияние документов\" в Microsoft Wordпозволяет объединить несколько шаблонов документов с данными из списка или базы данных. Это удобно при создании однотипных писем, счетов, приглашений или других материалов, где требуется повторение одного и того же текста с разными данными.Чтобы использовать функцию \"Слияния документов\":Откройте документ-шаблон, который будет использоваться для слияния.Перейдите на вкладку \"Рассылки\" и выберите команду \"Начать слияние\".Выберите нужный тип слияния (например, \"Письма\") и следуйте дальнейшим инструкциям мастера слияний.Загрузите список данных, из которого будут взяты имена, адреса и другие поля информации.Просмотрите предварительный просмотр результатов слияния перед печатью или сохранением итоговых документов.Функция слияния также позволяет выполнять рассылку электронной почты прямо из программы Word, используя данные из вашего списка контактов."
    },
    {
      "id": 27298006,
      "author": "VitoArzi",
      "datetime": "2024-09-16T07:10:04.000Z",
      "text": "Сорри, это я некорректно выразился,  я имел в виду что в гугл-доках и соответственно GASe меньше возможностей для форматирования, чем в ворде."
    },
    {
      "id": 27300530,
      "author": "degistration",
      "datetime": "2024-09-16T13:54:03.000Z",
      "text": "после этого чтоли коммента добавили кавычки к костыли"
    },
    {
      "id": 27300610,
      "author": "empenoso",
      "datetime": "2024-09-16T14:06:59.000Z",
      "text": "Нет, это сразу были в кавычках"
    },
    {
      "id": 27312122,
      "author": "kest70",
      "datetime": "2024-09-19T00:14:52.000Z",
      "text": "Если бы не было набора Эксель файлов в компьютере, то вряд ли что-то могло получиться"
    },
    {
      "id": 27312168,
      "author": "empenoso",
      "datetime": "2024-09-19T01:38:33.000Z",
      "text": "Так и есть"
    }
  ]
}