{
  "url": "https://habr.com/ru/articles/846938/comments/",
  "article_id": 846938,
  "title": "Как я решил вернуться в алготрейдинг после 10 летнего перерыва",
  "comments": [
    {
      "id": 27385774,
      "author": "Slav2",
      "datetime": "2024-10-07T02:57:10.000Z",
      "text": "У меня всегда в голове крутится один вопрос. Почему алготрейдеры делают антропоморфных торговых роботов? Ведь свечи это визуальное представление изменения цены. Они нужны только для удобства чтения графиков цен человеком. А в реальности никаких свеч нету, есть изменение текущей цены от предыдущего минимума или максимума. Считается элементарно, никаких эффектов запаздывания не вносим. Не требуется даже выбирать какое-то начало на временной шкале, все для любого момента времени считаем из настоящего в прошлое. А так можно, спросите вы? А почему нет, это робот ему не важно даже как считать слева направо или справа налево. Если закономерность есть, то и результат будет всегда один, вне зависимости от ориентации графика. А попробуйте график японских свеч развернуть и что либо посчитать из настоящего в прошлое? По моему сразу все нарушится и не останется никакой ценности в этих предсказаниях :)"
    },
    {
      "id": 27385784,
      "author": "lrrr11",
      "datetime": "2024-10-07T03:11:30.000Z",
      "text": "во-первых, чтобы зарабатывать на рынке, нужно уметь анализировать поведение торгующих там трейдеров. А трейдеры смотрят именно на свечи.во-вторых, если вы знаете как правильно - подключайтесь к tinkoff invest api (это бесплатно для зарегистрированных пользователей) и покажите прибыльность своей стратегии хотя бы в тестовой песочнице :)"
    },
    {
      "id": 27385982,
      "author": "Zoolander",
      "datetime": "2024-10-07T04:14:39.000Z",
      "text": "Свечи есть функция от изменений цены."
    },
    {
      "id": 27389524,
      "author": "iShrimp",
      "datetime": "2024-10-07T19:56:08.000Z",
      "text": "Скорее, это одна из форм её представления, которая скрывает от пользователя часть информации.Можно в одну и ту же площадь экрана вывести больше полезной информации, если, к примеру, вместо одной свечи Н1 шириной 12 пикселей использовать 12 свечей М5 шириной 1 пиксель. Да, к этому нужно привыкнуть, но со временем пользователь научится видеть те детали, которых с обычными свечами не видел."
    },
    {
      "id": 27387530,
      "author": "Slav2",
      "datetime": "2024-10-07T11:07:51.000Z",
      "text": "во-первых, чтобы зарабатывать на рынке, нужно уметь анализировать поведение торгующих там трейдеров. А трейдеры смотрят именно на свечи.Бот может использовать время закрытия свеч, например, но для чего ему самому строить свечи?во-вторых, если вы знаете как правильно - подключайтесь к tinkoff invest api (это бесплатно для зарегистрированных пользователей) и покажите прибыльность своей стратегии хотя бы в тестовой песочнице :)Смысла нет собирать крохи на бирже, когда можно грести лопатой на рынках в онлайн играх. Продажа внутриигровых денег за реал это конечно нарушение всяких EULA, но как говорится на что бизнес не пойдет ради прибыли )"
    },
    {
      "id": 27386450,
      "author": "2128507",
      "datetime": "2024-10-07T06:51:33.000Z",
      "text": "потому что:нет никакой рационально исчисляемой причинной зависимости цены в текущую секунду от цены в предыдущую секунду, а так же от величины таймстамп. Графики цены построены так, как будто это функция от времени, это неверно.предел сложности системы, которую человек может создать руками - простейшая система с обратной связью, типа термостат.таким образом, все многообразие решений задачи с непонятным числом переменных и входных условий, сводится к триггерам по пороговым значениям цены, т.е. реагированию на уже изменившиеся условия, которые рынок отработал уже до того, как вам прислали этот график на отрисовку. Ничего другого в принципе получиться не может, только боевой человекоподобный робот (с)."
    },
    {
      "id": 27387406,
      "author": "Slav2",
      "datetime": "2024-10-07T10:41:03.000Z",
      "text": "Я не предлагал строить график цены от времени. Есть графики типа Ренко, посмотрите как они строятся."
    },
    {
      "id": 27388606,
      "author": "Dynasaur",
      "datetime": "2024-10-07T15:04:28.000Z",
      "text": "предел сложности системы, которую человек может создать руками - простейшая система с обратной связью, типа термостатконечно же люди научились создавать гораздо более сложные системы, чем термостат :-)"
    },
    {
      "id": 27389598,
      "author": "Format-X22",
      "datetime": "2024-10-07T20:32:11.000Z",
      "text": "есть изменение текущей цены от предыдущего минимума или максимумаА как вы без дескретизации поймете где минимум или максимум? Это как посчитать периметр Байкала - в разных источниках разные цифры и все они - правда. Звучит парадоксально до тех пор пока не узнаешь о единицах измерения и метрологии и том что периметр реальных физических объектов стремится к бесконечности. Также и тут - без нарезки по границам цен или времени у вас минимум и максимум будет каждые пару миллисекунд."
    },
    {
      "id": 27391184,
      "author": "2128507",
      "datetime": "2024-10-08T09:08:24.000Z",
      "text": "отвечу всем в этой ветке, мой лимит 1 коммент в сутки.@Slav2да хоть в фазовом пространстве, хоть через очко стройте любой график цены, зависимости нет.@Dynasaurприведи пример физической системы, созданной человеком/людьми, сложнее чем третий уровень вот на этом рисунке:@Format-X22ты не прочитал или не вник во второй пункт, осознание которого делает бессмысленным любые вычисления."
    },
    {
      "id": 27398116,
      "author": "Slav2",
      "datetime": "2024-10-09T19:08:56.000Z",
      "text": "А как вы тогда объясняете что цена на актив растет медленно, а вот когда  падает, может валится очень быстро? Если бы не было никаких закономерностей, все было бы идеально симметрично. Боту не требуется делать долгосрочных прогнозов, успеть отреагировать на падение это 20 секунд."
    },
    {
      "id": 27398960,
      "author": "2128507",
      "datetime": "2024-10-10T04:05:44.000Z",
      "text": "никак не объясню, и ты не объяснишь, и никто не объяснит. Это просто факт, что падает (в  большинстве случаев) быстрее, чем поднимается. Можно назвать это закономерностью, но так или иначе, без инсайда и/или прямого волокна до биржы это игра с отрицательным математическим ожиданием, в том числе и из-за этой закономерности.Насчет успеть отреагировать за 20 секунд - проблема в том, что в течение этих 20 секунд успеют начаться другие 20 секунд, таких событий будет примерно столько, сколько \"частота дискретизации срезов цены\" позволит, и содержимое там может быть призывающее совсем к иному поведению."
    },
    {
      "id": 27406230,
      "author": "Slav2",
      "datetime": "2024-10-11T14:58:01.000Z",
      "text": "Я для себя это объясняю наличием манипуляторов, китов которые в нужный момент толкают цену вниз. Причем используют для этой цели также роботов. Я могу привести один пример. Биржа бинанс, по объемам торгов она опережала остальные биржи. Но у биржи есть ограничение на количество запросов которые можно было получать по API. Так можно было загрузить 1000 заказов в обе стороны или больше. Но у каждого такого запроса есть стоимость. Если получать заказов больше, то таких запросов в единицу времени можно было сделать меньше. Перед тем как цена валится, манипулятор анализирует книгу заказов на 1000 заказов. Выявляются заказы которые не двигаются. То что постоянно появляется и исчезает - это боты. Они цену не держат, не создают сопротивления цены т.к. это игра против рынка, а ботам играть против рынка нельзя. Манипулятор рассчитывает сколько он потратит средств чтобы спустить цену на определенную величину. И начинает движение, если это оказывается выгодно. Манипулятору надо спустить цену на максимальную величину, но не сильно быстро, чтобы боты успели отреагировать и не мешать движению. Люди отреагировать не успевают, они смотрят на свои часовые графики и живут в своей вселенной, а потом удивляются почему ничего не работает. Но у манипулятора есть ограничение, он не ходит дальше тех 1000 заказов, которые он видел на момент начала обвала. Манипулятор тщательно продумывает свою стратегию где будет начало движения и где конец. На самом деле цена может и дальше уйти на короткий промежуток времени из за эффекта домино, но она всегда возвращается в зону видимости."
    },
    {
      "id": 27406304,
      "author": "Slav2",
      "datetime": "2024-10-11T15:24:17.000Z",
      "text": "таких событий будет примерно столько, сколько \"частота дискретизации срезов цены\" позволит, и содержимое там может быть призывающее совсем к иному поведению.Ну и ничего страшного, если нейросеть получится с 10к параметров. Пусть учится, подбирает веса для каждого среза. А вот когда начинают запихивать в нейросеть данные свечей, а потом удивляются почему это ниче не работает это вообще странно."
    },
    {
      "id": 27398174,
      "author": "Slav2",
      "datetime": "2024-10-09T19:24:26.000Z",
      "text": "Какое то минимальное значение изменения цены выбираем, которое будет больше чем белый шум. Потом увеличиваем шаг для определения краткосрочных-среднесрочных-долгосрочных трендов, определяем веса этих сигналов. Перераспределяем портфель таким образом, чтобы не сидеть в дешевеющих активах."
    },
    {
      "id": 27392376,
      "author": "Dynasaur",
      "datetime": "2024-10-08T14:06:32.000Z",
      "text": "ну так и чего вы не сделаете как описали?"
    },
    {
      "id": 27398190,
      "author": "Slav2",
      "datetime": "2024-10-09T19:28:01.000Z",
      "text": "Занимаюсь ботами для игр. Есть и торговый бот (также для игры) с прибылью 1.5-2% в день. Нельзя заниматься сразу всем, рук не хватит, приходится выбирать что прибыльнее."
    },
    {
      "id": 27404076,
      "author": "Dynasaur",
      "datetime": "2024-10-11T06:46:35.000Z",
      "text": "1,5% в день это 5000% годовых, куда ещё прибыльнее, что вы там выбираете? :-))) Через 3 года такой торговли вы скупите примерно весь фондовый рынок :-)))"
    },
    {
      "id": 27405636,
      "author": "empenoso",
      "datetime": "2024-10-11T12:17:52.000Z",
      "text": "Ну это вряд ли. На тестах на истории наверное все эти показатели"
    },
    {
      "id": 27405780,
      "author": "Slav2",
      "datetime": "2024-10-11T12:52:35.000Z",
      "text": "Если интересно, это торговый бот в игре eve online. Если переводить все в рубли, то пока у бота 15к депозит, то 1.5-2% он делает. Чем больше депозит тем меньше прибыль, но в абсолютных величинах она растет до 60к после чего лучше депозит поделить на 2-3 аккаунта или часть денег отмыть и продать. В игре есть возможность оплачивать подписку игровыми деньгами (ISK), т.о. вложений реала для этого метода заработка не требуется. Но это снижает минимальный депозит, который может быть использован для торговли. Иначе вся прибыль уйдет на оплату подписки. В итоге если не вкладывать реал или не передавать иски с другого торгаша, то торговый аккаунт готовится за год. Нужно накопить первоначальный депозит неторговыми методами, причем так чтобы в процессе не побанили за слишком активную игру )"
    },
    {
      "id": 27385776,
      "author": "codecity",
      "datetime": "2024-10-07T03:01:39.000Z",
      "text": "Можно вопрос не по теме. Остались ли в России брокеры, которые дают выход на международный рынок?"
    },
    {
      "id": 27385834,
      "author": "empenoso",
      "datetime": "2024-10-07T03:46:10.000Z",
      "text": "Как минимум БКС через Дубай"
    },
    {
      "id": 27385818,
      "author": "aaa_bbb",
      "datetime": "2024-10-07T03:32:22.000Z",
      "text": "инструменты и свечи можно и с самой API MOEX считывать. Конечно, торговать так нельзя, но для тестов вполне сгодится."
    },
    {
      "id": 27385836,
      "author": "empenoso",
      "datetime": "2024-10-07T03:46:22.000Z",
      "text": "Можно"
    },
    {
      "id": 27387584,
      "author": "Dynasaur",
      "datetime": "2024-10-07T11:20:15.000Z",
      "text": "Вы сконцентрированы (по крайней мере в статье) на технике - как подключиться, как считать свечи, как дёрнуть АПИ, а единственный главный вопрос трейдинга это \"покупать или продавать?\". Всё остальное вторично. Нет смысла мучить АПИ, если нет понимания что дальше с этим делать. Я тоже некоторое время потратил на алготрейдинг, из питона скачивал рыночные данные. На главный вопрос должна была отвечать нейросеть, которую я пытался научить понимать ситуацию и достичь матожидания более 50%. В общем, это оказалось очень трудо- и ресурсоёмким занятием. Я застрял на чистке и предобработке данных. В одиночку обыграть рынок очень сложно. АПИ торговой площадки даже не пригодилось - нет смысла его дёргать пока не научился вырабатывать правильные сигналы."
    },
    {
      "id": 27387826,
      "author": "empenoso",
      "datetime": "2024-10-07T12:07:02.000Z",
      "text": "Вы сосредоточены только на входе. Но у каждой позиции ещё есть выход. Это тоже параметр"
    },
    {
      "id": 27388584,
      "author": "Dynasaur",
      "datetime": "2024-10-07T14:57:45.000Z",
      "text": "Не знаю почему вы так решили. Я был сосредоточен на прибыли. Оптимизировать собирался исключительно по этому параметру. Но не дошёл. Было интересно, поисследовал корреляции активов в поисках полезных зависимостей. Но понял, что для приемлемого результата сил, времени и вычислительных ресурсов нужно гораздо больше, чем у меня есть."
    },
    {
      "id": 27387832,
      "author": "empenoso",
      "datetime": "2024-10-07T12:07:49.000Z",
      "text": "И мне кажется совершенно ни к чему кого-то \"обыгрывать\". В идеале копеечка капает и норм"
    },
    {
      "id": 27387980,
      "author": "Dynasaur",
      "datetime": "2024-10-07T12:34:27.000Z",
      "text": "\"обыграть\" нужно как минимум того у кого вы покупаете или кому продаёте :-) а то копеечка будет капать не в ту сторону :-) Если вам капает, по поздравляю :-) Но из статьи этого не видно :-)"
    },
    {
      "id": 27388272,
      "author": "Femistoklov",
      "datetime": "2024-10-07T13:44:10.000Z",
      "text": "Нет, главный вопрос - это \"как проверить, моё покупать или продавать окажется правильным в будущем или нет\"."
    },
    {
      "id": 27388978,
      "author": "Dynasaur",
      "datetime": "2024-10-07T16:59:41.000Z",
      "text": "Вы можете формулировать как угодно, но у трейдера только две педали - \"купить\" и \"продать\" и в какой-то момент нужно нажать то или это :-)"
    },
    {
      "id": 27522374,
      "author": "catharsis",
      "datetime": "2024-11-06T19:06:17.000Z",
      "text": "я думаю, мысль в том, что покупать нужно с каким-то планом, когда вы собираетесь продавать (но я не настоящий сварщик и даже не пробовал)."
    },
    {
      "id": 27390170,
      "author": "empenoso",
      "datetime": "2024-10-08T04:38:45.000Z",
      "text": "Просто оставлю это здесь:"
    },
    {
      "id": 28386940,
      "author": "johovich",
      "datetime": "2025-06-02T21:27:58.000Z",
      "text": "Хочу поблагодарить за отличную статью. Сегодня ковыряясь в своем брокерском счете я понял, что очень не люблю это делать. Если на трендовом рынке можно сделать 5% в мес. это уже 60% в год, а это уже очень даже ничего.Если не получится сделать машину для зарабатывания для меня денег, то хотя бы сделать автоматический трейлинг стоп."
    }
  ]
}