{
  "url": "https://habr.com/ru/articles/855302/comments/",
  "article_id": 855302,
  "title": "Работа в «песочнице» с торговым роботом на Московской бирже",
  "comments": [
    {
      "id": 27513072,
      "author": "supercat1337",
      "datetime": "2024-11-05T04:15:23.000Z",
      "text": "Спасибо за публикацию.Под капотом сокеты? Странно, что так медленно.Для увеличения скорости обмена может быть снять сервера в Москве? Рассматривали такой вариант?"
    },
    {
      "id": 27513088,
      "author": "empenoso",
      "datetime": "2024-11-05T04:25:52.000Z",
      "text": "Не хочу арендовать сервер, а сам территориально нахожусь в Перми.Рассматриваю робота не как основной источник дохода, а как возможность дополнительного канала дохода (по возможности :)))  ) и объект исследования.Поэтому дополнительные финансовые затраты не хочу на себя брать."
    },
    {
      "id": 27513930,
      "author": "hardtop",
      "datetime": "2024-11-05T07:47:05.000Z",
      "text": "Рассматриваю робота не как основной источник дохода, а как возможность дополнительного канала дохода (по возможностиРынок не терпит факультативности. Потратил более 2-х лет своей жизни на всех этих роботов (со свечным анализом, уровнями поддержки и сопротивления, фибоначи, мани-менеджментом...)  стратегии и пр. Это всё работает очень нестабильно, сколько на исторических данных не учи. Как только начнёте торговать на реальных деньгах - быстрее поседеете и сольёте несколько депозитов, чем что-то заработаете. И даже если даже получится урвать - прибыть испарится быстрее.Собственно,  все эти \"успешные\" трейдеры больше заработали на книгах, курсах и продаже сигналов. А самый успешный трейдер - это муж Ненси Пелосси, который вовремя прикупил Nvidia."
    },
    {
      "id": 27514414,
      "author": "empenoso",
      "datetime": "2024-11-05T09:09:50.000Z",
      "text": "Я раньшеэтим занимался. Моё мнение что что-то простое может работать. А Фибоначчи никак не формализовать."
    },
    {
      "id": 27514476,
      "author": "supercat1337",
      "datetime": "2024-11-05T09:20:20.000Z",
      "text": "Рано закрывали ордера? Или приходилось закрывать с убытком в конце недели?Когда робот промахивается с краткосрочным брендом, то нужно ориентироваться на среднесрочный рост, чтобы выйти в плюс. Бывает и это занимает продолжительное время. Ну если и тут не угадали, то или держать, или закрывать с убытком )))"
    },
    {
      "id": 27543464,
      "author": "voron333x",
      "datetime": "2024-11-12T06:14:23.000Z",
      "text": "Торгую на роботах 4 года, полет нормальный. Форекс, валюты"
    },
    {
      "id": 27513184,
      "author": "mxr",
      "datetime": "2024-11-05T05:19:14.000Z",
      "text": "Для увеличения скорости обмена может быть снять сервера в Москве? Рассматривали такой вариант?1.16 секунды, это очень много и дело тут явно не в пинге.Возможно, проблема в самом стороннем API. В том как оно взаимодействует с торговым движком биржи. А может это и вовсе limit order, который заполняется постепенно, в отличии от market-а. Плохо разбираюсь в теме, не читал исходники автора.P.S,Указанная сложность статьи не соответствует реальности, тут должна быть \"легкая\"."
    },
    {
      "id": 27513420,
      "author": "empenoso",
      "datetime": "2024-11-05T05:44:53.000Z",
      "text": "Здесь маркет ордер"
    },
    {
      "id": 27513424,
      "author": "empenoso",
      "datetime": "2024-11-05T05:45:31.000Z",
      "text": "Сложность исправил"
    },
    {
      "id": 27515734,
      "author": "qeeveex",
      "datetime": "2024-11-05T12:52:24.000Z",
      "text": "В России на столько не предсказуемый рынок, и доверять торговлю боту весьма опрометчивый поступок."
    },
    {
      "id": 27516546,
      "author": "supercat1337",
      "datetime": "2024-11-05T15:41:44.000Z",
      "text": "А где предсказуемый? Поделитесь секретом. Сразу торговлю с плечом 1 к 1000 будем вести."
    }
  ]
}