{
  "url": "https://habr.com/ru/articles/855864/comments/",
  "article_id": 855864,
  "title": "Как я переделал освещение в подъезде на два контура и сэкономил 200 т.р. не делая ремонт, а используя умный дом",
  "comments": [
    {
      "id": 27523380,
      "author": "empenoso",
      "datetime": "2024-11-07T04:34:00.000Z",
      "text": "Заголовок я кстати поменял.Было: Как я захотел переделать освещение в подъезде на два контура и сэкономил 200 т.р. за счёт использования умного домаСтало: Как я переделал освещение в подъезде на два контура и сэкономил 200 т.р. не делая ремонт, а используя умный дом"
    },
    {
      "id": 27523130,
      "author": "Hasumutas",
      "datetime": "2024-11-07T00:34:39.000Z",
      "text": "не хотелось придираться, но заголовок не соответствует содержимому.. 200К на то чтобы плитку переложить, а не оригинальное решение с освещением. Развели меня на прочтение"
    },
    {
      "id": 27523180,
      "author": "empenoso",
      "datetime": "2024-11-07T01:46:38.000Z",
      "text": "Понимаю ваше разочарование. Действительно, заголовок мог создать впечатление, что основное внимание будет уделено именно затратам на освещение. Однако статья рассматривает ситуацию комплексно: изменение освещения в контексте подъезда стало возможным благодаря использованию технологий умного дома, что позволило избежать значительных затрат и работ по перекладке плитки.В этом и заключается оригинальная идея – минимизация расходов за счет современных решений автоматизации."
    },
    {
      "id": 27523294,
      "author": "PrinceKorwin",
      "datetime": "2024-11-07T03:42:08.000Z",
      "text": "Это ответ от ChatGPT?"
    },
    {
      "id": 27523686,
      "author": "empenoso",
      "datetime": "2024-11-07T06:07:58.000Z",
      "text": "Это ответ вежливого человека"
    },
    {
      "id": 27526088,
      "author": "yri066",
      "datetime": "2024-11-07T13:16:55.000Z",
      "text": "Лучше в заголовке указали бы реальную экономию, а не сэкономленные гипотетические траты на ремонт"
    },
    {
      "id": 27526150,
      "author": "empenoso",
      "datetime": "2024-11-07T13:27:55.000Z",
      "text": "Лампы ведь не ради экономии, а чтобы было два контура освещенности."
    },
    {
      "id": 27523380,
      "author": "empenoso",
      "datetime": "2024-11-07T04:34:00.000Z",
      "text": "Заголовок я кстати поменял.Было: Как я захотел переделать освещение в подъезде на два контура и сэкономил 200 т.р. за счёт использования умного домаСтало: Как я переделал освещение в подъезде на два контура и сэкономил 200 т.р. не делая ремонт, а используя умный дом"
    },
    {
      "id": 27523966,
      "author": "Klaor",
      "datetime": "2024-11-07T07:07:00.000Z",
      "text": "Можно было и 1000+ т.р. сэкономить, если гипотетически рассмотреть итальянский мрамор на замену плитки, ну и дальше, предела по сэкономленным деньгам нет, если включить фантазию. Только вот к теме оно как то мало относится."
    },
    {
      "id": 27523976,
      "author": "empenoso",
      "datetime": "2024-11-07T07:12:06.000Z",
      "text": "Если хочешь что-то изменить, то смотришь как это можно сделать.Использование запрограммированной на восход и закат лампы было не самым очевидным вариантом."
    },
    {
      "id": 27531324,
      "author": "edge790",
      "datetime": "2024-11-08T15:23:26.000Z",
      "text": "Буквально читая статью вспоминал этот анекдот:- Знаешь, папа, я сегодня рубль сэкономил!- Молодец, сынок! А как?- Утром я не сел в автобус, а бежал за ним.- Дурак! Надо было бежать за такси, сэкономил бы больше."
    },
    {
      "id": 27525242,
      "author": "KreoShow",
      "datetime": "2024-11-07T10:56:51.000Z",
      "text": "а мне статья понравилась :D на название мне как-то всё равно"
    },
    {
      "id": 27525614,
      "author": "empenoso",
      "datetime": "2024-11-07T12:02:10.000Z",
      "text": "Спасибо!Понравилось правда не всем:"
    },
    {
      "id": 27523868,
      "author": "achekalin",
      "datetime": "2024-11-07T06:47:59.000Z",
      "text": "Тут вообще много слов про умный дом, но мне всегда вспоминается электрик из УК, который мне сказал, на предложение подобное запилить - а Вы, мол, не виднли, как такую красивую электронику тырят из подъездов, даже не умея потом применить?Что wifi для управления лампочками неплозой вариант (хотя и из пушки по воробьям), что система управления ,- это все отлично, только, как кажется, можно сделать чуть менее нарядно, но гораздо более дубово и вандалоустойчиво.Я сам зашел в пост, и долго его листал, пытаясь понять, как с умным домом можно 200к сэкономить, а не 300к своих вложить. Удивился итогу, конечно, чуда не нашел.Ну и да, делать что-то на общем имуществе хорошо, но... Оно общее, а если другой сосед хочет другое решение?"
    },
    {
      "id": 27523882,
      "author": "empenoso",
      "datetime": "2024-11-07T06:51:06.000Z",
      "text": "Отвечая на последний вопрос скажу, что предварительно согласовал."
    },
    {
      "id": 27523886,
      "author": "empenoso",
      "datetime": "2024-11-07T06:52:21.000Z",
      "text": "Насчёт кражи - это выглядит как обычная лампочка в обычном светильнике. Зачем она нужна?К тому же там камера."
    },
    {
      "id": 27531734,
      "author": "UnknownQq",
      "datetime": "2024-11-08T17:08:53.000Z",
      "text": "Вы в 90-х жили? Если нет, то некоторые истины станут понятней со временем.И, таки, как быть с техобслугой? Сгорела лампа - топай за новой. настраивай, ставь. По мне, так для эксперимента - может быть, на постоянку - слишком затратно по всем параметрам."
    },
    {
      "id": 27524360,
      "author": "hw_store",
      "datetime": "2024-11-07T08:23:30.000Z",
      "text": "...притом, учитывая количество затраченных человеко-часов,  если бы это покупалось как коммерческое решение от стороннего поставщика, то стоимость его вполне могла быть сравнима с 100-200к"
    },
    {
      "id": 27524566,
      "author": "AWE64",
      "datetime": "2024-11-07T08:57:40.000Z",
      "text": "Вспомнилось, как в начале двухтысячных, год, примерно, 2001, меняли в подъезде разбитое стекло. Специально резали на части и заклеивали скотчем, чтобы не украли."
    },
    {
      "id": 27530764,
      "author": "Tifliskiy",
      "datetime": "2024-11-08T12:54:09.000Z",
      "text": "Подъезд не из простых, ремонт, картина, зеркало ;) Внизу скорей всего консьержка. Так что думаю, соседей которые позарятся на лампочку не будит :)"
    },
    {
      "id": 27523264,
      "author": "nikolz",
      "datetime": "2024-11-07T03:20:05.000Z",
      "text": "или же использовать другую прошивкуESPHomeдля лёгкой интеграциис Home Assistant."
    },
    {
      "id": 27523296,
      "author": "empenoso",
      "datetime": "2024-11-07T03:42:57.000Z",
      "text": "ESPhome и google home - это разные вещи.Сейчас не за компьютером, чуть позже с компьютера распишу"
    },
    {
      "id": 27523406,
      "author": "empenoso",
      "datetime": "2024-11-07T04:47:42.000Z",
      "text": "ESPHome – это платформа с открытым исходным кодом для создания прошивок для устройств на базе ESP8266 и ESP32. Она позволяет легко настраивать и управлять устройствами через интерфейс YAML-файлов без необходимости глубокого понимания программирования микроконтроллеров. С помощью ESPHome можно подключать различные датчики, реле, светодиоды и другие компоненты к домашней автоматизации.Google Home – это умная колонка от компании Google, которая управляется голосовым помощником Google Assistant. Она предназначена для выполнения различных задач, таких как воспроизведение музыки, управление умными устройствами дома, ответы на вопросы пользователей и многое другое. Также под этим названием часто подразумевают экосистему умного дома от Google, включающую устройства и сервисы, работающие с Google Assistant."
    },
    {
      "id": 27523450,
      "author": "ErshoffPeter",
      "datetime": "2024-11-07T05:10:37.000Z",
      "text": "Прощу прощения за душноту, но сказать \"Google Home – это умная колонка от компании Google\" - это всё равно что сказать, что в каждой Яндекс.Станции живёт Алиса, то есть мягко говоря некорректно.Google Home - это аналог Умного дома от Яндекса или Mi home, то есть экосистема, позволяющая настраивать несложные сценарии, в том числе и с участием Google Assistant-а. При этом наличие Google Assistant-а совершенно не обязательно. Было дело - дома баловался немного."
    },
    {
      "id": 27523310,
      "author": "imotorin",
      "datetime": "2024-11-07T03:50:44.000Z",
      "text": "а зачем вот это вот всё?есть прекрасные коммунальные светильники, со встроенными датчикам движения (звуковыми или микроволновыми), датчиками света, приглушенным дежурным, или полностью выключенным, и выбором режимов.https://actey.com/production/osveshhenie_lestnichnyh_kletok/есть простые без режимовhttps://www.vseinstrumenti.ru/product/svetilnik-zhkh-svetodiodnyj-kruglyj-s-optiko-akusticheskim-datchikom-dvizheniya-12vt-iled-smd2835-spp-12-970-230-6-5-ip65-r-ionich-1598-6914575/за недорого и без всего этого \"умного дома\", который развалится и нужно обслуживать и с которым через 3 года, когда вы съедите, никто не разберется"
    },
    {
      "id": 27523370,
      "author": "woodiron",
      "datetime": "2024-11-07T04:29:25.000Z",
      "text": "Думаю, что при таких переделках общего имущества нужно предусматривать режим обхода, возвращающий в состояние \"как было\", например, в виде отдельного переключателя в щите с обязательными поясняющими схемами и текстом."
    },
    {
      "id": 27523388,
      "author": "empenoso",
      "datetime": "2024-11-07T04:36:15.000Z",
      "text": "Были заменены только лампы e27"
    },
    {
      "id": 27523832,
      "author": "DvoiNic",
      "datetime": "2024-11-07T06:37:34.000Z",
      "text": "Нет никаких переделок - просто замена светильника с \"обычного\" на \"коммунальный\" (с соотв. датчиками)."
    },
    {
      "id": 27523384,
      "author": "empenoso",
      "datetime": "2024-11-07T04:35:44.000Z",
      "text": "Я прекрасно это знаю, но хоть один из этих светильников может вечером светить тускло, а днём ярко?"
    },
    {
      "id": 27523478,
      "author": "imotorin",
      "datetime": "2024-11-07T05:23:38.000Z",
      "text": "светить ради чего?когда никого нет - светить не надотускло-ярко - понятия субъективные,светить нужно так чтобы видно было.актей умеет светитьярко - когда кто-то есть (аккустический датчик)тускло или совсем не светить - когда никого нетсовсем не светить - когда есть дневной светтакие у нас стоят в МОПах в домекруглый - светит при движении , не светит если есть внешний светтакие у нас стоят в МОПах в гараж кооперативеи всё это из коробки, доступно для похмельного ЖЭКовского электрика"
    },
    {
      "id": 27523496,
      "author": "empenoso",
      "datetime": "2024-11-07T05:29:23.000Z",
      "text": "Вы меня не поняли похоже. Мой запрос: вечером светить тускло, а днём ярко. И только при наличии движения."
    },
    {
      "id": 27523634,
      "author": "fio",
      "datetime": "2024-11-07T05:58:57.000Z",
      "text": "Раскройте, пожалуйста, необходимость менять яркость. Понимаю, если встал с кровати и просыпаться от яркого света не хочется. Но в подъезде..."
    },
    {
      "id": 27523666,
      "author": "empenoso",
      "datetime": "2024-11-07T06:05:05.000Z",
      "text": "Я был в нескольких современных домах и у них было два контура освещения в подъезде. Переключал консьерж вручную.А подумал как сделать тоже самое, но попроще - чтобы автоматизация была без необходимости ручного переключения."
    },
    {
      "id": 27523712,
      "author": "RoasterToaster",
      "datetime": "2024-11-07T06:13:27.000Z",
      "text": "Бедным лучше просто денежку под дверь совать, ну или еды какой оставлять на коврике."
    },
    {
      "id": 27523826,
      "author": "randomsimplenumber",
      "datetime": "2024-11-07T06:36:09.000Z",
      "text": "Ну, у богатых свои причуды. А вот что даёт жильцам эта игра в свет, решительно непонятно. Хочется интерактивности - есть светильники с датчиком. Хочется 2-уровневой интерактивности - можно повесить рядом маломощный тупой светильник. Чем схема проще, тем дольше она проработает."
    },
    {
      "id": 27523912,
      "author": "empenoso",
      "datetime": "2024-11-07T06:57:32.000Z",
      "text": "Я не могу повесить рядом маломощный тупой светильник, потому что в подъезде живёт  \"бдительным\" жилец, который не хочет платить за нерациональное использование общедомовой электроэнергии из своего кармана ни единой копейки."
    },
    {
      "id": 27523766,
      "author": "Morriarte",
      "datetime": "2024-11-07T06:24:18.000Z",
      "text": "Когда днем с улицы заходишь в подъезд где освещение ели-ели светит, глазки ничего не видят пока не привыкнут. Нужно яркое освещение. Вечером же, когда с полумрака заходишь в подъезд где светит яркая светодиодная лампа - глазкам больно. Нужно тусклое освещение."
    },
    {
      "id": 27523808,
      "author": "empenoso",
      "datetime": "2024-11-07T06:33:28.000Z",
      "text": "В точку"
    },
    {
      "id": 27524066,
      "author": "Tirarex",
      "datetime": "2024-11-07T07:31:28.000Z",
      "text": "Проблема решается просто правильно подобранным уровнем освещения. Тогда заходя вечером ничего не слепит, а днем все еще достаточно освещенности для передвижения.  Хорошо если еще с датчиком звука стоят, тогда пока никого нет они вообще ничего не едят.Жил в доме с таким светом, никакого желания что то менять не было ни разу."
    },
    {
      "id": 27524462,
      "author": "Daimos",
      "datetime": "2024-11-07T08:44:47.000Z",
      "text": "Над подъездом нет освещения двора? Почему бы тогда не сделать? И тогда не будет проблемы со входом в подъезд. Ну и светильник этот должен быть с датчиком освещенности, чтобы днём зря не светить и движения, чтобы включаться ночью."
    },
    {
      "id": 27524752,
      "author": "norguhtar",
      "datetime": "2024-11-07T09:29:59.000Z",
      "text": "Самое важное знаете что? Их можно поставить и через обращение в УК или ТСЖ :)"
    },
    {
      "id": 27524808,
      "author": "empenoso",
      "datetime": "2024-11-07T09:44:07.000Z",
      "text": "Лапы накаливания формально были и до меня. Поэтому скорее всего не могу с Вами согласится.Освещение ведь уже было - зачем УК или ТСЖ что-то менять?"
    },
    {
      "id": 27524870,
      "author": "norguhtar",
      "datetime": "2024-11-07T09:56:00.000Z",
      "text": "У меня они же и были. Поменяли на светодиодные светильники с датчиком присутствия. Это выгодно для УК и ТСЖ снижает стоимость обслуживания."
    },
    {
      "id": 27524952,
      "author": "empenoso",
      "datetime": "2024-11-07T10:09:47.000Z",
      "text": "Это я отлично понимаю, потому что живу в том же городе, что и вы.Но это к сожалению не всегда понимают другие люди."
    },
    {
      "id": 27524932,
      "author": "AlekseyPraskovin",
      "datetime": "2024-11-07T10:05:59.000Z",
      "text": "и с которым через 3 года, когда вы съедите, никто не разберетсяТак автору на окружающих плевать. Ему игрульку сделать. Вот он и сделал"
    },
    {
      "id": 27524942,
      "author": "empenoso",
      "datetime": "2024-11-07T10:08:35.000Z",
      "text": "Почему вы так решили?"
    },
    {
      "id": 27524986,
      "author": "empenoso",
      "datetime": "2024-11-07T10:14:21.000Z",
      "text": "за недорого и без всего этого \"умного дома\", который развалится и нужно обслуживать и с которым через 3 года, когда вы съедите, никто не разберетсяЛампы которые были установлены обычные e27 и и они включаются только по датчику движения.Просто уровень света разный в зависимости от времени суток"
    },
    {
      "id": 27525986,
      "author": "leorush",
      "datetime": "2024-11-07T12:58:54.000Z",
      "text": "В принципе, можно обойтись датчиком движения, датчиком освещения и релюшкой. При наличии нужного уровня освещения включается яркая лампа. При отсутствии - тусклая."
    },
    {
      "id": 27526154,
      "author": "empenoso",
      "datetime": "2024-11-07T13:28:32.000Z",
      "text": "Такие заводские изделия разве есть?"
    },
    {
      "id": 27526218,
      "author": "leorush",
      "datetime": "2024-11-07T13:42:33.000Z",
      "text": "Есть фотореле (которое включается при достижении нужного уровня освещённости). От него кидаем провод на управляющий ввод промежуточного реле, к которому подключена лампа через датчик движения. В результате, при достижении нужного уровня освещённости, фотореле переключает промежуточное. А там мы можем или две лампы с разной яркостью на выводы промежуточного повесить, либо одну лампу через диммер.Если хотите, могу примерную схему накидать"
    },
    {
      "id": 27526708,
      "author": "empenoso",
      "datetime": "2024-11-07T15:18:35.000Z",
      "text": "Если хотите, могу примерную схему накидатьБыло бы интересно"
    },
    {
      "id": 27527588,
      "author": "leorush",
      "datetime": "2024-11-07T19:15:04.000Z",
      "text": "Как-то так. С ик-датчика фаза идёт на входной контакт прмежуточного реле (7) при его срабатывании там пояаляется фаза. Днём фотореле не срабатывает, и фаза с входного контакта идёт на контакт 1. С фотореле фаза идёт на управляющий контакт промежуточного реле (10). При срабатывании фотореле, фаза начинает идти на контакт 4, к которому подключена лампа через диммер (либо тут можно менее яркую лампу поставить)Реле в примере взял РЭК77/3 ИЭК"
    },
    {
      "id": 27527654,
      "author": "3Demon",
      "datetime": "2024-11-07T19:35:26.000Z",
      "text": "А фотореле надо тащить на улицу и прокладывать к нему провод, так? А то кажется автор как раз хотел уйти от прокладки лишних проводов"
    },
    {
      "id": 27527668,
      "author": "leorush",
      "datetime": "2024-11-07T19:39:18.000Z",
      "text": "Почему именно на улицу? Его вполне можно поставить в помещении, только настроить порог срабатывания. Самое главное чтобы лампа на него не светила.Вместо фотореле, можно поставить выключатель, таймер, wifi выключатель и т.п."
    },
    {
      "id": 27523378,
      "author": "enkill",
      "datetime": "2024-11-07T04:32:40.000Z",
      "text": "У нас в доме стоят светильники с датчиками движения и микрофонами, но жильцы тоже постоянно их выключают. Только вот включать обратно не включают. И разговоры тоже не помогают) все мои доводы о том, что дежурное освещение должно быть и это норма; что до для того чтобы включить свет , мне сначала над подняться по темноте до него - это пофиг) я даже предлагал посчитать сколько будет жрать светильник на 8 ватт в год в расчете на 1 человека в год и дать ему эти 10 рублей с счет оплаты электричества за год - не помогло)"
    },
    {
      "id": 27523392,
      "author": "empenoso",
      "datetime": "2024-11-07T04:37:38.000Z",
      "text": "Поставьте вот такие:https://www.iek.ru/products/catalog/svetotekhnika/upravlenie_osveshcheniem_i_komplektuyushchie/datchiki_dvizheniya/datchiki_dvizheniya_infrakrasnye/datchik_dvizheniya_dd_031_belyy_500vt_190gr_9m_ip20_iekУ них переключалка закрыта кожухом."
    },
    {
      "id": 27524098,
      "author": "nerudo",
      "datetime": "2024-11-07T07:38:01.000Z",
      "text": "Похоже, ходить выкручивать лампочки по подъездам снова станет хорошим заработком."
    },
    {
      "id": 27524150,
      "author": "empenoso",
      "datetime": "2024-11-07T07:49:23.000Z",
      "text": "Внешне они как обычные выглядят..."
    },
    {
      "id": 27524180,
      "author": "randomsimplenumber",
      "datetime": "2024-11-07T07:56:11.000Z",
      "text": "10 обычных лампочек или 1 необычная."
    },
    {
      "id": 27524266,
      "author": "pavel_raskin",
      "datetime": "2024-11-07T08:09:32.000Z",
      "text": "И камеры заодно."
    },
    {
      "id": 27526008,
      "author": "Viacheslav01",
      "datetime": "2024-11-07T13:02:30.000Z",
      "text": "Причем вне зависимости от того, умные они или обычные.Надо только, что бы сошлось 2 условия:1) Падение уровня жизни.2) Наличие точки сбыта, куда можно сдавать все скрученное, вот с этим похоже пока не очень. Кабель медь режут и по 2 метра, а лампочки не выкручивают."
    },
    {
      "id": 27530904,
      "author": "Tifliskiy",
      "datetime": "2024-11-08T13:23:41.000Z",
      "text": "Я сталкивался с устройствами на базе Tuya. Могу сказать, что замки снабжены ресетом, сбросом до заводских настроек, в том числе и отвязка от сети, сброс учётных записей и ТД. А вот устройства к которому есть доступ злоумышленнику, например дверной звонок, с датчиком движения, камерой , микрофоном. Просто так не отвязешь, надо писать в поддержку производителя и его отвязываяют на сервере. Так же и с лампочками думаю, их потом не подвяжешь к умному дому. Смысл от ненужного устройства?"
    },
    {
      "id": 27531106,
      "author": "empenoso",
      "datetime": "2024-11-08T14:12:15.000Z",
      "text": "Боюсь что те люди, которые промышляют подобными делами будут рады сбыть за копейки"
    },
    {
      "id": null,
      "author": "empenoso",
      "datetime": "2024-11-07T08:21:02.000Z",
      "text": "Вам реально повезло."
    },
    {
      "id": 27524340,
      "author": "empenoso",
      "datetime": "2024-11-07T08:21:02.000Z",
      "text": "Вам реально повезло."
    },
    {
      "id": 27525298,
      "author": "aborouhin",
      "datetime": "2024-11-07T11:07:01.000Z",
      "text": "Много лет назад, когда я жил в многоквартирном доме и тоже озадачился нормальным освещением на своей площадке - этот вопрос я решил просто. Отключил это освещение в щитке от общих нужд и подключил после своего квартирного счётчика и автомата. Мне эти копейки погоды не делали, а всем недовольным можно наглядно демонстрировать, что на их трудовую копейку никто не только не покусился, но более того, даже сэкономил им пару рублей :)"
    },
    {
      "id": 27524706,
      "author": "mltk",
      "datetime": "2024-11-07T09:21:28.000Z",
      "text": "В то время как на \"загнивающем западе\" ради снижения преступности расставляют лампы светящие всю ночь на улице и в МОПах, и с теми же целями закрывают такие инфраструктурные решения прошлого века как подземные пешеходные переходы, в нашей счастливой стране реализуют умное освещение в домах в стиле fog of war :)"
    },
    {
      "id": 27524802,
      "author": "DMGarikk",
      "datetime": "2024-11-07T09:42:57.000Z",
      "text": "вы не понимаете, у нас успешно работают над уменьшением углеродного следа ;)"
    },
    {
      "id": 27524906,
      "author": "empenoso",
      "datetime": "2024-11-07T10:02:20.000Z",
      "text": "Если в подъезде есть \"ответственные\" жильцы, для которых является проблемой просто светодиодные лампы, который нагреваются меньше чем лампы накаливания и светят ярче. И замена ламп накаливания на светодиодные в 2024 году идёт с огромным скрипом из-за этого. Вот это странно."
    },
    {
      "id": 27524614,
      "author": "Gordon01",
      "datetime": "2024-11-07T09:05:44.000Z",
      "text": "Мне нравится как это решено в ЕС и Турции: свет по таймеру с кнопки или по датчику движения.Просто, дубово, всегда работает как ожидает пользователь, стоит копейки.Во время всяких ремонтов общего пространства просто везде ставил турецкие светильники с датчиком движения. Период свечения и чувствительность настраивается, а для случая как у автора есть еще и с датчиком освещения - не включаются, когда света достаточно.В итоге все работает так же как у автора, но проще и дешевле.А тут получилась сверхумная лампочка, забирающая из сети время своей работы, вместо того, чтобы просто включаться по движению + освещенности."
    },
    {
      "id": 27524654,
      "author": "empenoso",
      "datetime": "2024-11-07T09:11:53.000Z",
      "text": "Она и включается только по датчику движения. Просто уровень света разный в зависимости от времени суток"
    },
    {
      "id": 27524888,
      "author": "jar_ohty",
      "datetime": "2024-11-07T09:59:35.000Z",
      "text": "А вот теперь попробуйте посчитать стоимость этого решения хотя бы в сравнении с тем, чтобы эта лампочка горела круглосуточно. За сколько лет оно окупится? Экономия должна быть...экономной. Она не должна обходиться дороже сберегаемого ресурса.А по поводу активиста, которому не давала покоя подсвечивающаяся лампочка... У нас люди вообще очень слабо представляют энергопотребление тех или иных приборов и сколько это будет в рублях. Паникуют из-за горящей лишние пять минут лампочки на 10 Вт, кипятят чайник на газу \"потому что электрочайник - это целых полтора киловатта, нам не по карману столько платить\", даже жмотятся по поводу зарядки смартфона гостя. При этом у них чуть ли не круглосуточно бубнит телевизор размером в половину экрана ЦУПа, потребляющий ватт 200."
    },
    {
      "id": 27524966,
      "author": "empenoso",
      "datetime": "2024-11-07T10:11:49.000Z",
      "text": "По поводу экономии здесь в статье ни слова нет. Всё это было чистым желанием сделать удобство.По поводу активиста - он не хочет разбираться ни в каких современных технологиях и в светодиодных лампочках тоже."
    },
    {
      "id": 27525266,
      "author": "Serge78rus",
      "datetime": "2024-11-07T11:01:21.000Z",
      "text": "Всё это было чистым желанием сделать удобство.он не хочет разбираться ни в каких современных технологиях и в светодиодных лампочках тоже.Просто сосед тоже хочет \"удобства\", а для него это отсутствие необходимости разбираться во всех этих \"современных технологиях и в светодиодных лампочках\". Он платит коммуналку и больше ни о чем не хочет задумываться, на что имеет полное право."
    },
    {
      "id": 27528236,
      "author": "fraks",
      "datetime": "2024-11-08T01:49:58.000Z",
      "text": "Про экономию 200т.р. написано прямо в заголовке. Люди читают статью и не могут найти откуда такая экономия вообще получается.Мне статья понравилась, но для того что бы понять про что она, потребовалось прочитать 2-3 раза. Сама задача выглядит странной, но интересно было посмотреть пример применения HomeAssistant и умных девайсов. Обычно примеры сильно притянуты за уши, а в данном случае получилось просто (с учетом что HA уже был) и эффективно (заменили одну лампочку на умную, сделали скрипты-настройки в HA)."
    },
    {
      "id": 27528272,
      "author": "empenoso",
      "datetime": "2024-11-08T02:36:50.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 27527230,
      "author": "Viacheslav01",
      "datetime": "2024-11-07T17:43:41.000Z",
      "text": "Думаю за год, другой окупится точно.Цена на электричество будет только рости."
    },
    {
      "id": 27525478,
      "author": "Ukaru",
      "datetime": "2024-11-07T11:34:47.000Z",
      "text": "А сколько лет могли светить просто светодиодные светильники без всяких датчиков? То есть вот эти деньги на оборудование на датчики на умные дома, время на программирование.. это всё стоит денег так вот переложить это всё на 3 Вт светильник сколько лет он будет гореть не выключаясь?Понятно, хайповая статья, куча развлечений это всё понятно но экономические целесообразности всех этих датчиков для одного светильника минимальной мощности... Если уж на то пошло вообще этот светильник можно от трёх картофелин, это будет вообще экономия.. причём картошку после того как энергия у неё кончится можно ещё и съесть.."
    },
    {
      "id": 27525622,
      "author": "empenoso",
      "datetime": "2024-11-07T12:03:02.000Z",
      "text": "Если обычные светодиодные лампы не выключать и не трогать наверное года 3 просветят легко."
    },
    {
      "id": 27525608,
      "author": "AleksandBelokon",
      "datetime": "2024-11-07T12:01:13.000Z",
      "text": "Статья о том как сначала придумать проблему, а потом героически ее решить.На самом деле достаточно было проверить правильность подключения датчика движения и тогда никакого свечения ламп в состоянии выключено не было бы"
    },
    {
      "id": 27525636,
      "author": "empenoso",
      "datetime": "2024-11-07T12:06:09.000Z",
      "text": "На самом деле достаточно было проверить правильность подключения датчика движения и тогда никакого свечения ламп в состоянии выключено не было быНе могу с вами согласиться - некоторые датчики движения не полностью выключают свечение светодиодной лампы.Но статья о том как сделать два контура освещения в зависимости от времени суток на этой лампе e27 которая обесточивается по датчику движения."
    },
    {
      "id": 27525754,
      "author": "AKudinov",
      "datetime": "2024-11-07T12:25:54.000Z",
      "text": "Подождите, внутри датчика движения нагрузкой управляет простое электромагнитное реле. Как оно может не_полностью выключать нагрузку? А для питания самой электроники датчика отдельные выводы предусмотрены."
    },
    {
      "id": 27526164,
      "author": "empenoso",
      "datetime": "2024-11-07T13:30:29.000Z",
      "text": "Купите самый дешёвый датчик движения за 300 рублей, подключите его в разрыв фазы и если это проделать, то обнаружится что светодиодная лампа при отсутствии движения будет слабо гореть..."
    },
    {
      "id": 27526438,
      "author": "Borz",
      "datetime": "2024-11-07T14:25:31.000Z",
      "text": "ключевое здесь - \"подключите его в разрыв фазы\"Чтобы лампа отключалась полностью, надо включать датчик не последовательно с лампой, а параллельно, а вот реле уже последовательно с лампой"
    },
    {
      "id": 27526608,
      "author": "empenoso",
      "datetime": "2024-11-07T14:53:35.000Z",
      "text": "Я написал про разрыв фазы потому что в подъездах все лампы ведь так и подключены - в разрыв фазы. А ноль приходит прямо на лампу"
    },
    {
      "id": 27526852,
      "author": "DvoiNic",
      "datetime": "2024-11-07T15:49:55.000Z",
      "text": "Нет, там симистор, и схема питания самого датчика. вот утечка через питание датчика и \"подзажигает\" светодиодную лампочку... У меня в комнате потолочные светодиодные светильники через светодиод выключателя светятся... лет семь уже."
    },
    {
      "id": 27526258,
      "author": "Luboff_sky",
      "datetime": "2024-11-07T13:50:10.000Z",
      "text": "Всё это экономия на спичках. Основные потери  - тепло. Через двери, форточки, люки... Их просто не видно. А лампочку  - видно)))"
    },
    {
      "id": 27527028,
      "author": "xDimus",
      "datetime": "2024-11-07T16:41:11.000Z",
      "text": "Интересные девайсы от Актей, надо будет попробовать, вкл/выкл там не плавное?PS Делал в начале века, когда готового ничего не было, товарищу управление освещением для коридора-кармана.Контроллер на msp430 + rtc + 2 датчика движения + 2 светодиодных линейки, бп на 24 вольта.Основные функции плавное включение и выключение освещения по времени и от датчиков движения, независимо друг от друга, яркость в зависимости от времени суток. С ардуиной uno не получилось одновременно плавно независимо управлять двумя каналами, может надо было помощнее плату использовать, но плата TI уже была. Лет 5 назад интересовался - всё работало."
    },
    {
      "id": 27527242,
      "author": "imotorin",
      "datetime": "2024-11-07T17:48:33.000Z",
      "text": "вспыхивают быстротускнеют до дежурного заметно плавно"
    },
    {
      "id": 27527064,
      "author": "rainchik",
      "datetime": "2024-11-07T16:53:50.000Z",
      "text": "Спасибо за статью,я правильно понимаю, что zegbee-лампочки на первом этаже были на достаточном удалении от контроллера и\\или ближайших роутеров(других лампочек, допустим). Нормально добивает через перекрытия и на таком расстоянии?"
    },
    {
      "id": 27528202,
      "author": "empenoso",
      "datetime": "2024-11-08T01:16:48.000Z",
      "text": "ZigBee лампочки в тамбуре моего этажа, на первом обычные"
    },
    {
      "id": 27527728,
      "author": "StarJohn",
      "datetime": "2024-11-07T19:59:19.000Z",
      "text": "Ух, сразу видно, автор в необычном доме живёт, ещё и Москве/Питере. В обычных панельках в провинции все это будет украдено за неделю. Единственное, что не крадут, это сорокаватки и их аналоги, перемазанные зелёнкой - их просто гопота разбивает. Про камеры можно вообще не вспоминать, у нас домофон-то на двери работает через раз."
    },
    {
      "id": 27528204,
      "author": "empenoso",
      "datetime": "2024-11-08T01:17:06.000Z",
      "text": "Я так-то в Перми живу"
    },
    {
      "id": 27528206,
      "author": "empenoso",
      "datetime": "2024-11-08T01:18:04.000Z",
      "text": "Как то наверное с этим можно бороться - чтобы этого не было"
    },
    {
      "id": 27528728,
      "author": "GrustniyNos",
      "datetime": "2024-11-08T05:59:03.000Z",
      "text": "А что за особенность датчика движения, после которого лампа всегда светится? Размыкается ноль вместо фазы?"
    },
    {
      "id": 27528736,
      "author": "empenoso",
      "datetime": "2024-11-08T06:00:54.000Z",
      "text": "Нет, размыкается фаза.На самых дешевых датчиках движения светодиодная лампа всегда будет чуть светиться."
    },
    {
      "id": 27530946,
      "author": "GrustniyNos",
      "datetime": "2024-11-08T13:33:16.000Z",
      "text": "Смелое утверждение конечно. Вопрос был про устройство реле, а не про цену в общем-то."
    },
    {
      "id": 27531012,
      "author": "Borz",
      "datetime": "2024-11-08T13:45:15.000Z",
      "text": "дело в том, что@empenosoне учитывает, что если устройство включено \"в разрыв\" цепи лампы, а не параллельно с ней, то какой бы цены устройство не было, оно всегда будет неполноценно \"размыкать\" цепь. Только разве что оно не питается от батарейки, но это уже совсем другая история.Была бы там не светодиодная, а обычная лампа накаливания, то это и не было бы заметно - напряжения, проходящего через лампочку не хватало бы для накала нити. А вот для светодиодной хватает, чтобы она слегка светилась.Аналогично работают и светодиоды-подсветки встроенные в выключатель - пока выключатель выключен (пардон за тавтологию), ток течёт через светодиод и сопротивление, а на лампочку уже не хватает. Щёлкаем выключателем - он коротит цепь \"светодиод-резистор\" и оп, тока на лампочке уже хватает, чтобы она светила ярко.Детальнее можно почитать например тут:https://ledjournal.info/shemy/viklyuchatel-s-podsvetkoy.html"
    }
  ]
}