{
  "url": "https://habr.com/ru/articles/857402/comments/",
  "article_id": 857402,
  "title": "Мой первый и неудачный опыт поиска торговой стратегии для Московской биржи",
  "comments": [
    {
      "id": 27567140,
      "author": "Smartor",
      "datetime": "2024-11-18T02:19:36.000Z",
      "text": "О господи:) Зачем такие мучения?:)  Скачайте Метатрейдер у брокеров, поддерживающих показ российских CFD в Метатрейдере. В Метатрейдере есть встроенный язык mql4/mql5 для написания торговых роботов, есть встроенный в программу оптимизатор с поиском оптимумов, есть визуализация результатов оптимизации и тестер стратегий.Это уменьшит объём ваших усилий раз в 10, не меньше. И да, вы даже сможете готовые подключать библиотечки для машинного обучения.ЗЫ Как человек, имеющий некоторый опыт, сразу скажу, что ваша стратегия слишком примитивна и, конечно же, не работает."
    },
    {
      "id": 27567196,
      "author": "empenoso",
      "datetime": "2024-11-18T03:22:32.000Z",
      "text": "Такие мучения чтобы НЕ использовать Windows и пользоваться чем-то  кросс-платформенным."
    },
    {
      "id": 27567300,
      "author": "randomsimplenumber",
      "datetime": "2024-11-18T05:16:37.000Z",
      "text": "Такие мучения чтобы НЕ использовать WindowsВыколю себе глаз чтобы теща у зятя была одноглазая ;) Что не так с Windows?"
    },
    {
      "id": 27567322,
      "author": "empenoso",
      "datetime": "2024-11-18T05:35:37.000Z",
      "text": "Захотелось, просто личное предпочтение - может такое быть?"
    },
    {
      "id": 27567204,
      "author": "eyeDM",
      "datetime": "2024-11-18T03:33:05.000Z",
      "text": "В 2024-м торговать в лонг на Московской бирже, с опорой на исторические данные... Опыт наверняка будет полезным, но вот перспектива какого-то существенного заработка сомнительна."
    },
    {
      "id": 27567222,
      "author": "empenoso",
      "datetime": "2024-11-18T03:50:34.000Z",
      "text": "Полезный опыт и то вперёд"
    },
    {
      "id": 27567206,
      "author": "aaa_bbb",
      "datetime": "2024-11-18T03:33:11.000Z",
      "text": "Есть идея краткосрочной стратегии для МОЕХ не на основе цены, закономерность есть но я так и не смог понять можно ли ее определить с приемлемой вероятностью и достаточно ли для этого брокерских данных.Если есть желание поковыряться пишите."
    },
    {
      "id": 27567284,
      "author": "empenoso",
      "datetime": "2024-11-18T05:02:46.000Z",
      "text": "Мне кажется что сама идея ничего не стоит.Это ни в коем случае не значит что у Вас плохая идея или я неуважительно отношусь к Вашему комментарию.Мне кажется реализация более ценна. Ну и тот же ChatGPT набросает идей очень много."
    },
    {
      "id": 27567744,
      "author": "Mox",
      "datetime": "2024-11-18T07:54:17.000Z",
      "text": "Мне кажется в России без шортов не заработать"
    },
    {
      "id": 27568738,
      "author": "vadim_gorovoy",
      "datetime": "2024-11-18T11:29:42.000Z",
      "text": "Загугли Игоря Чечета, там бэктрейдер и тесты и оптимизация и т.д."
    },
    {
      "id": 27569834,
      "author": "Trane247",
      "datetime": "2024-11-18T15:32:16.000Z",
      "text": "Выглядит, как избыточная мера, уже есть готовые варианты, но как опыт выглядит круто, к тому же, куча интересных инструментов и сервисов использованно"
    },
    {
      "id": 27570010,
      "author": "Rubicj",
      "datetime": "2024-11-18T16:20:46.000Z",
      "text": "Сейчас нечто похожее делаю на Питон . Только я тики Акций (4-5) лет слаживал через команду Chunk или Group в минутный интервал . Вторая переменная это цена закрытия - День или 4 Часа . Третью можно взять Vix , Трежери ,S@P или чего там  придумаеться  , ну это если амерские акции . Просто хотелось свои идеи увидеть а не из библиотеки Питон .. Если будет какой то Эдж в этом ресерче , придётся докупить real market data + API .Возможно у автора где-то ошибка в коде , в виде неизменной плитки (красной) .."
    },
    {
      "id": 27571144,
      "author": "axweye",
      "datetime": "2024-11-19T04:17:00.000Z",
      "text": "А откуда загружали историю тиков за 4-5 лет?"
    },
    {
      "id": 27586762,
      "author": "vl12",
      "datetime": "2024-11-22T21:23:07.000Z",
      "text": "Я пользователь Linux, и торговые боты конечно пишу на Python, с надеждой, что если окажется рабочий установить его на сервере. (Но сразу скажу, что я пытаюсь заниматься этим с 2008 года, ещё с MT4, и ни одной рабочей стратегии мне не попадалось. - индикаторные, сетки, сейчас пробую скальпингские.) Использую модифицированный мною Backtesting.py, поскольку в нём хорошие, масштабируемые мышкой графики и тепловая карта (хотя лучше анализировать создаваемый им dataframe со статистикой).В список можно добавить Freqtrade. - Быстрее Backtesting, пакетный бэкстестинг, удобное скачивание котировок с бирж, может использоваться как бот и др. фичи.  Но сугубо для индикаторного трейдинга.Последние дни пробую TSlab под Windows. Понравилось удивительно быстрая оптимизация параметров. - минуты. (По сравнению с часами на Backtesting, который при этом постоянно вылетает при среднем числе параметров из-за утечки памяти. Он для каждого прохода сохраняет в памяти все трейды и дублирует целиком историю котировок.) TSlab имеет очень удобное и быстрое отображение графиков (день и ночь по сравнению с питоновским matplotlib), быстрое скачивание истории. Но там уникальный визуальный редактор алгоритма, неудобно, из-за этого не найти решений в текстовом интернет, и справка и форум заброшены 10 лет назад.TSlab запускаю в виртуальной машине. Никуда от этого ни деться - скальперские терминалы все тоже под Windows. Использовать необходимо VMware, поскольку другие виртуалки тормозят, из-за невозможности задать видеопамять больше 256 Мб или плохой поддержки видеодрайверов."
    }
  ]
}