{
  "url": "https://habr.com/ru/articles/865558/comments/",
  "article_id": 865558,
  "title": "С бумаги на цифровую карту: генерация файла из таблицы для импорта на карту и геокодирование адресов с помощью Python",
  "comments": [
    {
      "id": 27664280,
      "author": "LesnoyChelovek",
      "datetime": "2024-12-12T04:50:08.000Z",
      "text": "В качестве оптимизации, можно в коде прописать и преобразование в десятчиные градусы,  и привести их к кортежу: благо есть функция tuple()."
    },
    {
      "id": 27664420,
      "author": "empenoso",
      "datetime": "2024-12-12T05:47:52.000Z",
      "text": "Спасибо.Смущала форма записи - как записать градусы, минуты и секунды. А так уже готовое и только одно число, правда после манипуляции Эксель - Нотепад++."
    },
    {
      "id": 27664428,
      "author": "Jury_78",
      "datetime": "2024-12-12T05:53:14.000Z",
      "text": "Может лучше хранить входные данные в отдельном файле, например все известный csv."
    },
    {
      "id": 27664442,
      "author": "empenoso",
      "datetime": "2024-12-12T05:57:36.000Z",
      "text": "Можно, но это такое решение на коленке - надо было получить результат и скорее всего больше к этому никогда не вернутся."
    },
    {
      "id": 27664520,
      "author": "KEugene",
      "datetime": "2024-12-12T06:28:48.000Z",
      "text": "Далее в Notepad++ при помощи макросов привёл данные к неизменяемому виду данных в Python,Можно было из экселя сразу сформировать gpx файл. Результат скопировать и вставить в текст. Может заголовок вручную добавить, чтобы не заморачиваться.Если что, то и адреса можно подтянуть прямо в эксель без gpx, по точкам. Благо он позволяет использовать Google api. Адреса я так получал. По идее, расстояния тоже. Вроде был и такой запрос в мапс. В крайнем случае, можно Python функцию расстояния  вставить там же. Хотя, это же расстоние \"по прямой\", без учета маршрута? Тогда луше Google api."
    },
    {
      "id": 27664580,
      "author": "empenoso",
      "datetime": "2024-12-12T06:46:45.000Z",
      "text": "Спасибо, по делу написали - кое-что для себя взял."
    },
    {
      "id": 27669352,
      "author": "Qlavrt",
      "datetime": "2024-12-13T08:54:24.000Z",
      "text": "Кто еще по заголовку и картинке подумал, что будет распознавание таблиц координат с изображений - ставим лайк :)"
    },
    {
      "id": 27670658,
      "author": "empenoso",
      "datetime": "2024-12-13T13:13:44.000Z",
      "text": "Частично здесь такое тоже есть, правда в ручном режиме"
    }
  ]
}