{
  "url": "https://habr.com/ru/articles/875846/comments/",
  "article_id": 875846,
  "title": "Как сканировать документы А3 формата, если под рукой только сканер А4 формата",
  "comments": [
    {
      "id": 27961100,
      "author": "aborouhin",
      "datetime": "2025-02-24T01:22:45.000Z",
      "text": "Я, конечно, тоже очень люблю малую автоматизацию в своей рутине :) ... Но не проще ли исходный файл с \"полулистами\" формата А4 просто распечатать на виртуальный PDF-принтер, выбрав формат бумаги А3 и  режим \"2 страницы на лист\"?"
    },
    {
      "id": 27961104,
      "author": "empenoso",
      "datetime": "2025-02-24T01:27:17.000Z",
      "text": "Тоже вариант, но скорее всего будет небольшая белая полоска от полей листов"
    },
    {
      "id": 27961110,
      "author": "aborouhin",
      "datetime": "2025-02-24T01:33:50.000Z",
      "text": "Да нет, вот сейчас попробовал, для чистоты эксперимента, исключительно штатным в винде софтом. Открыл PDF в MS Edge и распечатал на принтер \"Microsoft Print to PDF\" - склеивает без зазора."
    },
    {
      "id": 27961482,
      "author": "winorun",
      "datetime": "2025-02-24T05:30:03.000Z",
      "text": "Если чертежи более менее ровные, Ваш метод худо бедно работает, но если листы уже потрепаны надо делать 3 скана на лист в tiff. После закидываем в фотошоп, накладываем слоями, ставим разницу слоев, выравнимаем слоя относительно друг друга(наложение будет черное), убираем разницу слоев, стираем лишние. А уже потом конвертируем в pdf. Результат не отличим от сканирования на принтере большего размера. Я так А3 в А2 превращаю."
    },
    {
      "id": 27961572,
      "author": "empenoso",
      "datetime": "2025-02-24T05:52:44.000Z",
      "text": "Это вручную, я так тоже умею. Но статья ведь про автоматизацию"
    },
    {
      "id": 27961614,
      "author": "kraken2018",
      "datetime": "2025-02-24T06:04:18.000Z",
      "text": "Потому что \"гладко было на бумаге, да забыли про овраги\". Если у вас чертежей мало, то зачем заморачиваться с написанием скрипта, а если много - дешевле найти сканер А3, возможно, с автоподатчиком, сейчас этих МФУшек с автоподатчиками на каждом шагу гора. Сшивать в наше время А3 из А4 ну такое себе. И да, вы не учитываете перекосы при укладке чертежа, перекосы при печати, выравнивание по левому и правому краю, тонкие белые линии вдоль края скана (тоже зависит от сканера). Эта скрипт хорош только как упражнение для ума, практической ценности у него не особо много"
    },
    {
      "id": 27992574,
      "author": "ahabreader",
      "datetime": "2025-03-02T23:23:00.000Z",
      "text": "После закидываем в фотошоп, накладываем слоями, ставим разницу слоев, выравнимаем слоя относительно друг другаЭто софтом для панорам можно автоматизировать.https://www.discogs.com/group/thread/645487https://en.wikipedia.org/wiki/Image_Composite_Editor#:~:text=Archived"
    },
    {
      "id": 27961568,
      "author": "kraken2018",
      "datetime": "2025-02-24T05:51:48.000Z",
      "text": "Но потом чертеж положили чуть неровно в сканер, и получилась шляпа. А чертеж бывает не только на тоненькой бумаге, но и вшитый в папку, которую ровно в сканер не положить. А еще... и еще 1000 вариантов. То есть в теории все замечательно, в практическом применении будут сложности. Ну и с практической стороны, я бы лучше скачал cpdf и одной командой cpdf file1.pdf file2.pdf ... -impose-xy \"2 1\" -o outfile.pdf слил бы по такому принципу любое количество страниц в любом количестве файлов одновременно, без ненужных преобразований между растрами, при которых всегда качество теряется"
    },
    {
      "id": 27969062,
      "author": "linchk",
      "datetime": "2025-02-25T13:40:36.000Z",
      "text": "Если не ошибаюсь с помощью imagemagic это можно консольной командой в одну строчку решить.  Ну или небольшим батником, чтобы сшить все файлы в каталоге. Так же можно воспользоваться ghost script или pdftk"
    }
  ]
}