{
  "url": "https://habr.com/ru/articles/876216/comments/",
  "article_id": 876216,
  "title": "Как бесплатно разослать всем членам ТСЖ персональное сообщение о завтрашней уборке снега через WhatsApp",
  "comments": [
    {
      "id": 27901118,
      "author": "xalyavius",
      "datetime": "2025-02-10T05:20:45.000Z",
      "text": "А как вы определяете владельца автомобиля (его имя и номер телефона) по госномеру автомобиля который мешает уборке?"
    },
    {
      "id": 27901162,
      "author": "empenoso",
      "datetime": "2025-02-10T05:38:31.000Z",
      "text": "Предполагается что рассылка идёт за день до уборки всем автовладельцам."
    },
    {
      "id": 27901594,
      "author": "shaggyone",
      "datetime": "2025-02-10T07:27:57.000Z",
      "text": "А сделайте мега фичу, ещё одну рассылку за час до уборки."
    },
    {
      "id": 27901168,
      "author": "woodiron",
      "datetime": "2025-02-10T05:41:59.000Z",
      "text": "Как дополнение к бумажному объявлению вполне возможно, но не заменит бумажное - у кого-то  кнопочные телефоны, кто-то просто не устанавливает ватсап, да и вообще чаты заполняются обсуждениями о сантехнике, стрижке собак и т.д., и люди  в них не смотрят."
    },
    {
      "id": 27901190,
      "author": "randomsimplenumber",
      "datetime": "2025-02-10T05:50:43.000Z",
      "text": "Что то подобное было уже?Забавно, но без специального обученного айтишника не заведется. А для прочих есть СМС;)"
    },
    {
      "id": 27901200,
      "author": "hooperer",
      "datetime": "2025-02-10T05:53:03.000Z",
      "text": "зачем это в принципе делать, если 80% автомобилей все-равно утром, до 11 утра уезжают на работу?в чем смысл писать сообщения 80% жителей с автомобилями, которые уже на работе, напоминая что снег во дворе не убран и вечером придётся возвращаться, как раз к 18-19 и часовой уборки снега, когда как раз обычно начинают убирать снего?может стоило таймер для ТСЖ ввести начала Обязательной Ежедневной уборки в 11-00 и завершения в 17-00, с дополнением на снегопады?зачем это делать если не утверждена в тсж схема обращения снежных отходов и не назначены и не обустроены места временного хранения снежных масс?"
    },
    {
      "id": 27901268,
      "author": "empenoso",
      "datetime": "2025-02-10T06:12:57.000Z",
      "text": "если 80% автомобилей все-равно утром, до 11 утра уезжают на работуНу вот не всегда. У нас полно народу стоят"
    },
    {
      "id": 27901514,
      "author": "hooperer",
      "datetime": "2025-02-10T07:08:04.000Z",
      "text": "Дворы они везде разные.Для меня к примеру Очень странно что у Вас во дворе большинство автомобилистов:1)днём не работают2)безработные3)работают ночью4)свой вариант.вот в моём дворе примерно так: 15% не двигаются вообще в течении более чем 3-х месяцев. из оставшихся - 80% покидают двор до 11-00 и возвращаются к 19-и."
    },
    {
      "id": 27901542,
      "author": "Bigdoc",
      "datetime": "2025-02-10T07:15:21.000Z",
      "text": "В Москве в моем дворе (да и практически во всех дворах) больше половины авто остаются днем во дворе. Сам вынужден ездить на работу на метро, поскольку вокруг работы только платные парковки по 350 рублей в час."
    },
    {
      "id": 27901668,
      "author": "empenoso",
      "datetime": "2025-02-10T07:41:19.000Z",
      "text": "Я в Перми"
    },
    {
      "id": 27901848,
      "author": "hooperer",
      "datetime": "2025-02-10T08:20:37.000Z",
      "text": "хм... странные дворы.  у меня телеграмм бот фотографиями в моём дворе показывает расклад как писал выше.опять же интересно:и вот смогут ли они куда-то (куда? если после снегопада - то такое во всех дворах соседних)  после сообщения переставлять авто? о_Оа если стоят 15..20% машин к которым люди в принципе в ближайшие недели не подойдут - что с ними?если с ними нельзя почистить двор - тогда зачем вообще нужна такая очистка от управляющей компании? ну если они не могут, то реально, зачем они, зарплату получать?а если с ними  - теми 15..20 % машин которые в принципе никто не уберёт - можно нормально почистить двор, то с какого, пардон вкусной_травы_хрена, с такого такого противоестественного замысла -кто то решил, что даже гипотетически стоит часть проблемы управляющей компании -за которую нормально так платят денег- перекладывать на других ?для того чтобы им помочь? а может тогда стоит и жителям лопаты взять и самим почистить? и в сообщении об этом добавить? даже 18-и летним девочкам и 80-и летним старикам? или может быть тогда управляющая компании по сути получается не нужна и не стоит столько денег вкидывать в обслуживание мкжд не забирая их у жителей?может стоит время тсж вложить в снегоуборочную технику, или хотя бы создание схемы обращения снежных масс? чтобы было понятно хотя-бы где снег вообще складировать должны во время снегопада,  куда его убирать и откуда вывозить?имхо одна такая Грамотная Схема, распечатанная и повешенная на стенду - лучше 10-и таких ботов покажет что и как стоит делать.а не дёргать жителей по пустякам, напоминая о качестве работы управляющей компании? которое в подавляющем большинстве случаев находится ил в иррациональной или в отрицательной полуплоскостях.ну то-есть мне вот идея кажется порочной.Вопросов в адэкватности вообще такого подхода как рассылка ботом уведомления о работе Управляющей компании - как видите - возможно достаточно много. И они не всегда с положительным ответом.сужу опять же по себе, но подписываться на бота в вотсапе? не буду 100%, это бред. и вот же если я получу от кого то предложение переставить машину, это вызовет только рвотный рефлекс в отношении этого этого кого то, с блокировкой  возможности писать сообщения от отправившего такое.ну потому что даже потенциально такая идея - для меня к примеру - выглядит как спам."
    },
    {
      "id": 27902062,
      "author": "empenoso",
      "datetime": "2025-02-10T08:56:21.000Z",
      "text": "Понятно. Вы ещё эту тему:https://habr.com/ru/articles/874412/не читали видимо"
    },
    {
      "id": 27902094,
      "author": "hooperer",
      "datetime": "2025-02-10T09:02:02.000Z",
      "text": "нет, это скорее размышления на тему того, что возможно нет у управляющих компании никаких мыслей о том, что:1) не всем людям приятно читать спам,2) не все его читают спам, и кому то он может быть противен,3) местная управляющая компания может кого-то раздражать,4) раздражать качество работы управляющей компании может большинство жителей,5) получать сообщения от компании которая раздражает - далеко не самая лучшая затея.увы, отсутствие таких мыслей только отталкивает людей от ук)и да. люди могут отписываются и выключать уведомления на чате дома в том числе потому что они заняты своими делами. и им не интересен ни спам, ни ук которая не может сделать сама свою работу.и тогда эта статья выглядит как \" смотрите, я сделал спамбота\" какой он прекрасный, как классно спаммит.ну то-есть по сути программы вопросов нет, но смысл выполняемых действий программы уходит в иррациональную и отрицательные полуплоскости, да.этим он немного схож с той статьёй)"
    },
    {
      "id": 27903842,
      "author": "avost",
      "datetime": "2025-02-10T15:21:26.000Z",
      "text": "зачем это в принципе делать, если 80% автомобилей все-равно утром, до 11 утра уезжают на работу?Так, ведь остальные не уезжают. С теми, которые уезжают вообще проблем нет.вечером придётся возвращаться, как раз к 18-19 и часовой уборки снега, когда как раз обычно начинают убирать снего?в каком смысле? Там же написано - с 9 до 15. Откуда вы взяли 19???может стоило таймер для ТСЖ ввести начала Обязательной Ежедневной уборки в 11-00 и завершения в 17-00, с дополнением на снегопады?Автовоадельцам завести таймер? Да, заводите, никто ведь не запрешает.зачем это делать если не утверждена в тсж схема обращения снежных отходов и не назначеныЗачем убирать снег? Вы ещё спросите зачем задницу вытирать...не обустроены места временного хранения снежных масс?И снегоплавильный заводик, угу.а если стоят 15..20% машин к которым люди в принципе в ближайшие недели не подойдут - что с ними?Будут стоять в сугробе. А вы как думали?если с ними нельзя почистить двор - тогда зачем вообще нужна такая очистка от управляющей компании?Чтобы остальным было хорошо. Внезапно.кто то решил, что даже гипотетически стоит часть проблемы управляющей компании -за которую нормально так платят денег- перекладывать на других ?То, что ваша машина стоит в сугробе - это ВАША проблема, а не проблема УК :). УК помогает вам её решить. Если хотите. Если не хотите - ну живите так.или хотя бы создание схемы обращения снежных масс?Какой в этом смысл? Снег убирает не схему уборки снежных масс, а трактор. Или дворник с лопатой. Или, если автовладелец - ленивый дебил, то он сам.где снег вообще складировать должны во время снегопада, куда его убирать и откуда вывозить?Нигде не должны складировать. Приезжает трактор, приезжает грузовик. Первый грузит снег на второй, второй увозит еснег на полигон. В процедуре не задействована ни одна чиновничья сволочь со схемами движения снежных масс, пятилетними планами по снегоуборке и премиями за успешное освоение средств. Вы не в ту дверь зашли.а не дёргать жителей по пустякамЕсли вас устраивает, что ваш тарантас останется в сугробе в то время, как ваши соседи будут ставить машины на чистое - ну, значит так этому пустяку и быть! Вы, главное, не мешайте своими планами по снегоосвоению другим жить не в хлеву, а, наоборот, как белым человекам.вот же если я получу от кого то предложение переставить машину, это вызовет только рвотный рефлексМожете даже сблевнуть, если того, что ваша машина останется в сугробе вам покажется мало. Каждый сам выбирает окружающую среду, которая соответствует его стремлениям. Кому-то чистый двор, а кому - вот так...с блокировкой возможности писать сообщения от отправившего такое.Никто не может запретить вам держать ваш рыдван в сугробе. У меня во дворе есть и такие... эээ, альтернативно-одарённые. Потом, почему-то, удивляются весной когда их машинка оттаивает - чего ж это такое с нею случилось? Где поржавела, где сугробом стекло выдавило.. :)У одного такого одарёныша машина на автозапуске стояла. Периодически заводилась, урчала там внутри снежной горы и выхоп через дырочку пускала - дым нашёл себе дорогу. Прогревалась! Под снегом небыстро остывает - бензина надоооолго хватило ))"
    },
    {
      "id": 27904166,
      "author": "hooperer",
      "datetime": "2025-02-10T16:47:04.000Z",
      "text": "зачем это в принципе делать, если 80% автомобилей все-равно утром, до 11 утра уезжают на работу?Так, ведь остальные не уезжают. С теми, которые уезжают вообще проблем нет.А те которые не уезжают - Все ли имеют желание и возможности куда то переставлять своё авто?вечером придётся возвращаться, как раз к 18-19 и часовой уборки снега, когда как раз обычно начинают убирать снего?в каком смысле? Там же написано - с 9 до 15. Откуда вы взяли 19???ну у меня во дворе со снегопадами обычно начинают в 16..17 и вывозят до 19..20может стоило таймер для ТСЖ ввести начала Обязательной Ежедневной уборки в 11-00 и завершения в 17-00, с дополнением на снегопады?Автовоадельцам завести таймер? Да, заводите, никто ведь не запрешает.написано - таймер для ТСЖ . так перевирать текст выдрав из контекста надо, конечно уметь.зачем это делать если не утверждена в тсж схема обращения снежных отходов и не назначены\"Зачем убирать снег? Вы ещё спросите зачем задницу вытирать...\"\"Зачем присылать уведомления, если не утверждена схема куда вывозить снег.\" немного отличается от \" зачем убирать снег если не утверждена схема куда вывозить снег.\" .    и я имел ввиду именно \"Зачем присылать уведомления, спамить жителей, если не утверждена схема куда вывозить снег.\"не обустроены места временного хранения снежных масс?\"И снегоплавильный заводик, угу.\"снова выдираете из контекста вписывая странный извращённый смысл. вот абзац целиком\"может стоит время тсж вложить в снегоуборочную технику, или хотя бы создание схемы обращения снежных масс? чтобы было понятно хотя-бы где снег вообще складировать должны во время снегопада, куда его убирать и откуда вывозить?  \"тут имеется ввиду схема обращения снега Внутри дворов. Где снег Временно  складировать, откуда его и Как убирать и Куда вывозить.а если стоят 15..20% машин к которым люди в принципе в ближайшие недели не подойдут - что с ними?\"Будут стоять в сугробе. А вы как думали?\"а мы внезапно думали что ВОКРУГ машин, к которым люди могут и не подходит будут АККУРАТНО дворники будут убирать снег.За это деньги им платят регулярно, на секундочку.если с ними нельзя почистить двор - тогда зачем вообще нужна такая очистка от управляющей компании?\"Чтобы остальным было хорошо. Внезапно.\"для этого надо задрюкать вообще всех? может тогда для этого и в соседние города рассылать вести?кто то решил, что даже гипотетически стоит часть проблемы управляющей компании -за которую нормально так платят денег- перекладывать на других ?\"То, что ваша машина стоит в сугробе - это ВАША проблема, а не проблема УК :). УК помогает вам её решить. Если хотите. Если не хотите - ну живите так.\"Тут надо дополнить что за немалую такую ОПЛАТУ УК проводит эти Обязательные действия. ане просто так, УК решила сниспослать чудо уборки.Они это делают за вполне конкретные, РЕГУЛЯРНО оплачиваемые деньги, на секунгду. и это ИХ проблема КАК убирать снег и чистить двор вообще.Это не помощь, это Платная Услуга, за которую УК платят не малые деньги.или хотя бы создание схемы обращения снежных масс?\"Какой в этом смысл? Снег убирает не схему уборки снежных масс, а трактор. Или дворник с лопатой. Или, если автовладелец - ленивый дебил, то он сам.\"смысл в том, чтобы было понятно что и когда делать, а не тупой инженер УК придумывал куда ехать пьяному трактористу или закидывать солью газоны дворнику.где снег вообще складировать должны во время снегопада, куда его убирать и откуда вывозить?\"Нигде не должны складировать. Приезжает трактор, приезжает грузовик. Первый грузит снег на второй, второй увозит еснег на полигон. В процедуре не задействована ни одна чиновничья сволочь со схемами движения снежных масс, пятилетними планами по снегоуборке и премиями за успешное освоение средств. Вы не в ту дверь зашли.\"Вот у Вам фантазии, конечно. Местное законодательство в части экологии вы наверно не читали.а не дёргать жителей по пустякам\"Если вас устраивает, что ваш тарантас останется в сугробе в то время, как ваши соседи будут ставить машины на чистое - ну, значит так этому пустяку и быть! Вы, главное, не мешайте своими планами по снегоосвоению другим жить не в хлеву, а, наоборот, как белым человекам.\"мне не нравиться спам на телефон.людей которым может потенциально нравиться работа УК в Любом дворе в стране - наверно стоит всё таки посчитать в долях процента, не более.Людей которым потенциально Не нравиться работы любой гипотетической УК в любом гипотетическом дворе - абсолютное большинство.вот же если я получу от кого то предложение переставить машину, это вызовет только рвотный рефлексМожете даже сблевнуть, если того, что ваша машина останется в сугробе вам покажется мало. Каждый сам выбирает окружающую среду, которая соответствует его стремлениям. Кому-то чистый двор, а кому - вот так...из одного ни коим образом не вытекает другое:Если слабоватые, медленные и не желающие работать дворники не очистили одно место, я совершенно спокойно поставлю машину на другое. это ни коем образом не зависит от УК и тем-более каких либо звонков/смсс блокировкой возможности писать сообщения от отправившего такое.Никто не может запретить вам держать ваш рыдван в сугробе. У меня во дворе есть и такие... эээ, альтернативно-одарённые. Потом, почему-то, удивляются весной когда их машинка оттаивает - чего ж это такое с нею случилось? Где поржавела, где сугробом стекло выдавило.. :)У одного такого одарёныша машина на автозапуске стояла. Периодически заводилась, урчала там внутри снежной горы и выхоп через дырочку пускала - дым нашёл себе дорогу. Прогревалась! Под снегом небыстро остывает - бензина надоооолго хватило ))и? я вот уезжаю утром к примеру до 8-и. для чего мне к примеру такой спам?для чего мне вообще думать о достаточно странных людях, с лопатами, да хоть на тракторах - если они не могут самостоятельно решить проблемы организации своей работы?есть люди которые да, не ездят зимой и ставят на зиму машину во дворе.и для них это нормально. и у них машина может и сугробом покрыться.Означает ли это что вокруг неё асфальт надо не чистить?если да то на основании чего?а если этот человек инвалид и после операции две недели не может выйти из дома? ему тоже надо выходить лопатой махать?а если человек привык работать головой, ему обязательно тоже махать лопатой? где то такое обязательство прописано? или человек может с сугробом на машине доехать до автомойки где очиститься от снега? тогда зачем нужно махать лопатой?или  может быть любой человек сам решает что делать с его машиной и вокруг неёа что делать с асфальтом - дело компании и специально обученных людей которые взялись за немалые деньги очищать асфальт?есть люди, которые физически не могут завести машину и отогнать её. есть люди которые физически и приехать не могут за ней.  есть люди которые не любят когда им пишут/звонят спамеры. случаи бывают разные.спамить при этом в чат дома  - вообще не очень хорошая идея.мне кажется что спамеры, организующие рассылки без разрешения каждого кому присылают сообщения/звонки- кроме минусов в карму от большинства пользователей своих программ всё таки получают и много других минусов в жизни а ментальной части.и да, я вот сделал лет пять назад на дом телеграмм бота с запросами с клавиатуры картинок с трёх камер онлайн, по запросу, и могу прекрасно видеть как чистят/ не чистят. и сколько машин стоит - в режиме реального времени. благо китайские камеры с доступом к их облаку стоили не дорого, как и приставка с армбианом.А вот что я из переписки вынес -так то, что тут теперь есть \" выделение цитаты\" - прикольная штука, не знал, спасибо, понравилась)"
    },
    {
      "id": 27904188,
      "author": "hooperer",
      "datetime": "2025-02-10T16:52:40.000Z",
      "text": "да. временное хранение снега в средней полосе - это скорее обязательство, чем рекомендательство. потому что во время снегопада/сразу после него вывести весь снег из всех дворов физически невозможно. от этого и нормы на величину снежного вала и сроки обязательной уборки и прочее. и без грамотно проработанной схемы куда и, что даже важнее - как должен двигаться трактор, куда должен мести дворник - всё остальное это пересыпание из пустого в порожнее, то есть Бессмысленно по своей сути. это скорбный, но факт."
    },
    {
      "id": 27901518,
      "author": "Wolframium13",
      "datetime": "2025-02-10T07:09:16.000Z",
      "text": "Зимой процентов 50 стоит на приколе, по субъективным наблюдениям."
    },
    {
      "id": 27901396,
      "author": "randomsimplenumber",
      "datetime": "2025-02-10T06:38:12.000Z",
      "text": "Да, а как решаются сложности с теми, кто не читает, кому пофиг, или воще подснежник?"
    },
    {
      "id": 27901416,
      "author": "empenoso",
      "datetime": "2025-02-10T06:43:12.000Z",
      "text": "Названивают им голосом наверное"
    },
    {
      "id": 27902600,
      "author": "olku",
      "datetime": "2025-02-10T10:42:29.000Z",
      "text": "В Германии делают проще. Знак запрещения остановки за неделю. Водитель по закону обязать проверять статус места с этой частотой. Потом эвакуация. Просьбы не всегда работают. А тут всем выгодно."
    },
    {
      "id": 27901614,
      "author": "Abyss777",
      "datetime": "2025-02-10T07:31:44.000Z",
      "text": "У меня другой вопрос, экселечка председателя ТСЖ и вот этот ваш скрипт является ИСПДн. Оно там все требования закона О персональных данных выполняет? Согласие получено? Меры защиты используются? Средства сертифицированные?А распространение сообщений без согласия соответствует требованиям закона О связи и закона О рекламе?"
    },
    {
      "id": 27901660,
      "author": "empenoso",
      "datetime": "2025-02-10T07:40:39.000Z",
      "text": "Звучит как юридический вопрос. У меня есть только скрипт, который даже в реальной жизни пока и не использовался"
    },
    {
      "id": 27922314,
      "author": "Denimss",
      "datetime": "2025-02-14T14:34:24.000Z",
      "text": "То есть вы даже на практике не знаете, забанит или нет за эту рассылку аккаунт?"
    },
    {
      "id": 27922324,
      "author": "empenoso",
      "datetime": "2025-02-14T14:36:03.000Z",
      "text": "В интернете пишут достаточно двум-трем людям пожаловаться на сообщение и аккаунт ватсапа в бан.Со своего лучше не пробовать такие рассылки."
    },
    {
      "id": 27901738,
      "author": "randomsimplenumber",
      "datetime": "2025-02-10T07:53:43.000Z",
      "text": "экселечка председателя ТСЖНаверное, потому председатель и не побежал в припрыжку устанавливать nodejs ;) Таблица - зло привычное и предсказуемое. И обзвонить 20 человек - не тот уровень, который прямо требует автоматизации. Исполнитель за это зарплату получает.А если лень звонить - есть SMS, можно прямо с телефона отправить, можно с компа, цена рассылки - минута работы снегоуборщика.анекдот про пастуха и бизнес -:консультанта ;)"
    },
    {
      "id": 27901760,
      "author": "empenoso",
      "datetime": "2025-02-10T07:59:01.000Z",
      "text": "Если вы про меня то в данном случае я заинтересованное лицо и никакой платы конечно я бы не получал"
    },
    {
      "id": 27902032,
      "author": "randomsimplenumber",
      "datetime": "2025-02-10T08:52:51.000Z",
      "text": "Я про того кто раньше выполнял эту работу."
    },
    {
      "id": 27903694,
      "author": "kolabaister",
      "datetime": "2025-02-10T14:49:04.000Z",
      "text": "А это уже пробовалось? Если да то сколько раз? Выглядит крайне баноопасно, whatsapp не любит такое.Кроме того, стоит одному-двум человекам пометить это как спам и бан станет почти неизбежен."
    },
    {
      "id": 28521720,
      "author": "antirek",
      "datetime": "2025-07-03T08:20:21.000Z",
      "text": "есть официальный воцап - WABA, подключить для ТСЖ можно через gupshup.io. интерфейсом пользоваться для переписок - что-то типа gigasend.ru"
    }
  ]
}