{
  "url": "https://habr.com/ru/articles/877264/comments/",
  "article_id": 877264,
  "title": "Лучшие статьи Хабра в январе 2025 года",
  "comments": [
    {
      "id": 27864688,
      "author": "Exosphere",
      "datetime": "2025-02-01T11:07:06.000Z",
      "text": "Сказано грубо, но пришла написать тот же самый комментарий.@empenosoдля пользы дела предлагаю в дальнейшем всё же новости исключать. И этому есть единственная и весомая причина: новость - формат маложивущий, то есть хитовая и просматриваемая новость от 1 февраля будет совершенно неактуальной 1 марта, когда вы подготовите аналитику."
    },
    {
      "id": 27864056,
      "author": "CBET_TbMbI",
      "datetime": "2025-02-01T08:16:32.000Z",
      "text": "Несмотря на то, что парсер обрабатывал все публикации января 2025 года, в финальную выборку вошли только статьи с рейтингом выше +30 или просмотрами более 30 тысяч.Это важное ограничение: его цель — выделить действительно резонансные материалы, а не просто все подряд.Ну так и надо называть \"самые резонансные\", а не \"лучшие\". Популярность ни капли не демонстрирует качество статьи.Качественные статьи могут быть посвящены какой-нибудь узкой теме и естественно, они не наберут столько же плюсов и комментариев, как новости про РКН или туалеты в самолёте.Из приведённых рейтингов мне больше всего нравится тот, что по числу закладок. Он хотя бы показывает число людей, посчитавших статью полезной."
    },
    {
      "id": 27864176,
      "author": "empenoso",
      "datetime": "2025-02-01T08:55:08.000Z",
      "text": "Я считаю что воттоп резонансных статей, это которые лидируют по минусам в рейтинге:"
    },
    {
      "id": 27864180,
      "author": "empenoso",
      "datetime": "2025-02-01T08:56:46.000Z",
      "text": "А самые качественные статьи видимо найдут здесь:https://habr.com/ru/technotext/2024/"
    },
    {
      "id": 27864682,
      "author": "Exosphere",
      "datetime": "2025-02-01T11:04:22.000Z",
      "text": "Да, но опять же не все подаются — иногда узкоспециализированные тексты авторы несут только послеугроз и шантажауговоров. А иногда упорно не несут."
    },
    {
      "id": 27865116,
      "author": "ProstoKirReal",
      "datetime": "2025-02-01T13:14:30.000Z",
      "text": "Моя статья оказалась на 1 месте по числу закладок, но если бы автор не составил данный рейтинг, то я бы об этом и не узнал бы)"
    },
    {
      "id": 27865164,
      "author": "empenoso",
      "datetime": "2025-02-01T13:29:40.000Z",
      "text": "Вы можете поддержать мою публикацию плюсиком, мне приятно будет.У меня публикации не все хорошо получаются,  например недавняя моя публикация про автоматизацию переписки собрала минусов на попадание в топ неоднозначных статей января."
    },
    {
      "id": 27866130,
      "author": "Thomas_Hanniball",
      "datetime": "2025-02-01T18:30:55.000Z",
      "text": "Вот, кстати отличный пример того, что даже написание статей на Хабре слабо увеличивает карму.У вас 13 статей, у всех 20+ рейтинга, но голосований за карму всего 46, общий уровень кармы +30. Т.е. написание статьи, которая понравится аудитории, почти никак не увеличивает карму. Это печально.Хотя рейтинг у вас большой - 148, но он со временем обнуляется, т.е. примерно через месяц неактивности он начинает постепенно стремиться к 0."
    },
    {
      "id": 27867206,
      "author": "empenoso",
      "datetime": "2025-02-02T01:23:43.000Z",
      "text": "Я не знаю что увеличивают карму, но очень точно могу сказать что её уменьшает: если вы написали какой-то комментарий который как другой человек считает его лично задевает, то можно тут же получить минус в карму.Даже на эту казалось бы эту безобидную статью мне эту прилетел минус в карму \"за распространение рекламы\" и я потом даже понял за что: когда я парсил авторов - у них у некоторых приведены телеграм-каналы в специализации. И вот какой-то человек посчитал что так я распространяю рекламу.Ну и конкретный пример неделю назад я опубликовал статью про автоматизацию переписки и как мне написали грубо отвечал в комментариях. После этого на меня обрушился буквально шквал минусов в карму штук 10 или 15. Это так-то очень много. После этого я стал ныть в комментариях что меня заминусовали  и карма и рейтинг статьи немножко подросли обратно. И всё потому что я писал \"грубые комментарии\" только в ответ на какие-то прямо личные оскорбления.И даже за эту статью:"
    },
    {
      "id": 27867226,
      "author": "Thomas_Hanniball",
      "datetime": "2025-02-02T01:46:13.000Z",
      "text": "Да, есть такое. На любую хорошую статью всегда прилетает пару минусов в карму. Это нормально. На 6 плюсов обычно прилетает 3 минуса, поэтому итоговый прирост кармы получается +3 за хорошую статью. Это в лучшем случае. Часто меньше.Если статья малоинтересная, то там просто может пару минусов прилететь без всяких плюсов.Разделение кармы и рейтинга - это плохая идея, но редакция Хабра, видимо, лучше знает, зачем так сделано. Сама по себе карма тут бесполезна, т.к. её увеличивают\\уменьшают не твои заслуги, а сами читатели Хабра. Карма получается никак не связана ни со статьями, ни с комментариями. По факту бесполезная метрика, которую можно крутить как вверх, так и вниз. Мало того, голосовать за статьи или комменты можно только в ограниченный срок, а голосовать за карму можно всегда."
    },
    {
      "id": 27864154,
      "author": "arman_ka",
      "datetime": "2025-02-01T08:49:32.000Z",
      "text": "Ставить в этот рейтинг новости это бредятина, чел просто нонстоп публикует всё, что видит. Иногда просто до маразма доходит когда новость из двух предложений и ссылки. Никакой заслуги автора тут нет, больше просмотров и плюсов у резонансной новости, меньше у непонятной никому не нужной."
    },
    {
      "id": 27864190,
      "author": "empenoso",
      "datetime": "2025-02-01T09:00:06.000Z",
      "text": "В целом уже постфактум я тоже обратил внимание что статьи'article'более говорящие."
    },
    {
      "id": 27864688,
      "author": "Exosphere",
      "datetime": "2025-02-01T11:07:06.000Z",
      "text": "Сказано грубо, но пришла написать тот же самый комментарий.@empenosoдля пользы дела предлагаю в дальнейшем всё же новости исключать. И этому есть единственная и весомая причина: новость - формат маложивущий, то есть хитовая и просматриваемая новость от 1 февраля будет совершенно неактуальной 1 марта, когда вы подготовите аналитику."
    },
    {
      "id": 27864730,
      "author": "empenoso",
      "datetime": "2025-02-01T11:19:13.000Z",
      "text": "Хорошо"
    },
    {
      "id": 27864748,
      "author": "arman_ka",
      "datetime": "2025-02-01T11:25:34.000Z",
      "text": "простите, что грубо, виноват, просто я однажды прям сгорел с того, что у него новость была двумя предложениями и то исказив посыл оригинальной статьи, а тут у него весь топ получается. Понятно что какая-то заслуга есть мб он перевёл или акумулировал несколько источников, но всё равно это не тож самое, что статью написать."
    },
    {
      "id": 27864772,
      "author": "Exosphere",
      "datetime": "2025-02-01T11:35:59.000Z",
      "text": "Новость на то и новость, что это специфический формат. Условно говоря, хороший и профессиональный новостник должен максимально быстро принести новость на свою площадку. Если хватает на две строчки, он срочно их публикует, потом апдейтит, добавляет подробности, потом может опубликовать саммари. Это точно не статья, хотя порой по трудозатратам \"дороже\" статьи, потому что нужно быть в актуальном моменте и очень быстро собирать информацию. Так что для новости две строчки - вариант нормы, а вот если эти две строчки не растут дальше, вот это уже не норма."
    }
  ]
}