{
  "url": "https://habr.com/ru/articles/879574/comments/",
  "article_id": 879574,
  "title": "Как быстро найти цены на совместимую с Home Assistant бытовую технику: мой опыт автоматизации поиска цен",
  "comments": [
    {
      "id": 28052458,
      "author": "sic",
      "datetime": "2025-03-18T01:05:12.000Z",
      "text": "А когда-то мне ведущие профессора рассказывали, что следующее поколение интернет это open data и открытые агентные сети, а сейчас ни один маркетплейс не имеет даже унитарного api запроса цен на тот же товар (его guid), и цена без учёта \"персональных скидок\" плюс минус ни о чем. Если продавцы хотят делать деньги, то кто же в общем-то им запретит."
    },
    {
      "id": 28052602,
      "author": "vbifkol",
      "datetime": "2025-03-18T03:30:15.000Z",
      "text": "Wi-Fi — наиболее распространённый вариант, но часто требует облакаBluetooth — подходит для локальных устройств, но ограничен дальностьюZigbee и Z-Wave — энергоэффективные протоколы для умного дома, но требуют шлюзаЛокальные API — идеальный вариант, новстречается редкоЖивотные делятся на тех что с крыльями, тех что с хвостами и тех, что имеют право смотреть на императора.WiFi сам по себе никогда не требует облака. Он тоже ограничен дальностью, как и зигби, как и зетвейв. И он тоже как и БТ подходит для локальных устройств. У вайфая две беды: зашумленный диапазон и энергоэффективность. И главное преимущество: ширина канала, то же видео гнать по всему остальному - так себе. Второе преимущество - есть почти в любом доме.BT в домашних устройствах принципиально не отличается от вайфая. Тем более что начиная с 4го, емнип, это местами и есть вайфай, расширенный в сторону снижения энергопотребления. С дальностью у него никаких проблем нет. Как и зигби требует физического устройства для радиотракта.Зигби из всего перечисленного - самый энергоэффективный. И как следствие - самый ненадежный (по крайней мере в батарейных устройствах). И медленный. И да, требует отдельного радиоустройства - координатора.Локальные АПИ - вообще не протокол. По ссылке - интеграция блютусных чайников.По сути спасибо, хорошая штука. Если бы пользовался ХА, было бы полезно."
    },
    {
      "id": 28054004,
      "author": "artck",
      "datetime": "2025-03-18T09:37:08.000Z",
      "text": "и тех, что имеют право смотреть на императора.Принадлежат императору!"
    },
    {
      "id": 28085392,
      "author": "izoiva",
      "datetime": "2025-03-25T06:08:26.000Z",
      "text": "Осталось только понять, зачем пылесосу WiFi."
    },
    {
      "id": 28109176,
      "author": "past",
      "datetime": "2025-03-30T09:57:40.000Z",
      "text": "За тем, чтобы сказать \"Алиса, пропылесось в спальне\""
    }
  ]
}