{
  "url": "https://habr.com/ru/articles/882608/comments/",
  "article_id": 882608,
  "title": "Автоматизируем учёт облигаций: как избавиться от рутины",
  "comments": [
    {
      "id": 27940284,
      "author": "POPSuL",
      "datetime": "2025-02-19T04:14:11.000Z",
      "text": "Тоже пришлось автоматизировать учёт облигаций для себя. Всё началось с того, что я хотел знать сколько же мне будет выпадать купонов за месяц чтобы наблюдать прибыль в абсолютных суммах. Ну а ещё была идея набить портфель так, чтобы купоны падали каждый день (не спрашивайте зачем, мои хотелки это мои хотелки :) ).В итоге написал небольшую утилиту для \"визуализации\" портфеля.Тыц![](https://habrastorage.org/webt/ot/q9/6o/otq96ojnxucg6irykt32z4e96le.png)Мои задачи, а именно:Отображение календаря со списком всех выплат и их общая суммаПростое обновление портфеля (никаких дат, просто \"список\" в формате \"ISIN колво\" и всё)Можно жмякнуть на дату и посмотреть что можно прикупить с выплатами в этот день были успешно решены. Рассчёт доходности бондов, дюрации, полноценное движение средств я делать не собирался (и не собираюсь), т.к. для этого, в целом, можно воспользоваться календариком в том же смарт-лабе.Ну и главные проблемы которые возникли при реализации:По флоатерам купоны не определены, поэтому наперёд можно посчитать на основании предыдущего периода (ну или самому где-то искать какая же будет ставка и забивать)По структурным бондам то же самое, но там хотя бы известен процент заранее.По некоторым бондам, я так и не понял почему (да и особо не заморачивался) последняя амортизация идёт именно как амортизация, а не погашение."
    },
    {
      "id": 27940408,
      "author": "empenoso",
      "datetime": "2025-02-19T05:11:12.000Z",
      "text": "Спасибо, что поделились. Картинка у Вас только не отображается. Вот она:"
    },
    {
      "id": 27940524,
      "author": "POPSuL",
      "datetime": "2025-02-19T05:31:46.000Z",
      "text": "Упс, как-то криво спойлеры в маркдауне работают. Пропустил :)"
    }
  ]
}