{
  "url": "https://habr.com/ru/articles/883704/comments/",
  "article_id": 883704,
  "title": "Как автоматически отслеживать новости компаний по своему портфелю?",
  "comments": [
    {
      "id": 27976514,
      "author": "sic",
      "datetime": "2025-02-27T02:29:32.000Z",
      "text": "Ни в коем случае не критикую изначальное направление статьи, \"как\" - и один из вариантов предложен. Но все же, \"зачем?\", что с этой информацией дальше делать?"
    },
    {
      "id": 27976536,
      "author": "empenoso",
      "datetime": "2025-02-27T02:48:22.000Z",
      "text": "Я написал скрипт который ищет ликвидные облигации. Он там же на Гитхабе. \"Зачем?\" - для того чтобы отбросить из этого списка ликвидных облигаций проблемные компании.Например, есть условные 300 000 руб: разделяем всю сумму на 10 облигаций.Воспользуемся первой частью скрипта - он найдёт самый выгодные варианты.Прогоняем их через поиск новостей - если в новостях не написано что прокуратура предъявила требования к этой организации, то следующий шаг.Четвёртый скрипт рассчитает нужное количество к покупке на основании суммы.Раз облигации достаточно много, то один раз в месяц просматривать брокерский счёт и докупать какие-то новые бумаги через первый шаг поиска облигаций.И так повторять до бесконечности."
    },
    {
      "id": 27976554,
      "author": "sic",
      "datetime": "2025-02-27T03:08:48.000Z",
      "text": "А есть какая-либо статистика, бэктесты профитности, сравнивающая медийные, но проблемные активы, с более тихими, но беспроблемными?"
    },
    {
      "id": 27976564,
      "author": "empenoso",
      "datetime": "2025-02-27T03:17:27.000Z",
      "text": "Прямо сейчас у меня нет"
    },
    {
      "id": 27977792,
      "author": "Pest85",
      "datetime": "2025-02-27T08:34:31.000Z",
      "text": "если нет соединения файлы создадутся пустые!Не лучше ли ошибку показывать и\\или записывать ее в файлы?"
    },
    {
      "id": 27977820,
      "author": "empenoso",
      "datetime": "2025-02-27T08:38:34.000Z",
      "text": "Возможно"
    },
    {
      "id": 27978170,
      "author": "danon13",
      "datetime": "2025-02-27T09:33:49.000Z",
      "text": "Первое, что напрашивается, это конечно перенаправлять новости в собственный телеграм канал, так как при ручном запуске мы всё-таки не получаем информациюсвоевременно.Вполне себе можно арендовать самую дешевую VPS, и запустить это добро по расписанию."
    },
    {
      "id": 27978174,
      "author": "empenoso",
      "datetime": "2025-02-27T09:34:22.000Z",
      "text": "Можно конечно, но лично для меня это не актуально. Лично для меня больше такой вариант подходит который я предложил в статье"
    },
    {
      "id": 27991628,
      "author": "Niccolum",
      "datetime": "2025-03-02T16:55:07.000Z",
      "text": "Идея прикольная, но я бы пошёл дальше:Вместо названия ещё бы парсил новости по старинке с помощью какого нибудь scrapy или новомодного ai parser'aС помощью гпт или дипсика вытаскивал бы краткое резюме новостиСкармливал бы какому нибудь gpt или дипсику вопрос, что нужно делать с бумагой на основе новости из п.2Тогда этот mvp уже был бы очень неплох"
    },
    {
      "id": 27991632,
      "author": "Niccolum",
      "datetime": "2025-03-02T16:55:43.000Z",
      "text": "Ну и настроить куда нибудь уведомления, или, что ещё лучше, робота, который будет на основании новостей и других данных управлять портфелем"
    },
    {
      "id": 27992676,
      "author": "empenoso",
      "datetime": "2025-03-03T01:38:52.000Z",
      "text": "Не хотите PR сделать? :)"
    }
  ]
}