{
  "url": "https://habr.com/ru/articles/887440/comments/",
  "article_id": 887440,
  "title": "Анализ торговых стратегий для акций Мосбиржи на дневных интервалах с помощью Python",
  "comments": [
    {
      "id": 28024240,
      "author": "sic",
      "datetime": "2025-03-11T01:02:52.000Z",
      "text": "Интересно. А при равновесных сделках, когда TP=|SL| исследовали?Мне лично такоеЛучшая сделка: +36.56Худшая сделка: -8.31%Не нравится."
    },
    {
      "id": 28024268,
      "author": "empenoso",
      "datetime": "2025-03-11T01:54:44.000Z",
      "text": "Отдельного исследования когда take profit (TP уровень фиксации прибыли) = stop loss (SL уровень ограничения убытков) не проводилось"
    },
    {
      "id": 28024248,
      "author": "up7",
      "datetime": "2025-03-11T01:29:55.000Z",
      "text": "А сколько вы заработали с помощью этого инструмента?"
    },
    {
      "id": 28024256,
      "author": "empenoso",
      "datetime": "2025-03-11T01:36:13.000Z",
      "text": "Это просто исследование. 15 лет назад я уже занимался алготрейдингом внутри дня, но результаты не были какими-то выдающими и приходилось поддерживать всю инфраструктуру на Windows"
    },
    {
      "id": 28024292,
      "author": "CBET_TbMbI",
      "datetime": "2025-03-11T02:05:51.000Z",
      "text": "Какое-то исследование - не очень исследование.Всего 2 инструмента. Один в приличный плюс, другой в минус. Значит статистики катастрофически не хватает.Имеет смысл рассмотреть хотя бы с десяток инструментов, чтобы понять картину в среднем. И так же можно разбить инструменты по годам ,чтобы понять, насколько стабильна картина во времени.Надо с чем-то сравнить. Уместно сравнить с банальным \"купил этот инструмент и держу\". Или с изменением индекса биржи."
    },
    {
      "id": 28024294,
      "author": "empenoso",
      "datetime": "2025-03-11T02:09:14.000Z",
      "text": "Вообще на гитхабе их выложено 20. В статье просто два самых полярных.Это просто исследование возможностей. Внутри дня с медленным АПИ брокера особо делать нечего, а на дневных данных - скорее торговая стратегия, которая может и руками поддерживаться.Вообще моя идея - скринер по фундаментальным данным + простой теханализ для выхода. Пока в процессе всего"
    },
    {
      "id": 28024452,
      "author": "Denwer_py",
      "datetime": "2025-03-11T03:57:35.000Z",
      "text": "И в отличие от MetaTrader, StockSharp, TSLab и Quik, которые работают с Московской биржей, но требуют WindowsВнутри дня с медленным АПИ брокера особо делать нечегоQuik спокойно запускается под Linux через Wine и с помощью Lua скриптов можно торговать хоть скальпинг, хоть in-day."
    },
    {
      "id": 28024458,
      "author": "empenoso",
      "datetime": "2025-03-11T03:59:26.000Z",
      "text": "И как вы тестируете скальпинг?Lua ведь уже торги"
    },
    {
      "id": 28024682,
      "author": "Denwer_py",
      "datetime": "2025-03-11T05:45:55.000Z",
      "text": "Lua-сервер без логики принятия торговых решений. Та же апишка брокера, только на много быстрее (как правило), а к ней уже хоть что можно. Посмотрите самый расшаренный пример QuikPy, хотя на мой взгляд не лучшая реализация, но у автора и с бектестом по-моему есть интеграции. Я, основываясь на этой библиотеке, писал уже своё решение"
    },
    {
      "id": 28024782,
      "author": "empenoso",
      "datetime": "2025-03-11T06:07:15.000Z",
      "text": "Спасибо"
    },
    {
      "id": 28024920,
      "author": "Denwer_py",
      "datetime": "2025-03-11T06:48:15.000Z",
      "text": "А в целом статья интересная и написана грамотно, спасибо."
    },
    {
      "id": 28024572,
      "author": "nikolz",
      "datetime": "2025-03-11T05:09:35.000Z",
      "text": "Два приведенных Вами примера наглядно показывают, что данная стратегия подобна лотереи. Угадал - выиграл, не угадал -проиграл.Увы, но все опубликованные стратегии Гуру, работают либо случайно, либо на специально подобранных данных."
    },
    {
      "id": 28024634,
      "author": "empenoso",
      "datetime": "2025-03-11T05:32:59.000Z",
      "text": "Вообще здесь идея что не отдельные бумаги, а именно портфель - верх по обороту - работа только с ними."
    },
    {
      "id": 28024654,
      "author": "nikolz",
      "datetime": "2025-03-11T05:39:06.000Z",
      "text": "Портфель - это надежда на то, что среднее случайных данных будет положительным.  Но это лишь вера в удачу.Для акций это основывается лишь на том, что есть инфляция, которая  обесценивает прошлое, что приводит к росту ."
    },
    {
      "id": 28029046,
      "author": "P0rt",
      "datetime": "2025-03-11T20:38:51.000Z",
      "text": "Михаил, спасибо за статью. Вы выбираете акции за 14 дней для пятилетнего бэктеста, это как минимум странно."
    },
    {
      "id": 28029450,
      "author": "empenoso",
      "datetime": "2025-03-12T00:47:57.000Z",
      "text": "Я выбираю за 14 дней топ оборота акций по бирже"
    }
  ]
}