{
  "url": "https://habr.com/ru/articles/891786/comments/",
  "article_id": 891786,
  "title": "Тестировании торговой системы со случайными сигналами на вход для фьючерсов Московской биржи при помощи Python",
  "comments": [
    {
      "id": 28057228,
      "author": "nikolz",
      "datetime": "2025-03-19T05:05:06.000Z",
      "text": "По времени: позиция закрывается в 20:40, независимо от результата.Поясните, как выбрали время закрытия?"
    },
    {
      "id": 28057334,
      "author": "empenoso",
      "datetime": "2025-03-19T05:20:40.000Z",
      "text": "Почти никогда не доходит до времени закрытия.T-Инвест предоставляет котировки по UTC. Последняя минутная котировка:db4b4990-0864-4595-a238-c5922723d84b;2025-03-14T20:49:00Z;11.785;11.788;11.788;11.779;1867;"
    },
    {
      "id": 28057350,
      "author": "nikolz",
      "datetime": "2025-03-19T05:33:10.000Z",
      "text": "Это не на Moex, а на внебиржевом рынке?"
    },
    {
      "id": 28058228,
      "author": "nikolz",
      "datetime": "2025-03-19T08:42:01.000Z",
      "text": "Возможно не понял,Но в названии статьи написано:для фьючерсов Московской биржиТ-Инвест - это форекс, т е внебиржевой рынок.В статье какой источник данных? Можно ссылку ?"
    },
    {
      "id": 28058460,
      "author": "tubecleaner",
      "datetime": "2025-03-19T09:36:08.000Z",
      "text": "Ну, тикеры Московской Биржи. Срочные контракты существуют только на бирже, вы не можете торговать ими за пределами площадки (в отличии от акций, например)"
    },
    {
      "id": 28058554,
      "author": "empenoso",
      "datetime": "2025-03-19T09:54:05.000Z",
      "text": "Т-Инвест  - брокер Т-Банка с АПИ:https://russianinvestments.github.io/investAPI/swagger-ui/Их три всего кто с API: Финам, Алор, Т-Банк"
    },
    {
      "id": 28059010,
      "author": "nikolz",
      "datetime": "2025-03-19T11:20:09.000Z",
      "text": "Благодарю за ответы.Запустить Ваш скрипт на питоне не получилось.Торгую в КВИКЕ попробую потестить данный алгоритм на луа в КВИКЕ.Из своего опыта замечу, что большинство тестов заглядывают в будущее так как используют сигналы на тех же ценах, на которых совершают сделки в тесте.Стопы в тестах не учитывают задержку исполнения. Например в вашем тесте у вас задержка на 1 минуту, а у автора аж 5 минут. Полагаю, Вы представляете на сколько обвалится   рынок за это время. При этом торговля фьючерсами это всегда плечо.Если правильно понял, то у Вас допустимо изменение цены 2%, а это не менее 10% убытка.--------------Вы забыли упомянуть, что в QUIK есть VM Lua, которая и реализует прекрасный API для торговли, в том числе и на CИ . Запускаю еще LuaJit, что более, чем в 10 раз быстрее питона и Lua, а так же пул потоков."
    },
    {
      "id": 28059054,
      "author": "empenoso",
      "datetime": "2025-03-19T11:31:13.000Z",
      "text": "Всё таки я старался взять идею автора, а адаптировать свою собственную.То есть это только моё толкование идеи из видео"
    },
    {
      "id": 28059082,
      "author": "nikolz",
      "datetime": "2025-03-19T11:35:22.000Z",
      "text": "Из статьи сложно понять на сколько тест адекватен реальным торгам.И Выше я спрашивал о времени закрытия. Для московской биржи время в 20:40  это уже после начала вечерней сессии, а не конец дневной и тем более вечерней."
    },
    {
      "id": 28059182,
      "author": "empenoso",
      "datetime": "2025-03-19T12:01:27.000Z",
      "text": "Исходные котировки в другом часовом поясе"
    },
    {
      "id": 28061468,
      "author": "empenoso",
      "datetime": "2025-03-20T05:05:36.000Z",
      "text": "Часовой пояс на гитхабе изменил кстати"
    },
    {
      "id": 28057888,
      "author": "nikolz",
      "datetime": "2025-03-19T07:41:30.000Z",
      "text": "Вопрос.У Вас в тесте объединены 3 условия. Но нет никакого обоснования что их сочетание лучше, чем каждое из них. Например, использовать вероятность 50% либо 100%. И непонятно как Вы задаете вероятность и какой при этом закон распределения случайной величины.Вы исследовали эффективность каждого из них и попарное сочетание двух из трех?Можете показать результаты?"
    },
    {
      "id": 28058042,
      "author": "empenoso",
      "datetime": "2025-03-19T08:10:33.000Z",
      "text": "Я проводил только так как описано в тексте.Весь мой код выложен на github.Если у вас возникают вопросы вы можете повторить - код и котировки там доступны."
    },
    {
      "id": 28064774,
      "author": "DonStron",
      "datetime": "2025-03-20T15:51:52.000Z",
      "text": "Интересно, какой смысл в \"Вероятность входа — 50%\". По идее если есть сигнал - нужно входить однозначно. Ну и систему тестировать на этих сигналах-условиях. Если же сигналы дают убыток, значит с сигналами что-то не то. А добавлять условие, что \"если сигнал случился, то подбрасываем монетку входить или нет\" - дичь какая-то. Какой в этом смысл?"
    },
    {
      "id": 28064878,
      "author": "empenoso",
      "datetime": "2025-03-20T16:11:40.000Z",
      "text": "Могу только сказать что автор системы не я"
    },
    {
      "id": 28566102,
      "author": "NeverIn",
      "datetime": "2025-07-13T16:10:48.000Z",
      "text": "14652% за 4 дня ?! Ну-ну…"
    }
  ]
}