{
  "url": "https://habr.com/ru/articles/893006/comments/",
  "article_id": 893006,
  "title": "Поиск ликвидных облигаций с использованием Python",
  "comments": [
    {
      "id": 28085034,
      "author": "dyadyaSerezha",
      "datetime": "2025-03-25T04:24:43.000Z",
      "text": "Есть ли случаи невыплат/банкротства? Какая доходность российских облигаций по сравнению с акциями и с вклада и в банках? Входят ли в ваш список цифровые финансовые активы? (узнал про них недавно, но толком не понял, чем они не облигации). Какая реальная доходность с учётом всех комиссий по сделкам и по вводу/выводу денег со счета? То есть, сколько процентов надо отдать брокеру?"
    },
    {
      "id": 28085070,
      "author": "empenoso",
      "datetime": "2025-03-25T04:42:41.000Z",
      "text": "Это ведь фондовый рынок - конечно, бывают невыплаты и даже дефолты, гарантий нет. Важно изучать эмитента перед покупкой. В мой список входят только классические облигации которые предоставляет API Мосбиржи, цифровые финансовые активы не учитываются. Доходность облигаций зависит от рисков, но в среднем выше вкладов и ниже акций. Комиссии у брокеров обычно небольшие и почти не влияют на итоговую доходность."
    },
    {
      "id": 28085232,
      "author": "dyadyaSerezha",
      "datetime": "2025-03-25T05:21:44.000Z",
      "text": "То есть, если грамотно инвестировать в облигации, то это (почти) так же надёжно, как и вклады, но с большей доходностью. Так? Ведь именно для этого ваша библиотека?"
    },
    {
      "id": 28085244,
      "author": "shornikov",
      "datetime": "2025-03-25T05:28:45.000Z",
      "text": "Если это надежно и с высоким доходом - зачем про ЭТО рассказывать всем и давать инструменты даром (и даже за деньги... Тем-более - за деньги!)?"
    },
    {
      "id": 28085262,
      "author": "empenoso",
      "datetime": "2025-03-25T05:33:21.000Z",
      "text": "Это один из вариантов. Написал для себя инструмент, когда не смог найти готовый и пользуюсь им уже пять лет в разных формах."
    },
    {
      "id": 28085260,
      "author": "empenoso",
      "datetime": "2025-03-25T05:32:24.000Z",
      "text": "В инвестициях нельзя ничего гарантировать - только мошенники дают гарантию."
    },
    {
      "id": 28085272,
      "author": "dyadyaSerezha",
      "datetime": "2025-03-25T05:35:22.000Z",
      "text": "Я где-то упоминал гарантии? О чем вы? Просто объясните, какую цель вы ставите, работая с облигациями?"
    },
    {
      "id": 28085288,
      "author": "empenoso",
      "datetime": "2025-03-25T05:42:31.000Z",
      "text": "Покупаешь и держишь до погашения - вот и вся цель. Если дробить на небольшие суммы, то облигаций много и погашения несколько раз в месяц. На эти деньги снова покупаешь облигации."
    },
    {
      "id": 28085388,
      "author": "tuxi",
      "datetime": "2025-03-25T06:07:06.000Z",
      "text": "Если я правильно понимаю, на облигациях с амортизацией скрипт ломается?"
    },
    {
      "id": 28085500,
      "author": "empenoso",
      "datetime": "2025-03-25T06:36:56.000Z",
      "text": "Нет, он их учитывает. Это вы про вторую часть скрипта?"
    },
    {
      "id": 28086102,
      "author": "tuxi",
      "datetime": "2025-03-25T08:33:18.000Z",
      "text": "Доходность к погашению скрипт сам считает или берет данные с моськи?"
    },
    {
      "id": 28086170,
      "author": "empenoso",
      "datetime": "2025-03-25T08:46:45.000Z",
      "text": "Берёт готовую с API"
    },
    {
      "id": 28086270,
      "author": "tuxi",
      "datetime": "2025-03-25T09:03:49.000Z",
      "text": "Ясно. Там иногда полная ахинея, Особенно в даты выплаты купонов. Я думал скрипт сам считает."
    },
    {
      "id": 28086322,
      "author": "empenoso",
      "datetime": "2025-03-25T09:14:22.000Z",
      "text": "Голословное утверждение. Можете пример привезти?"
    },
    {
      "id": 28086408,
      "author": "tuxi",
      "datetime": "2025-03-25T09:34:02.000Z",
      "text": "посмотрите данные по любой облигации с датой выплаты вчера-сегодня, про оферты (тот же совком с офертой 25 марта) я уже и не говорю"
    },
    {
      "id": 28086416,
      "author": "tuxi",
      "datetime": "2025-03-25T09:35:24.000Z",
      "text": "что показывает апи мосбиржи прямо сейчас по RU000A10A158 ?ps: любой флоатер запросите"
    },
    {
      "id": 28086510,
      "author": "empenoso",
      "datetime": "2025-03-25T09:49:22.000Z",
      "text": "По флоатерам нет информации через API - ими сам и не пользуюсь."
    },
    {
      "id": 28086550,
      "author": "tuxi",
      "datetime": "2025-03-25T09:53:53.000Z",
      "text": "на ПД тоже часто странные данные. Не вижу смысла пользоваться таким АПИ. Есть всякие паблик трейдеры (пока еще не инфоцыгане), которые на облигациях \"сидят\", они ведут таблицы публичные, там прилично лучше информация и по доходности, и оферты они выискивают, много чего есть."
    },
    {
      "id": 28086568,
      "author": "empenoso",
      "datetime": "2025-03-25T09:55:55.000Z",
      "text": "Они вручную собирают. А здесь автоматизированно. Каждый сам решает"
    },
    {
      "id": 28086596,
      "author": "tuxi",
      "datetime": "2025-03-25T10:01:14.000Z",
      "text": "Ну данные же нужны не ради самого факта получения данных, а чтобы картинку объективную иметь."
    },
    {
      "id": 28086666,
      "author": "empenoso",
      "datetime": "2025-03-25T10:15:26.000Z",
      "text": "Моя идея со скриптами очень простая: не хочу тратить время на анализ и вникать. Прогоняешь скриптами из репозитория - если цифры нравятся и нет негатива в новостях - значит мне ничего больше знать и не надо.Я говорю только про себя. Кому-то может быть такая стратегия и не подойдёт."
    },
    {
      "id": 28086790,
      "author": "tuxi",
      "datetime": "2025-03-25T10:34:30.000Z",
      "text": "Вам придется тратить время, потому что детали оферты лучше узнавать как можно раньше, иначе это больше игра в \"купил 5 облигаций, пересижу любые просадки\". Когда речь идет о суммах от 100т на позицию, придется крутиться и быть \"в теме\", АПИ мосбиржи такое не дает."
    },
    {
      "id": 28086856,
      "author": "empenoso",
      "datetime": "2025-03-25T10:43:47.000Z",
      "text": "В скрипте есть параметр, который полностью исключает облигации с офертами"
    },
    {
      "id": 28086536,
      "author": "empenoso",
      "datetime": "2025-03-25T09:52:40.000Z",
      "text": "RU000A10A158 неликвид, неважно насколько хороша эта облигация. Скрипт ищет облигации которые можно купить прямо здесь и сейчас под параметры которые нужны."
    },
    {
      "id": 28086586,
      "author": "tuxi",
      "datetime": "2025-03-25T09:59:28.000Z",
      "text": "сегодня оборот по этой \"газпром капитал\" уже больше 12млн - это точно неликвид?"
    },
    {
      "id": 28086646,
      "author": "empenoso",
      "datetime": "2025-03-25T10:11:42.000Z",
      "text": "12млн это как бы неликвид по сравнению с топ оборотами по облигациям"
    },
    {
      "id": 28086770,
      "author": "tuxi",
      "datetime": "2025-03-25T10:30:56.000Z",
      "text": "так на момент цифры  торги 2,5 часа назад только началисьдневной оборот >10млн по корпоративным - это норм."
    },
    {
      "id": 28130806,
      "author": "cupertino1",
      "datetime": "2025-04-04T05:58:08.000Z",
      "text": "товарищ tuxi, возможно, прав. Я тоже уже встречал мнение одного частного инвестора, специализирующегося по облигациям - Павла Поспелова. Он тоже говорит, что большинство (если не все) брокеры неверно считают доходности."
    },
    {
      "id": 28132582,
      "author": "empenoso",
      "datetime": "2025-04-04T11:23:11.000Z",
      "text": "Это ведь open source - вы можете любой механизм подсчета доходности прикрутить..."
    },
    {
      "id": 28088122,
      "author": "octoMax",
      "datetime": "2025-03-25T14:58:47.000Z",
      "text": "помню \"с пацанами\" в банке запилили аналогичную тулзу (только чуток продвинутее) году так 2003. Правда облигаций тогда было сильно меньше (настольгический коммент)Активное управление портфелем при помощи той программы позволяло держать доходность сильно выше рынка а риск сильно нижеА вот что касается занутства \"а зачем это вы постите\", \"если это надежно\" - блин - щит комментаторы во всей красе :-)"
    },
    {
      "id": 28088640,
      "author": "BOOTor",
      "datetime": "2025-03-25T17:28:49.000Z",
      "text": "Разобрался)"
    },
    {
      "id": 28102052,
      "author": "BOOTor",
      "datetime": "2025-03-28T09:06:31.000Z",
      "text": "Есть проблемы с поиском новостей: у нас в регионе (Новые территории) банят гугл и новости не ищутся. Скажите, есть другие поисковики новостей, выдающие результаты запросов в rss, которые можно прикрутить сюда без излишнего геморроя?"
    },
    {
      "id": 28102396,
      "author": "antonk42",
      "datetime": "2025-03-28T10:03:41.000Z",
      "text": "https://www.bing.com/news/search?q=запрос&format=rss"
    },
    {
      "id": 28102422,
      "author": "BOOTor",
      "datetime": "2025-03-28T10:06:23.000Z",
      "text": "Спасибо! Работает!"
    },
    {
      "id": 28173284,
      "author": "BOOTor",
      "datetime": "2025-04-14T15:17:16.000Z",
      "text": "Не знаю, баг ли, фича, но столкнулся с такой неожиданностью.Сегодня провел поиск по облигациям, выбрал для детального анализа джи-групп 002Р-03 (RU000A106Z38). В сводной таблице поиска указана дюрация 9,3 месяца, хотя на самом деле облигация погашается через полтора года аж в сентябре 2026г. Это я что-то не так понял, или тут действительно ошибка?И есть ли возможность дополнительным условием поиска добавить рейтинг надежности (позволяет ли это АПИ)? Например, рекомендуемый Интерскол КЛС БО-03 (RU000A10ATB6) Банком оценивается как ненадежный..."
    },
    {
      "id": 28184306,
      "author": "empenoso",
      "datetime": "2025-04-17T05:11:26.000Z",
      "text": "Мне было лень самому писать. Можно я приведу разъяснения от ИИ?Этоне ошибка, а отражение фундаментального различия между этими двумя показателями.1. Дата погашения (Maturity Date):Что это?Это конкретная дата в будущем, когда эмитент облигации обязан вернуть вам ееноминальную стоимость(основной долг).Простота:Это самый понятный параметр – просто конечная точка жизни облигации.Пример:Для вашей облигации Джи-групп 002Р-03 (RU000A106Z38) – это сентябрь 2026 года. В этот день вы получите номинал (если не было амортизации или дефолта).2. Дюрация (Duration):Что это?Этосредневзвешенный срокполучения всех денежных потоков по облигации (купонов и номинала), дисконтированных к текущему моменту. Говоря проще, этоэффективный срок, за который инвестор в среднем вернет свои вложенные средства с учетом всех будущих выплат.Ключевая функция:Дюрация – это основной показательчувствительности цены облигации к изменению процентных ставокна рынке. Чем выше дюрация, тем сильнее цена облигации отреагирует на изменение ставок (как вверх, так и вниз).Почему она обычно меньше срока погашения?Потому что вы получаете не только номинал в конце срока, но икупонные выплатыв течение всего срока обращения облигации. Эти промежуточные платежи \"приближают\" средний срок возврата денег.Представьте: получить 1000 рублей через 2 года – срок погашения 2 года.Получить 50 рублей через 1 год и 1050 рублей через 2 года – срок погашения все еще 2 года, но вы уже получили часть денег раньше, поэтомусреднийсрок получения денег (дюрация) будет меньше 2 лет.Исключение:У бескупонных облигаций (zero-coupon bonds) дюрация равна сроку до погашения, так как единственный денежный поток – это выплата номинала в конце срока.Применительно к вашей облигации (Джи-групп 002Р-03):Срок погашения:сентябрь 2026 года (~1.5 года от текущего момента, если сейчас середина 2024).Дюрация:9.3 месяца (~0.78 года).Вывод:Эта облигация, очевидно,купонная. Вы будете получать регулярные купонные выплаты до сентября 2026 года. Именно эти выплаты приводят к тому, что эффективный срок возврата средств (дюрация) значительно короче, чем полный срок до погашения. Дюрация в 9.3 месяца означает, что в среднем ваши вложения \"вернутся\" через этот срок, и что цена этой облигации будет реагировать на изменение процентных ставок так, как если бы ее срок был 9.3 месяца.Резюме для инвестора:Дата погашения:Говорит, КОГДА вы получите назад основную сумму долга (номинал).Дюрация:Говорит, НАСКОЛЬКО чувствительна цена вашей облигации к изменению рыночных ставок и КАКОЙ эффективный срок возврата ваших денег с учетом всех купонов."
    },
    {
      "id": 28184444,
      "author": "BOOTor",
      "datetime": "2025-04-17T06:01:48.000Z",
      "text": "Теперь понял, спасибо! Век живи..."
    },
    {
      "id": 28184310,
      "author": "empenoso",
      "datetime": "2025-04-17T05:15:28.000Z",
      "text": "По поводу рейтингов.Беру всю информацию с Московской биржи а она эти рейтинги не передаёт. Рейтинги можно на сайте ЦБ РФ искать. Но там нет API, а в публичный скрипт парсинг сайта ЦБ РФ я бы не хотел добавлять:ratings.cbr.ru/?formSearh=advanced&ratingName=&inn=7709971326&isin=&koNumber=&dateFrom=&dateTo=&disclaimer=1Ну а для себя там пожалуйста как угодно можно"
    },
    {
      "id": 28184442,
      "author": "BOOTor",
      "datetime": "2025-04-17T06:01:34.000Z",
      "text": "Спасибо!"
    },
    {
      "id": 28202014,
      "author": "Hando76",
      "datetime": "2025-04-21T11:20:31.000Z",
      "text": "При использовании скрипта Автоматический расчёт денежных потоков столкнулся с 2 проблемами:1.      Для упомянутой в статье облигации RU000A1061K1 выдаются только амортизационные выплаты, купонные не выдаются.2.       Для облигаций, у которых больше 20 выплат, выдаются только первые 20 (например, RU000A10B0J3)."
    },
    {
      "id": 28202022,
      "author": "empenoso",
      "datetime": "2025-04-21T11:22:07.000Z",
      "text": "Спасибо.Вторая проблема известная - видимо при PR что-то потерялось. Решается добавлением&start=0&limit=100"
    },
    {
      "id": 28207098,
      "author": "GitVerse",
      "datetime": "2025-04-22T11:58:26.000Z",
      "text": "Привет, это команда GitVerse! Рады видеть тебя в числе участников сезона open source! Ставим лайк твоей статье :)"
    },
    {
      "id": 28207438,
      "author": "empenoso",
      "datetime": "2025-04-22T12:45:47.000Z",
      "text": "Я уже участвую с этой статьёй в вашем сезоне"
    }
  ]
}