{
  "url": "https://habr.com/ru/articles/898174/comments/",
  "article_id": 898174,
  "title": "Когда менять шины: как Python и открытые API помогут избежать ошибок",
  "comments": [
    {
      "id": 28146596,
      "author": "konst90",
      "datetime": "2025-04-08T04:15:57.000Z",
      "text": "А зачем весь этот троллейбус из буханки хлеба?Просто открываем сайт с погодой и смотрим ночную температуру. Все."
    },
    {
      "id": 28146612,
      "author": "Dhwtj",
      "datetime": "2025-04-08T04:28:03.000Z",
      "text": "Я нашёл открытый погодный API, который не требует ни регистрации, ни ключей — всё просто.Редкий случай когда работает без API key"
    },
    {
      "id": 28146640,
      "author": "apevzner",
      "datetime": "2025-04-08T04:39:34.000Z",
      "text": "Своевременная смена шин — это не просто забота о резине, а вопрос безопасности. Зимние шины в плюсовую погоду теряют сцепление и быстрее изнашиваются, а летние на холодной дороге могут стать причиной заноса.Ничего они не теряют.Резину, кстати, рекомендуют менять не реже раза в 5 лет, даже если износ не большой. Там сам по себе материал деградирует.Поэтому если резина - не шиповка и пробег не как у таксиста, выгоднее не менять. Летом сцепление чуть хуже, чем на специализированной летней резине, но не ужас-ужас. И явно уж лучше зимнего."
    },
    {
      "id": 28148030,
      "author": "konst90",
      "datetime": "2025-04-08T09:52:39.000Z",
      "text": "На резине экономить - такое себе."
    },
    {
      "id": 28148042,
      "author": "apevzner",
      "datetime": "2025-04-08T09:54:32.000Z",
      "text": "Если не в ущерб безопасности и комфорту вождения, то почему бы и нет?"
    },
    {
      "id": 28148866,
      "author": "AKudinov",
      "datetime": "2025-04-08T12:21:07.000Z",
      "text": "Мой опыт езды летом на \"зиме\" показывает, что эффективность торможении знаааачительно хуже. Резина настолько мягкая на жаре становится, что как будто \"плавится\", и блокировка колёс наступает значительно раньше, чем на \"лете\". Ну и износ, соответственно, гораздо более интенсивный."
    },
    {
      "id": 28148904,
      "author": "apevzner",
      "datetime": "2025-04-08T12:28:32.000Z",
      "text": "Я, наверное, очень редко торможу в пол. И каждый раз считаю возникновение такой ситуации своей ошибкой"
    },
    {
      "id": 28146650,
      "author": "Alexey_Lapshin",
      "datetime": "2025-04-08T04:42:12.000Z",
      "text": "Неплохой проект для портфолио. Для студента первых курсов.На практике - проще глянуть глазами эти 7 дней прогноза погоды, чем скачивать и запускать какие-то скрипты"
    },
    {
      "id": 28146708,
      "author": "empenoso",
      "datetime": "2025-04-08T04:55:32.000Z",
      "text": "Есть проект и посложнее:Поиск ликвидных облигаций с использованием Python"
    },
    {
      "id": 28146742,
      "author": "gotch",
      "datetime": "2025-04-08T05:09:46.000Z",
      "text": "Для тех, кто не может открыть таблицу с облигациями в quik и посмотреть дату последней сделки или обороты?"
    },
    {
      "id": 28146772,
      "author": "empenoso",
      "datetime": "2025-04-08T05:17:45.000Z",
      "text": "Это не так работает.Лимит минимального числа сделок за каждый из последних 15 дней.Лимит общего объёма сделок за 15 дней."
    },
    {
      "id": 28146816,
      "author": "gotch",
      "datetime": "2025-04-08T05:34:38.000Z",
      "text": "Можно много чего посмотреть, написать интересных скриптов, и т.д. и из буханки действительно получится троллейбус. Можно и 2+2 на калькуляторе сложить, желательно научном - он точнее.Если по бумаге нет сделок в течение дня, а стакан полон или пуст только на половину, это неликвид. Если в стакане есть оба типа заявок, но большой спред - аналогично."
    },
    {
      "id": 28146652,
      "author": "AlexAqA",
      "datetime": "2025-04-08T04:42:25.000Z",
      "text": "Ну посыл автора мне понятен, реклама сових ресурсов и для этого можно написать бесполезный скрипт и слепить статью на хабр.Почему бесполезный? да потому что переобувать машину вы туда-обратно же не будите каждые 7 дней если погода весной не стабильная?А для принятия подобного решения достаточно зайти в ту же яндекс погоду и посмотреть данные по средне-суточной температуре в вашем регионе в разрезе месяцев."
    },
    {
      "id": 28147210,
      "author": "Andrey_Solomatin",
      "datetime": "2025-04-08T06:48:22.000Z",
      "text": "request.get принимает параметры, это читаемей, чем длинная строка с форматированием."
    },
    {
      "id": 28151466,
      "author": "eugene3711",
      "datetime": "2025-04-09T03:28:37.000Z",
      "text": "Понимаю, когда желание написать один из первых скриптов хочется связать с полезным делом, но выносить в публичную сферу свои опасные заблуждения -- вредительство.Зимние шины не для льда и вот это неверно:# Порог ночной температуры, ниже которого считаем, что ещё рано менять шиныthreshold_temp = 1  # градусов ЦельсияЗимние шины нужно менять на летние, когда вы стабильно ездите при температурах +7 С и выше.При температурах ниже летние шины будут дубовые и плохо тормозить. Лучше тут перебдеть и покататься на зимних до того момента, когда температура уже точно не опускается ниже +7 С.Также странно видеть людей на летней резине поздней осенью, когда температуры уже отрицательные, просто нет снежного покрова, а водители на голубом глазу отвечают, что \"дык снега-ж ещё нет, и так пойдёт\""
    },
    {
      "id": 28207334,
      "author": "GitVerse",
      "datetime": "2025-04-22T12:28:15.000Z",
      "text": "Привет, это команда GitVerse! У тебя крутая статья, будем рады видеть тебя всезоне open source. Для этого просто поставь тег \"сезон open source\" – и ты участвуешь :)"
    },
    {
      "id": 28207428,
      "author": "empenoso",
      "datetime": "2025-04-22T12:44:30.000Z",
      "text": "Я участвую в вашем сезоне с другой статьёй:https://habr.com/ru/articles/893006/Или можно сразу несколько статей от одного человека?"
    }
  ]
}