{
  "url": "https://habr.com/ru/articles/909852/comments/",
  "article_id": 909852,
  "title": "Торговый робот без QUIK и Windows: мой путь к Raspberry Pi и Backtrader на Московской бирже",
  "comments": [
    {
      "id": 28326762,
      "author": "excoder",
      "datetime": "2025-05-20T01:45:59.000Z",
      "text": "Ну это всё конечно классно, но что является целью - путешествие или конечный пункт? :) сколько робот зарабатывает-то?"
    },
    {
      "id": 28326776,
      "author": "empenoso",
      "datetime": "2025-05-20T01:59:35.000Z",
      "text": "Хороший вопрос, но ведь это не реклама, для меня пока это путешествие, вот её предыстория:https://habr.com/ru/articles/846938/"
    },
    {
      "id": 28326878,
      "author": "nikolz",
      "datetime": "2025-05-20T03:43:59.000Z",
      "text": "Что скажете об этом варианте:и этом:"
    },
    {
      "id": 28326954,
      "author": "empenoso",
      "datetime": "2025-05-20T04:24:19.000Z",
      "text": "Смотря для чего. Если один скрипт на питоне, то иб/у raspberry pi за 3 т.р. потянет."
    },
    {
      "id": 28327002,
      "author": "nikolz",
      "datetime": "2025-05-20T04:53:55.000Z",
      "text": "Вы предполагаете торговать одной акцией? Если нет, то сколько акций можно торговать на б/у raspberry?"
    },
    {
      "id": 28327072,
      "author": "empenoso",
      "datetime": "2025-05-20T05:17:52.000Z",
      "text": "В моём случае можно легко заменить на тоже место хоть intel nuc установить"
    },
    {
      "id": 28327114,
      "author": "empenoso",
      "datetime": "2025-05-20T05:30:38.000Z",
      "text": "backtesting.py для одной бумаги, Backtrader - для многих."
    },
    {
      "id": 28327890,
      "author": "NutsUnderline",
      "datetime": "2025-05-20T08:22:16.000Z",
      "text": "это же не биткоин - мощность сервера (почти) не коррелирует с количеством добываемых денег. В любом проекте на малину наоборот очень часто появляются желающие сэкономить и запустить его на апельсине. в данном случае было быприкольноужаться до lucky fox."
    },
    {
      "id": 28331682,
      "author": "randomsimplenumber",
      "datetime": "2025-05-21T04:21:29.000Z",
      "text": "lucky fox.Что за зверь? Как stm32 или дороже?"
    },
    {
      "id": 28334868,
      "author": "NutsUnderline",
      "datetime": "2025-05-21T17:25:33.000Z",
      "text": "Скажем так: готовая плата с ethernet на stm32 либо просто мощным stm32 запросто стоит дороже чем fox. При этом там хотя бы и есть miсropyton но как в нее прикрутить все здесь описанное - большой вопрос. lucky fox недорогая и маленькая платка но с полноценным линуксом, дешевле и меньше многих orange pi, не говоря уж про малины."
    },
    {
      "id": 28335450,
      "author": "randomsimplenumber",
      "datetime": "2025-05-21T20:20:06.000Z",
      "text": "luckfoxзабавное ;)"
    },
    {
      "id": 28327018,
      "author": "akakoychenko",
      "datetime": "2025-05-20T04:58:04.000Z",
      "text": "Вот, прямо чувствую, как желание обладать домашним бесшумным сервером в слаботочном шкафу и гордиться этим фактом подтянуло за собой и необходимость вернуться к трейдингу, а не наоборот)Все же, если уже зашла речь о надёжности, то квартира - явно не датацентр, даже, если присутствуют ибп и 2 провайдера.Хотя... помню, на заре алготрейдинга на Forts, были довольно серьёзные алготрейдеры с серьёзными оборотами, которые принципиально запускали робота только из дому. Но там причина другая была: страх, что сервер физически украдут, извлекут жёсткий диск, и скопируют с него грааль, после чего, двум роботам станет тесно на одном рынке, ибо робот забирал практически всю ликвидность по интересующим его ценам в интересующий его момент. Такие люди ещё и специально вбрасывали некий % рандомных сделок вообще от балды, чтобы, если конкурент купит историю его сделок и заявок через крысу в брокерской компании, то затруднить ему реверс-инжиниринг"
    },
    {
      "id": 28327062,
      "author": "empenoso",
      "datetime": "2025-05-20T05:16:33.000Z",
      "text": "Хорошо написали 👍 .Я просто частное лицо, пытаюсь разобраться и найти оптимальный для себя путь."
    },
    {
      "id": 28327036,
      "author": "nikolz",
      "datetime": "2025-05-20T05:03:41.000Z",
      "text": "Конечно, можно было бы рассмотреть аренду виртуального сервера (VPS) в облаке, но это влечет ежемесячные платежи.Вы полагаете, что затраты в 210 руб в месяц это много?"
    },
    {
      "id": 28327052,
      "author": "empenoso",
      "datetime": "2025-05-20T05:14:44.000Z",
      "text": "Нет, но смущает словоежемесячные."
    },
    {
      "id": 28327094,
      "author": "randomsimplenumber",
      "datetime": "2025-05-20T05:25:44.000Z",
      "text": "Есть сомнения, что эта штука отобьёт этинепосильныеежемесячные платежи?"
    },
    {
      "id": 28327100,
      "author": "empenoso",
      "datetime": "2025-05-20T05:28:31.000Z",
      "text": "Нет, это вопрос личных предпочтений"
    },
    {
      "id": 28327098,
      "author": "nikolz",
      "datetime": "2025-05-20T05:27:21.000Z",
      "text": "Можно платить за день 7 руб  или сразу за год 2300 руб.Полагаю, что за одну сделку в день Вы заплатите в разы больше  (некоторые брокеры за сделку берут не менее 45 руб)И еще сравните возможности б/у платы у Вас и CPU VPS.плюс защита от обрыва связи с биржей при отключении света дома или проблем у провайдера и нет кучи проводов в шкафу .Что не так?Полагаю, что ПК дома оправдывает себя лишь при использовании QUIK. Если QUIK не использовать то VPS лучше и дешевле."
    },
    {
      "id": 28327108,
      "author": "empenoso",
      "datetime": "2025-05-20T05:29:26.000Z",
      "text": "Лично мне идея с VPS сейчас не нравится. Это не значит что эта идея плохая"
    },
    {
      "id": 28328126,
      "author": "NutsUnderline",
      "datetime": "2025-05-20T09:05:05.000Z",
      "text": "есть редкие предложения пожизненых vps с разовой платой. это может быть удобно когда задача запускается лишь изредка,  но арендовать и конфигурировать vps когда \"приспичит\"  довольно хлопотно. однако и на постоянку работать почему бы и нет.однако удовольствие не вот дешевое, особенно с 2022 года. один провайдер слился с этой темы. Но когда разовый платеж был эквивалентен помесячным платежам за 3 года то это себя окупало.я пришел к такому решению как раз когда только входил в vps и как подумывал о том чтобы занялся финансами. в каком то роде описные здесь возможности для меня откровение, сервер под винду то стоил бы дороже, в линуксы я уже зашел. а вот в финансы - нет."
    },
    {
      "id": 28331488,
      "author": "KalitaIvan",
      "datetime": "2025-05-21T02:33:19.000Z",
      "text": "Какой-то лютый бред мы ищем место по шкафам и подоконникам какой-то маленькой хрени эффективность которой вообще непонятна... Всё с ног на голову."
    },
    {
      "id": 28331528,
      "author": "empenoso",
      "datetime": "2025-05-21T02:57:26.000Z",
      "text": "Почему вы так озлоблены на всех?"
    },
    {
      "id": 28331690,
      "author": "randomsimplenumber",
      "datetime": "2025-05-21T04:22:43.000Z",
      "text": "маленькой хрени эффективность которой вообще непонятнаХобби, сэр."
    },
    {
      "id": 28335032,
      "author": "NeverIn",
      "datetime": "2025-05-21T18:13:14.000Z",
      "text": "Выглядит странным, что инвесторы-авто торговцы экономят наскрепкахжелезе. Это, конечно, прикольно выжать из железа максимум, но прямого отношения к алготорговле не имеет абсолютно."
    },
    {
      "id": 28336652,
      "author": "empenoso",
      "datetime": "2025-05-22T06:09:42.000Z",
      "text": "Статья скорее размышления про поиски оптимального для меня стека"
    },
    {
      "id": 28337402,
      "author": "randomsimplenumber",
      "datetime": "2025-05-22T08:23:55.000Z",
      "text": "Хобби, ага. Обычно стек подбирают под задачу. Если задача в зарабатывании денег, то чтобы затрат поменьше а выхлопа побольше."
    },
    {
      "id": 28409802,
      "author": "arsvincere",
      "datetime": "2025-06-07T19:22:18.000Z",
      "text": "А как же, когда заработок на алготрейдинге число отрицательное, приходится даже на электроэнергии экономить =)"
    },
    {
      "id": 28406516,
      "author": "arsvincere",
      "datetime": "2025-06-06T20:38:38.000Z",
      "text": "Помоему backtrader медленный и глючный. А Pine вообще не пригоден ни для чего кроме хобби развлечений. В реальных торговых стратегиях тысячи строк кода, опора на статистику, подгрузка этих статистических данных (сотни тысяч строк в датафреймах)... В Pine все это никак. Он позволяет делать вещи только немного сложнее чем пересечение двух скользяшек."
    },
    {
      "id": 28407586,
      "author": "empenoso",
      "datetime": "2025-06-07T08:19:33.000Z",
      "text": "Хорошо. Что вы предлагаете для частного лица и энтузиаста?"
    },
    {
      "id": 28409304,
      "author": "arsvincere",
      "datetime": "2025-06-07T16:56:43.000Z",
      "text": "Ну смотря какая цель. Если просто поиграть, развлечься, попробовать решить сложную задачку \"найти священный прибыльный грааль на бирже\" и убедиться что прибыльную (устойчиво прибыльную, а не на одном каком то активе в какой-то определенный период) страгею создать очень сложно - то Pine - отличная игрушка.Если цель зарабатывать алготрейдингом тут надо глубже капать. Тут не подойдут скрипты на Pine. Тем более что от туда никак не выставить реальные ордера на биржу. И боже упаси пытаться сделать что-то в визуальных конструкторах типо TS Lab.Можно попробовать OS Engine. В русском интернете это лучшее что мне попадалось. Вроде работают на нем люди. Исходники читал github - вроде нормальная штука. Но я даже не включал, он на C# написан, а я его и windows со студенческих времен недолюбливаю, вернее со времен первого прикосновения к linux.В англоязычном есть еще несколько проектов похожих на OS Engine. Наверняка более зрелых и серьезных, не помню названия, если надо - откапаю в истории, но их не подружить с Мос.Биржей. Или сложно подружить. Если, мос.биржа не обязательно, и есть доступ к Interactive Brokers например, то там точно что нибудь найдется. Название одной из таких систем упоминается в книге легендарного Ларри Вильямса, он с ней всю жизнь работал.Вообще все алготрейдеры о которых я слышал, кто зарабатывает, для кого это основное дело -  все писали сами. Разбирались в API брокера, пилили свой тестер... Это годы работы. Нужно 3 аспекта:Нужно стать хотя бы джуниор разработчиком.Нужно знать высшую математику.Нужно понимать в трейдинге и быть прибыльным трейдером (руками).То есть это нифига не легкий путь. Не \"ща я тут все\", не получится за несколько месяцев состряпать стратегию, откинуться на спинку кресла и смотреть как бабло капает автоматом. Ни-фи-га. Годы упорной работы. И постоянно. С годами рынки меняются, постоянно надо будет придумывать новые стратегии. И если с трезвым пониманием этого подойти к вопросу, то не надо тогда искать простые пути, тогда сразу понятно что только хардкор, только постоянная учеба. Эмпирическая цифра среди алготрейдеров - 2000 часов работы над стратегией перед первым успехом  в этом деле / 8 часов = 250 дней.Если планируется работа на периодах меньше 1 минуты, и на тиковых данных и стакане - то сразу на старте забываем про Python, Java. Подсказка - без тиковых данных и стакана, на одних свечах, прибыльную стратегию построить, если еще и можно в современном мире, то очень сложно. А если не тики и стакан - то фундаментал, тогда парсить новости, ранжировать позитивность/негативность новости, парсить соц.сети... и эту информацию включать в работу стратегии.Промежуточный вариант - наверное можно с Quik и QLua что то сделать. Уж точно больше чем на Pine. Но опять же... скриптовый язык, низкая скорость. Нет это не профессиональный алготрейдинг. Но вроде работают люди. Советник по крайней мере точно получится.С другой стороны к квику можно делать конекторы. Можно соответственно написать свою аналитику на чем угодно и как угодно, и избежать работы с апи брокера передавая в квик результаты, чтобы он ордера выставлял... Но тоже так себе план. На самом деле разобраться с апи брокера и прикрутить к своей системе это неделя работы максимум. То есть не стоит так уж много выиграешь на этом пути. А когда сам делаешь - полный контроль, максимальная гибкость."
    },
    {
      "id": 28409370,
      "author": "arsvincere",
      "datetime": "2025-06-07T17:21:35.000Z",
      "text": "Python, TA-lib, pandas, mathplot - уже хорошо.Я бы вместо mathplotlib посмотрел на plotly, ибо сильно красивее, удобнее, гибче... и масштабируются. А вместо pandas можно посмотреть на polars. Тоже самое, но работает раз в 10 быстрее. И интерфейсы мне его больше нравятся, но это вкусовщина. Но пандас проще - в интернете куча вопросов и ответов по нему, по polars меньше, придется больше читать документацию, по первой ссылке в гугле не всегда ответ есть. Если не надо работать с тиками то скорости pandas хватит за глаза.И в JupyterLab загляни. Данные удобнее всего анализировать в нем. Эти scientific notebooks для этого и изобрели. И Pine не понадобится когда свободно будешь пользоваться polars и plotly."
    },
    {
      "id": 28409778,
      "author": "arsvincere",
      "datetime": "2025-06-07T19:15:24.000Z",
      "text": "И реальные стратегии этот как раз много вычислительных мощностей, а не Raspberry. У меня подготовка и анализ данных делается часами по 1 тикеру. Сутками жду результатов по 30 тикерам за которыми слежу. И я еще только начал... Там еще только по 100мб аналитики на актив в parquet. Дальше будет больше. Читать их каждый раз при приходе новой свечи - медленно. Кэшировать... сколько там ОЗУ у этой Raspberry? В реал-тайм работе стратеги по 1М по 1 тикеру Raspberry конечно хватит за глаза. Но это нереалистично... нужно следить за сектором в целом, за рынком в целом, за корреляциями, за индексами... а Т например индексы не раздает, значит его тянуть с другого брокера или с веб сокета мосбиржи. А если 10-20-30 тикеров мониторишь, а если с тиками которые прилетают десятки раз в секунду... И подгрузить по ним по всем пару гигов аналитики... Все, приплыли, конец Raspberry. На 8 ядрах и при том что большая часть работы скинута ра polars который написан на Rust, и распараллеливает вычисления под капотом - еще более можно было жить в Python с 30 тикерами параллельно.Нельзя сделать стратегию изолированно в вакууме не 1 тикере и на часовике. Бэктестер в помощь, чтобы убедиться. Сотни алготрейдеров годами перебиравших комбинации индикаторов, с оптимизациями градиентными спусками, подтвердят - невозможно."
    },
    {
      "id": 28409790,
      "author": "arsvincere",
      "datetime": "2025-06-07T19:18:14.000Z",
      "text": "Кстати графики TradingView можно задружить с Python. Работать будет ооооочень медленно. Бесплатная отрытая версия TradingView графиков сильно порезана по функционалу. А python биндинги к нему еще сужают, не весь функционал покрывают. Но как временное решение, на первое время... Уже можно более серьезные вещи считать и визуализировать чем в Pine."
    }
  ]
}