{
  "url": "https://habr.com/ru/articles/912528/comments/",
  "article_id": 912528,
  "title": "Отбор акций Мосбиржи для Backtrader: загрузка истории через библиотеку Игоря Чечета и её поквартальный анализ на Python",
  "comments": [
    {
      "id": 28358436,
      "author": "arsvincere",
      "datetime": "2025-05-27T10:09:56.000Z",
      "text": "Любой трейдер который торгует на бирже хотя бы пол года уже точно разбирается какие инструменты ликвидны. И список топ 7 или топ 10 будет плюс минус одинаковым в любом квартале, и даже в любой день. И вместо столь обширного исследования достаточно отсортировать активы по объему торгов за один день и получить в списке теже SBER, LKOH, ROSN, GAZP, VTBR и тп.И вообще вопрос ликвидности, и ее влияние на стратегии возникает только если интрадей стратегии с объемами больше 10млн в день по 1 активу прокручивать. Тогда в первом эшелоне начинается хоть какое-то проскальзывание по 0.1-0.3%. А если депозит меньше 1млн (что у большинства интрадейщиков) то на проскальзывание можно вообще внимание не обращать, несущественная погрешность.А если стратегия подразумевает удерживание позиций по несколько дней то тут вообще с объемами меньше миллиардов никаких проблем с ликвидностью.Очередная бессмысленная статья на тему трейдинга и алготрейдинга."
    },
    {
      "id": 28361084,
      "author": "empenoso",
      "datetime": "2025-05-28T01:29:21.000Z",
      "text": "Критика это скорее хорошо, спасибо за мнение"
    },
    {
      "id": 28361102,
      "author": "empenoso",
      "datetime": "2025-05-28T01:50:50.000Z",
      "text": "У вас есть все шансы показать как делаются содержательные и очень полезные статьи на тему алготрейдинга. Сможешь?"
    },
    {
      "id": 28406354,
      "author": "arsvincere",
      "datetime": "2025-06-06T19:52:50.000Z",
      "text": "Одно время вел сайт и кое-что писал, сейчас он не доступен. Перезагрузка и переосмысление. Начинал писать о книгах по трейдингу, об анализе данных, и простой курс по питону с уклоном для алготрейдеров.Сейчас думаю. Не знаю. В русско язычном интернете вообще почти пусто. Вторичные около алготрейдерские темы освещать не интересно. Выкладывать и разжовывать свои прибыльные стратегии это понятно никто не будет. Писать о находках в анализе данных - тоже чет не хочется делиться фичами над которыми работал неделями. Обмен идеями в личку - да. А просто вещать в интернет - нет. Вот и получается - не понятно о чем писать.В англоинтернете хоть что-то попадалось: списки полезных python библиотек, видосы с анализом данных - довольно общие, и там еще очень далеко до реальной стратегии на его основе, но интересно было, новые идеи появляются.Я делаю библиотеку для алготрейдинга на Rust, open-source. Когда доделаю можно будет о ней написать. Каждый алготрейдер, так или иначе, решает для себя задачи: получения и обновления исторических данных, проверки торговых гипотез, коннекторы к брокерам, логику управления торговыми стратегиями, построение отчетов. На разработку подобных велосипедов уходит от пары месяцев до нескольких лет, смотря как делать. Когда начинал пару лет назад не нашел в интернете ничего подобного. Потом уже видел backtrader, os engine, примеры роботов у Тинькофф...Сначала на Python сделал, довольно много уже сделал, 40к кода было, GUI на PyQt6. Кое-что уже было не плохо. Например в backtrader просмотр результатов на графиках mathplotlib - это вообще издевательство, не видно же нифига. У меня уже было сделано получше, на QGraphicsScene, с масштабированием, быстрым переходом по трейдам, фильтрами, возможностью добавить любые индикаторы на этот же график с результатами теста. Когда дошел до работы с тиками стало понятно - Python тут не потянет. Решил полностью переписать на Rust.На данный момент сделано:- загрузка и обновление данных с мосбиржи (более удобная обертка над moexalgo) с раскладываением данных по папкам.- примитивный, но очень быстрый бэктестер.- шаблон (базовый класс) для написания своих стратегий.- конектор к Тинкофф (Т-банк)- начал делать GUI терминал на eframe/egui. Я делаю свои индикаторы и статистический анализ данных, хочется иметь результаты перед глазами во время торговли в ручную. Там нестандартные визуализации, такое в TradingView не сделаешь например, а отдельный советник не устраивает, пошел по долгому пути.Документацией и стабильным API пока не пахнет. Так что не пригодно для использования кем то кроме меня. Но если кто-то подумывал о чем то аналогичном и еще не начал делать, можно подумать в сторону делать вместе. Я открыт к общению на тему. А репозитарий тут:https://github.com/arsvincere/avin"
    },
    {
      "id": 28423950,
      "author": "empenoso",
      "datetime": "2025-06-11T04:55:12.000Z",
      "text": "Вам бы свою статью написать - это помогло бы привлечь единомышленников."
    },
    {
      "id": 28426480,
      "author": "arsvincere",
      "datetime": "2025-06-11T13:10:47.000Z",
      "text": "Я планирую. На своем домене писать - это значит полтора читателя. На хабре - тогда нужно придумать тему, чтобы это была не просто реклама, и не проходная статья на 1к читателей. Возможно когда доделаю CLI интерфейс к утилите загрузке данных можно будет о ней написать, когда это уже будет пригодный для других пользователей продукт.Можно попробовать написать о том, что алготрейдинг вообще начинается с анализа исторических данных. Сделать подборку библиотек, инструментов. Какие то примеры... Ну могу например поделиться простым анализом - относительных размеров баров, приближенным к человеческому восприятию (типо маленький, большой, средний), на основе Cummulative Distrubution Function, хорошо получается классифицировать.В целом, рано еще. Сейчас в приоритете - доделать перенос всех Python наработок на Rust. Может в следующем году. Пока единомышленников привлекать особо не к чему, код сырой. Если только только такой же одержимый фанат как я попадется, кто будет по 8 часов 250 дней в году кодить без профита на данном этапе.Но в какой то мере, по маленьку я уже начал. Вот в коментариях уже свечусь, на githube \"объевление\" написал в readme. В прошлом году и этого не было, может зря... Python версию 3 форка было, может сконтачились бы, если тогда написал обращение.Именно по алготрейдингу на хабре я все просмотрел, буквально 3 статьи хоть как то более менее... про HFT-шника историю о том как оно было, про попытку обучить нейронку угадывать направление следующего бара, и про визуализации тиковых данных. И судя по остальным статьям и комментариям под ними - алготрейдеры тут не тусят. Но мимоходом, читая что-нибудь о программировании могут забрести, или в начале пути, в поисках хоть какой-то информации в рунете, кроме бреда на ютубе. Попробую закинуть тут удочку."
    },
    {
      "id": 28428586,
      "author": "empenoso",
      "datetime": "2025-06-12T05:38:47.000Z",
      "text": "Не тусят. Напишите текст и опубликуйте его одновременно на Хабре и на Смартлабе - соберёте больше содержательных отзывов перемешанных вместе с критикой :)"
    }
  ]
}