{
  "url": "https://habr.com/ru/articles/922148/comments/",
  "article_id": 922148,
  "title": "У меня три календаря и одна жизнь: как я перестал быть курьером между женщинами",
  "comments": [
    {
      "id": 28515342,
      "author": "RichardMerlock",
      "datetime": "2025-07-02T00:33:15.000Z",
      "text": "Жизнь по расписанию - это дикость! Оплачиваемый труд по расписанию - ОК. Но еще три работы, а спокойно пожить-то когда? \"Каждый занят своей жизнью\" - вот и отлично, а совместные дела можно обсудить и без всяких планировщиков. Нафиг-нафиг-нафиг."
    },
    {
      "id": 28515376,
      "author": "Kwisatz",
      "datetime": "2025-07-02T01:16:19.000Z",
      "text": "Вы не правы, все наоборот. Календарь это способ снять нагрузку, вам не нужно помнить, нет лишних нервов, нет забывашек, неприятных моментов, вы все везде успеваете. Единственное что нужно - приучить себя заносить.Я такие разговоры уже вел десятки раз с руководителями разных уровней на протяжении 20 лет. У них постоянный цейтнот, потери репутации, аврали изза забытых дел, но взять и записат в ежедневник на конкретный день - неее, что вы. Мне хватило раз 10 попасть жир ногами с делами которые были запланировали за долгое время (и не обсуждались до наступления даты), чтобы я сделал выводы. Потом правда еще настрадался с забытыми днями рождения, раз 100. Теперь все в гуглокалендарь."
    },
    {
      "id": 28548514,
      "author": "RichardMerlock",
      "datetime": "2025-07-09T09:46:18.000Z",
      "text": "Ну у вас всё же основным идет контроль рабочих событий, а уж потом личных. А так как ни крути, на работе жизни нет, личной нет, есть только рабочая, а это совсем не то, то... рабочий календарь оправдан, а жизнь по календарю не особо, разве что как напоминалки, сковывает, знаете ли. Да и то, если вы не помните каких-то дат, то они по факту не особо-то и интересны вам. Не помните дней рождений? Да вы их и не ждёте значит. Ну и в том же духе."
    },
    {
      "id": 28515378,
      "author": "empenoso",
      "datetime": "2025-07-02T01:17:16.000Z",
      "text": "Условно: есть плановая запись к врачу - её может создать один из родителей, но второй даже не узнает - а так календарь. Прозрачно"
    },
    {
      "id": 28515402,
      "author": "empenoso",
      "datetime": "2025-07-02T01:26:46.000Z",
      "text": ""
    },
    {
      "id": 28515636,
      "author": "killeralex",
      "datetime": "2025-07-02T04:23:40.000Z",
      "text": "Школа куколдов. А за автоматизацию - респект"
    },
    {
      "id": 28515726,
      "author": "empenoso",
      "datetime": "2025-07-02T05:06:39.000Z",
      "text": "Это-то здесь причём?"
    },
    {
      "id": 28561650,
      "author": "DagothNik",
      "datetime": "2025-07-12T13:14:53.000Z",
      "text": "А участвовать в жизни сына от прошлого брака - это куколдизм? Или надо его силой у матери отнять, чтоб психику покалечить? Да и себе кучу нервотрепок устроить, в процессе выяснения отношений через суд. Странные суждения у Вас, голубчик."
    },
    {
      "id": 28519628,
      "author": "aleksandy",
      "datetime": "2025-07-02T19:01:01.000Z",
      "text": "Не взлетит.Прошу прощения за грубость, но, как мне видится, варианта, когда вся эта порнография будет работать только 2:Жёны и сын такие же поехавшие на календарях и планировании как и автор.Автору абсолютно насрать на мнение остальных, и всё взаимодействие с собой он строит через календарь. Нет в календаре - автор ничего не делает."
    }
  ]
}