{
  "url": "https://habr.com/ru/articles/925018/comments/",
  "article_id": 925018,
  "title": "Нейросети как консультант: как я нашел и заказал ПК без подсветки для локальной работы с ИИ",
  "comments": [
    {
      "id": 28542396,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-08T01:27:47.000Z",
      "text": "Ну, я тоже железо для домашнего сервера с помощью нейросети заказывал, но только воспользовался штатной, в голове.Определил для себя платформу, где достаточно ядер на процессоре и все они полноценные - AM5С учётом предыдущего опыта решил, что 24 vCPU мне хватает, но процессор желателен похолоднее, дабы шумел меньше - выбрал 9900X (чуть дороже) против 7900X. Примерно 45 килорублей.Загуглил мамки, что гарантированно умеют в ECC. Asus X670P CSM - так сказать, почти люкс из коллекции прошлого сезона. Порядка 26 килорублей.Посмотрел - какие наибольшие по объему DDR5 модули с поддержкой ECC сейчас доступны в местных магазинах - выбрал 4 штуки Kingston 48Gb@5600 (самый дорогой пункт покупки - чуть меньше 130 килорублей)Взял первый попавшийся кулер (DeepCool AG400) с расчётным TDP в полтора раза больше, чем у CPU, который не очень ругали в обзорах. За 1.5 килорубля.Корпус, видюха, SSD, винты и БП остались от старой конфигурации.Глянул - кто из местных контор готов мне это всё привезти до дома за вменяемое время и деньги.Собрал всё в кучку и запустил (ОК, тут я лоханулся и потратил почти день, ибо конфа не запускалась, пока не сообразил, что мамка конца 22 года выпуска, хоть и новьё со склада, а процессор только в 24ом появился - стоило прошить свежий биос, как всё заработало)Суммарно потратил 200 килорублей и полтора дня на то, чтобы определиться с конфигурацией, заказать комплектующие и собрать их ручками.P.S. Компы собираю редко и только для личных нужд последние лет 10. А \"чужим\" консультантам малость не доверяю, дабы не втюхали залежавшийся неликвид за 100500 денег."
    },
    {
      "id": 28542402,
      "author": "empenoso",
      "datetime": "2025-07-08T01:35:01.000Z",
      "text": "Дороже вышло"
    },
    {
      "id": 28564498,
      "author": "werter_l",
      "datetime": "2025-07-13T08:39:39.000Z",
      "text": "На интеле нынче не комильфо собирать после историй с уязвимостями (фикс есть, но он программный и падение произ-ти в Win может достигать 50%) и E-ядрами.Нынче amd 7ххх+ серий оч приличны."
    },
    {
      "id": 28542408,
      "author": "empenoso",
      "datetime": "2025-07-08T01:39:33.000Z",
      "text": "А для чего используете? Насколько прирост скорости вышел?"
    },
    {
      "id": 28542448,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-08T02:20:59.000Z",
      "text": "Там совмещённая домашне-рабочая лаба (я на удалёнке сижу).В общем, несколько виртуалок, бОльшая часть из которых - ноды Proxmox VE кластера + VM Proxmox Backup Server (этакая локальная копия рабочего Proxmox-кластера, над которой не так страшно экспериментировать)Внутри Proxmox-кластера крутятся ещё десяток-другой виртуалок (сайты, вики, почта, прочие домашние сервисы). Да, вложенная виртуализация, но работает шустро и беспроблемно. Плюс, за счёт проксмокса удобное управление виртуалками, их снапшотами и бэкапами.Старая мамка на X470 чипсете + 128GB DDR4 ECC + 5900X ушла на игровой комп с 7900XT, на котором по совместительству ещё и ComfyUI со всякими кобольдами крутятся. Правда, игры/кобольд под виндой, а Comfy под Fedora. Кобольдом почти не пользуюсь, а вот картинки рисовать мне понравилось - Flux и Chroma вышли прекрасной заменой моим кривым ручкам и извращённому мозгу.По скорости, скорости мне и раньше хватало, но я переживал, что 128 гигов на сервере только-только. Запас оставался, но совсем небольшойА тут, как назло, один из домашних компов скончался (второй игровой), что и запустило цепочку апгрейдов. У меня правило - самое мощное железо (кроме видюхи) на сервере, дальше первый игровой, дальше второй игровой (для остальных членов семьи)."
    },
    {
      "id": 28542548,
      "author": "dyadyaSerezha",
      "datetime": "2025-07-08T03:53:58.000Z",
      "text": "дальше первый игровой, дальше второй игровойПервому игроку приготовиться (с)"
    },
    {
      "id": 28544170,
      "author": "8street",
      "datetime": "2025-07-08T10:05:02.000Z",
      "text": "Взял первый попавшийся кулер (DeepCool AG400) с расчётным TDP в полтора раза больше ...  За 1.5 килорубля.Вот тут ошибка. Очень сомнительный кулер за 1,5 т.р. Его TDP замеряли, наверняка при условии полного погружения в проточную воду при температуре 0 градусов. А процы от AMD любят очень хороший охлад и TDP 120 Вт это в режимах без буста.У меня 7700x и чувствуется, что Dark rock pro 4 с его 250 Вт справляется на пределе. При условии, что я делал тихую сборку и вентили в режиме Silent."
    },
    {
      "id": 28544232,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-08T10:14:39.000Z",
      "text": "Ну, у меня сервак, так что, во-первых, все разгоны отключены, а, во-вторых, как-правило, нагрузка по всем ядрам оптом бывает крайне редко. Вот прям сейчас кажет что-то около 63 градусов.Не, я согласен, что кулер примитивный. Но в момент покупки выбор был так себе, чтобы привезли быстро, а не с ожиданием в месяц. Поэтому взял как эксперимент - потянет - отлично, не потянет - другой куплю. Жалею, что не смог пока придумать как Lucifer 2 на am4/am5 прикрутить. Очень давно попадались адаптеры, но по цене чуть ли не самого люцифера, да и не нужно оно мне тогда было."
    },
    {
      "id": 28545082,
      "author": "Vedomir",
      "datetime": "2025-07-08T13:03:13.000Z",
      "text": ">А процы от AMD любят очень хороший охладПроцы от AMD очень любят небольшое поджатие температур и потребления после чего они легко сбрасывают градусов 30 температуры теряя 2-4% производительности.Слишком агрессивный заводской переразгон и то вроде в 9000 серии уже это поправили.7700x вообще смысла не имеет, надо брать либо 7700 который точно также на считанные проценты отличается и намного холоднее, либо что-то постарше с 3Д-кешем или большим количеством ядер.  Говорю как его владелец, на момент сборки компа просто не было в продаже альтернатив толковых ни 7700 ни 7800X3D."
    },
    {
      "id": 28617168,
      "author": "NeraDail",
      "datetime": "2025-07-24T20:02:05.000Z",
      "text": "почему ECC?"
    },
    {
      "id": 28628528,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-28T11:36:18.000Z",
      "text": "На \"взрослых\" серверах оно мне не раз от проблем спасало, когда планка не глючит явно, а так, раз в неделю или месяц сбой даёт. Поэтому я уже лет 10-15 на свои домашние неигровые машины ставлю ECC и в ус не дую. Но, да, приходится мамки чуть подороже ставить и процессоры тоже с поддержкой ECC.Зато не задумываюсь почему у меня где-то вдруг сбой случился - очень многое при наличии ECC можно отбросить сразу, просто глянув логи."
    },
    {
      "id": 28629572,
      "author": "rPman",
      "datetime": "2025-07-28T15:11:49.000Z",
      "text": "При суммарном сотне гигабайт оперативной памяти, вероятность сбоя в год - единицы событий (чем выше врсия памяти тем чаще, условно ddr2 - 2события, ddr5 до 10-ка).У вас есть собственная статистика, как часто у вас сбои машин были из-за ошибок памяти?Разница в стоимости non-ECC и ECC значительные, до тысячи баксов может доходить (память дорогая, да и материнки сильно в выборе ограничены, не говоря о проблемах их получения в россии)"
    },
    {
      "id": 28630996,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-29T00:51:02.000Z",
      "text": "К сожалению (или к счастью) случаев было не так много, чтобы считать это статистикой. Для статистики нужны тысячи серверов, а у меня редко больше сотни за раз под крылом бывало.Например, один сервер HP с неудачной планкой, так сбои там были регулярны - раз в 3-4 недели, причём памяти там было совсем немного по нынешним временам (сейчас во многих игровых компах в разы больше).На другом HP просто одна из ранее нормальных планок вдруг отправилась в Вальгаллу (она опознавалась как память, но там были сплошные сбои). Были единичные случаи на Dell'ах (там случайный неповторяющийся сбой без явного повода).Так что, в основном, не космические лучи, а банальная неисправность компонентов. Но зато я чётко знал - сдохла именно память, такая-то планка на таком-то канале (а сервер, пусть и в аварийном режиме, но таки продолжает работу).Вот, кстати, на последней домашней машине. По умолчанию, память, все 192Гб, запустилась, но на весьма низкой скорости (что-то типа 3600, при номинале для этих планок в 5600). Можно вручную скорость поднять, но насколько?Стандартный вариант - поднять на какую-то ступеньку, а потом сутки-двое елозить memtest'ом, в надежде понять - можно повышать ещё, или уже перебор? Долго и не факт, что все сбои выловишь.При ECC на рабочей машине достаточно просто глянуть через edac-utils - чего там с ошибками происходит. Этакое тестирование в фоне, не прерывая работы :)"
    },
    {
      "id": 28631110,
      "author": "rPman",
      "datetime": "2025-07-29T02:49:56.000Z",
      "text": "глянуть через edac-utils - чего там с ошибками происходитМожно вручную скорость поднять, но насколько?Т.е. с помощью этой утилиты можно эффективно разгонять память? мне казалось ECC только проблемы с четностью данных решает, но неверные тайминги по другому на работу памяти влияют вроде, возможно питание подкручивать будет проще,.. хотя какой проще, перезагружаться так и так надо"
    },
    {
      "id": 28631390,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-29T05:13:50.000Z",
      "text": "По крайней мере, используя драйвер от edac-utils, можно быть более-менее уверенным, что не загнал память в запредельные для неё режимы и, что пока ошибок по памяти нет. В общем, получаем эдакий memtest в фоне, который работает всегда и никому не мешает.Ну и, заодно, точно знать, что у тебя ECC поддерживается и включено :) В моей мамке биос в режиме \"auto\" тупо наглухо отрубал ECC вовсе, пока я не указал \"enabled\". Я всё понять не мог, чего edac-utils свой модуль ядра активировать не хотел. Вот кто бы знал..."
    },
    {
      "id": 28643294,
      "author": "edo1h",
      "datetime": "2025-07-31T07:52:06.000Z",
      "text": "на какой частоте в итоге работает память? у меня самсунг 32@4800, в двухканале работает на 4800, но ошибки ecc сыпятся.из того, что в одноканальном режиме ошибок нет, я делаю вывод, что проблема в контроллере памяти в процессоре.пробовал несколько процессоров (7700 и два экземпляра 9950x), несколько материнских плат (все asus на b650, хотя чипсет тут влиять не должен; 6 и 8 слоёв) — особой разницы нет."
    },
    {
      "id": 28643576,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-31T08:35:19.000Z",
      "text": "4600 - всё идеально, ошибок по ECC нет. 4800 - система запускается, но пускается необычно долго и сильно тормозит. Ошибки я и проверять не стал :)Не, я допускаю, что если поиграться с напряжением на память/таймингами/чем-там-ещё, то на ступеньку-две выше я смогу забраться, но... Не та система, чтобы возня с памятью ощутимо подняла производительность запускаемых программ (скорости мне и так за глаза).Плюс, я не уверен, что безрадиаторные модули (интересно, бывают вообще современные серверные модули памяти с радиаторами?) положительно отнесутся к повышению питающего напряжения.P.S. Биос с распоследней(?) AGESA."
    },
    {
      "id": 28644062,
      "author": "edo1h",
      "datetime": "2025-07-31T10:09:11.000Z",
      "text": "У меня промежуточные частоты вообще менее стабильно работают, или 3600 из спеков процессора или 4800 с корректируемыми ошибками по несколько штук в час."
    },
    {
      "id": 28542410,
      "author": "apevzner",
      "datetime": "2025-07-08T01:45:09.000Z",
      "text": "Процессор i5-14400FОн ничем почти не отличается от 13400F, а стоит на 3 тышши дороже.Вообще, я б не был бы так уверен, что кто-то учит ИИ разбираться в актуальном железе - оно довольно быстро меняется."
    },
    {
      "id": 28542704,
      "author": "aik",
      "datetime": "2025-07-08T05:06:54.000Z",
      "text": "В 13 серии было много брака. Потому брать что-то другое вполне логично. Правда, надо это осознавать. А так-то по цене/производительности и 12 серия до сих пор нормально смотрится. И, в случае необходимости сэкономить и нежелании брать амд, я бы взял 12400f, благо в 1700 сокет можно 12-14 втыкать. А вот материнку да, брал бы с ддр5. Вообще, мать - это основное на чём не стоит экономить. Лучше даже целерон взять, но материнку перспективную, а не прошлого поколения. Проц докупите через пару-тройку месяцев, а мать менять - это всегда головная боль."
    },
    {
      "id": 28542712,
      "author": "empenoso",
      "datetime": "2025-07-08T05:09:03.000Z",
      "text": "Да мне тоже написали на другом форуме что тринадцатое четырнадцатая серия не стоило брать.Но гарантия год, год пройдёт и процессор можно другой купить"
    },
    {
      "id": 28543938,
      "author": "apevzner",
      "datetime": "2025-07-08T09:29:09.000Z",
      "text": "Я так понимаю, брак 13-й серии заключается в том, что некоторые экземпляры слишком быстро деградируют, если всё время горячие.Но тут я бы сказал, что 1) младшие модели, типа 13400, вероятно меньше страдают от этой проблемы 2) вентилятор должен быть хороший и надо следить, чтобы он пылью не забивался."
    },
    {
      "id": 28544620,
      "author": "empenoso",
      "datetime": "2025-07-08T11:26:38.000Z",
      "text": "Спасибо"
    },
    {
      "id": 28542442,
      "author": "fujikiriku",
      "datetime": "2025-07-08T02:12:59.000Z",
      "text": "Про кнопку включения, конечно, было неожиданно. Откровенно не представляю зачем она может быть нужна, впрочем у каждого свои надобности. Я вот, в похожей конфигурации, добавил com-порт, узнав что на материнке есть под него слот."
    },
    {
      "id": 28542450,
      "author": "corvair",
      "datetime": "2025-07-08T02:24:28.000Z",
      "text": "А я вот по тихой увлекаюсь ретро железом, поэтому прикупил материнку с PCI разъёмом, параллельным и последовательным портами. И вдобавок ещё и зелёный текстолит и чёрные разъёмы сзади. И естественно все современные возможности типа M.2. Называется оно ASUS Pro A520M-C II. Теперь нужен хороший старомодный бежевый корпус.Оказывается, плату купил дороговато, с момента покупки она заметно подешевела :)."
    },
    {
      "id": 28542460,
      "author": "empenoso",
      "datetime": "2025-07-08T02:33:37.000Z",
      "text": "Выносная кнопка выключения для того чтобы не наклоняться под стол чтобы включить компьютер.Да, я знаю что можно настроить включение компьютера через нажатие на клавиатуре, но у меня беспроводная клавиатура через USB так что такой вариант мог не сработать."
    },
    {
      "id": 28542862,
      "author": "Popadanec",
      "datetime": "2025-07-08T05:53:42.000Z",
      "text": "Зависит от того как именно она беспроводная. Синезуб, да, только выключить. Хотя свежие версии блютуза, говорят поддерживают соединение без загрузки ОС, но не тестировал.У меня клава блютуз, мышка радио. Выключаю клавой, включаю мышкой. Работает такой вариант много лет, удобно и надёжно. А сам ПК в паре метров, рука не дотянется."
    },
    {
      "id": 28543004,
      "author": "hollycon",
      "datetime": "2025-07-08T06:21:17.000Z",
      "text": "Можно настроить wake-on-lan и включать пк с телефона находясь в одной с ним сети. Из побочных плюсов - пк включать с роутера, допустим находясь на работе или удаленно. Я так тот же проксмокс включаю с работы или торрентокачалку."
    },
    {
      "id": 28860784,
      "author": "mydigitalhabb",
      "datetime": "2025-09-20T13:09:35.000Z",
      "text": "Умная Wi-Fi розетка позволит и включить компьютер (Boot on power on в BIOS), и перезагрузить, и даже удалённо посмотреть статус нагрузки по количеству ватт.А сами кнопки Power и Reset отключил от материнки, чтобы годовалый ребёнок не нажимал, играя, а то были случаи."
    },
    {
      "id": 28542466,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-08T02:44:53.000Z",
      "text": "А у меня не питание, но выносной пульт от монитора на проводе болтается. \"Нормальных\" мониторов на момент покупки в продаже не было, купил геймерский со всякими прибамбасами.Системника два, монитор подключён к обоим. Так вот,  с пульта, как оказалось, в разы удобнее между компами переключаться, нежели тянуться к джойстику на задней панели монитора и долго прыгать по менюшкам. А тут два нажатия кнопок и нужный видеовход выбран."
    },
    {
      "id": 28632620,
      "author": "Moog_Prodigy",
      "datetime": "2025-07-29T09:41:05.000Z",
      "text": "У меня системник стоит мордой к стенке, и включать-ресетить его ой как неудобно. Я себе сделал самодельные кнопки включения и ресета, взял заглушку, просверлил ее и воткнул туда ламповые кнопки типа КМ1-1. Теперь вполне удобно.  Плюс тумблеры последовательно к каждой кнопке (для гарантированного ненажатия), плюс пару светодиодов - power on и активность дисков. Про то, что подобное готовое продается я не знал, даже и мысли не было такой) Впрочем получилось еще лучше."
    },
    {
      "id": 28633218,
      "author": "empenoso",
      "datetime": "2025-07-29T11:34:52.000Z",
      "text": "Спасибо"
    },
    {
      "id": 28542464,
      "author": "evgeniy_kudinov",
      "datetime": "2025-07-08T02:44:27.000Z",
      "text": "Всё же мне кажется, эта сборка слабовата для нормального использования с практической стороны, ну поиграться пойдет. Я перебирал варианты, и все варианты получались не менее 300 тысяч с двумя бу видеокартами (в сумме VRAM 48 ГБ), но остальные компоненты новые."
    },
    {
      "id": 28542484,
      "author": "empenoso",
      "datetime": "2025-07-08T02:59:51.000Z",
      "text": "48 ГБ VRAM для большой модели?"
    },
    {
      "id": 28543200,
      "author": "riky",
      "datetime": "2025-07-08T07:04:17.000Z",
      "text": "все таки думаю 5060 очень слаба будет, VRAM очень мало. LLM лучше даже не начинать. для картинок придется SD разве что использовать, вместо Flux. Flux покачественней будет из коробки, но памяти хотя бы 12 не помешает.48 ГБ VRAM для LLM это очень не много, у меня 64 но я и то с локальными LLM не связываюсь..."
    },
    {
      "id": 28544628,
      "author": "empenoso",
      "datetime": "2025-07-08T11:27:41.000Z",
      "text": "А что делаете тогда?"
    },
    {
      "id": 28544640,
      "author": "riky",
      "datetime": "2025-07-08T11:29:43.000Z",
      "text": "Flux"
    },
    {
      "id": 28633964,
      "author": "AKimovd",
      "datetime": "2025-07-29T13:16:30.000Z",
      "text": "Поиграться вполне хватит. Я игрался и на 1060 6гб, работало приемлемо."
    },
    {
      "id": 28542488,
      "author": "empenoso",
      "datetime": "2025-07-08T03:00:04.000Z",
      "text": "А для чего использовать хотели?"
    },
    {
      "id": 28545210,
      "author": "evgeniy_kudinov",
      "datetime": "2025-07-08T13:39:23.000Z",
      "text": "Для запуска моделей 32В, чтобы токены выдавало с приемлемой скоростью, вариантов много для чего) Они сильно \"умнее\" по ощущениям чем например 8B"
    },
    {
      "id": 28542526,
      "author": "CitizenOfDreams",
      "datetime": "2025-07-08T03:29:49.000Z",
      "text": "Онлайн-магазины и гипермаркеты вроде DNS отбросилНапрасно. Там компьютерные комплектующие можно выбрать и купить безо всяких нейросетей, консультантов, переписок и личных встреч. И они могут позволить себе минимальные наценки, в отличие от всяких \"ООО ВекторСофт\" (совпадение случайно, если такая компания реально существует)."
    },
    {
      "id": 28542560,
      "author": "dyadyaSerezha",
      "datetime": "2025-07-08T04:02:05.000Z",
      "text": "Он спросил нейросети какой выбрать комп, на котором запустит нейросети, чтобы спросить какой выбрать комп, чтобы запустить на нём нейросети...В землю закопал,Надпись написал. (с)"
    },
    {
      "id": 28542574,
      "author": "AndronNSK",
      "datetime": "2025-07-08T04:13:45.000Z",
      "text": "Этот текст на Пикабу будет более уместен, имхо."
    },
    {
      "id": 28542626,
      "author": "empenoso",
      "datetime": "2025-07-08T04:37:35.000Z",
      "text": "Почему?"
    },
    {
      "id": 28542644,
      "author": "odmin42",
      "datetime": "2025-07-08T04:41:46.000Z",
      "text": "Там модерации меньше, напихают более развёрнуто."
    },
    {
      "id": 28542674,
      "author": "empenoso",
      "datetime": "2025-07-08T04:57:11.000Z",
      "text": "Здесь тоже в общем-то ведь никто не ограничивает комментирующих"
    },
    {
      "id": 28542792,
      "author": "exelens",
      "datetime": "2025-07-08T05:39:54.000Z",
      "text": "Тут уровень познаний аудитории в вопросе выше. Читать такое тут как минимум неожиданно. Местная аудитория и гуглить, и нейронкой, и думать умеет. А это как для старшеклассника."
    },
    {
      "id": 28542806,
      "author": "empenoso",
      "datetime": "2025-07-08T05:42:22.000Z",
      "text": "Я согласен, поэтому и написал в самом начале статьи прошу строго не судить"
    },
    {
      "id": 28542808,
      "author": "empenoso",
      "datetime": "2025-07-08T05:42:39.000Z",
      "text": "Тут видите какой нюанс вам кажется что бесполезно и странно, а кто-то может быть что-то новое узнает"
    },
    {
      "id": 28544676,
      "author": "empenoso",
      "datetime": "2025-07-08T11:33:57.000Z",
      "text": "А вот по существу кстати не могу с вами согласиться. Вотгляньте сами- на счёт 13/14 серии сразу написали"
    },
    {
      "id": 28869202,
      "author": "mydigitalhabb",
      "datetime": "2025-09-22T18:14:45.000Z",
      "text": "Это на а**льно огороженом хабре ? Хабр не пикабу, тут 95% не могут писать чаще чем раз в час или раз в сутки, если имели неосторожность не просто читать, а что-то ещё и комментировать А по статистической случайности любой комментарий любого может не понравится какому-то шизофренику с кармой, и в ответ он насрёт в карму, что приведёт к невозможности нормально комментировать.Вот ты скажешь \"AMD рулит\", даже с развёрнутыми доказательствами - получишь -10 в карму от интелофилов. Скажешь \"Intel рулит\", получишь то же самое. Вообщем что не скажешь, тебе постепенно заткнут рот через идиотскую карму.Так что нормально комментировать тут могут либо мазохисты, либо графоманы, всех остальных ограничивают."
    },
    {
      "id": 28870076,
      "author": "edo1h",
      "datetime": "2025-09-23T03:07:06.000Z",
      "text": "что-то мне кажется, что вы преувеличиваете. достаточно не ввязываться в срачи."
    },
    {
      "id": 28544290,
      "author": "AndronNSK",
      "datetime": "2025-07-08T10:23:55.000Z",
      "text": "Не очень понравилось, что в одном из магазинов заставили ждать почти полчаса, пока единственный менеджер был занят.Эксбигиционизм жизненного пути туда сливают.А здесь пишут технические статьи."
    },
    {
      "id": 28870204,
      "author": "empenoso",
      "datetime": "2025-09-23T04:37:17.000Z",
      "text": "Это как?"
    },
    {
      "id": 28542584,
      "author": "aik",
      "datetime": "2025-07-08T04:20:42.000Z",
      "text": "В ДНС есть и услуга сборки, и с подбором помогут, а зачастую сами продавцы сборкой шабашат за меньшую сумму (и вне очереди). Да и цены зачастую ниже всяких мелких магазинчиков.Непонятно, какое отношение возраст имеет к сборке компьютера. Точно так же можно было добавить условия \"я блондин\" или \"мне нравится группа beatles\".Можно сэкономить: ... взять i5 без \"F\"Как можно сэкономить, взяв более дорогой процессор? И вообще, почему нигде не было предложено амд? r5-8600f ничуть не хуже, чем i5 аналогичные, но дешевле, можно было бы выжать несколько 3-5 тысяч на связке проц+мать.KC3000 - печка, без радиатора перегревается. Хорошо, если на материнке предусмотрено охлаждение, но нередко только один слот с радиатором идёт, а остальные - без. Особенно те, что на обратной стороне. Никем не упомянуто. Впрочем, у меня 2ТБ, может однушка похолоднее.В общем, не вижу, чем тут нейросети будут лучше \"коллективного разума\" с форума."
    },
    {
      "id": 28542634,
      "author": "empenoso",
      "datetime": "2025-07-08T04:38:37.000Z",
      "text": "Нейросети быстрее, спросил и сразу ответ"
    },
    {
      "id": 28542670,
      "author": "Qurunma",
      "datetime": "2025-07-08T04:55:22.000Z",
      "text": "Расплата за это - неточности, как \"экономия на процессоре без f\" и \"если видеокарта сломается, комп превратится в кирпич\". Если видеокарта сломается, то встроенное видеоядро процессора банально не потянет те задачи, которые возлагались на этот ПК, иначе не было бы смысла в покупке дискретной видеокарты"
    },
    {
      "id": 28542720,
      "author": "aik",
      "datetime": "2025-07-08T05:10:52.000Z",
      "text": "Формально это всё же правда - потому что комп вообще без видеоядра таки кирпич. А со встройкой пригоден хотя бы для интернетов и прочих офисов.Потому, если не стоит вопрос экономии, я предпочитаю с видеоядром процессоры брать."
    },
    {
      "id": 28545026,
      "author": "AndronNSK",
      "datetime": "2025-07-08T12:49:22.000Z",
      "text": "Неточности доходят до того, что инфа от LLM принципиально ошибочна."
    },
    {
      "id": 28633496,
      "author": "remzalp",
      "datetime": "2025-07-29T12:11:52.000Z",
      "text": "Предложу простой довод - диагностировать проблему на проце с видеоядром проще, чем на проце без видеоядра  и со сгоревшей видеокартой."
    },
    {
      "id": 28542714,
      "author": "aik",
      "datetime": "2025-07-08T05:09:14.000Z",
      "text": "Который всё равно надо перепроверять у специалиста, если сам не понимаешь.Не у другой нейросети, а именно у специалиста. Лучше у нескольких."
    },
    {
      "id": 28542868,
      "author": "empenoso",
      "datetime": "2025-07-08T05:55:59.000Z",
      "text": "Тут какой момент консультировали же меня живые люди - потом я просто пытался подтвердить их слова нейронкой.Если бы этого не было, то боюсь что конфигурации выглядела бы гораздо более удручающе"
    },
    {
      "id": 28543030,
      "author": "aik",
      "datetime": "2025-07-08T06:25:36.000Z",
      "text": "Надо наоборот. Потому что нейронка явно несёт фигню местами. Использовать нейросети для проверки информации чревато проблемами."
    },
    {
      "id": 28543064,
      "author": "empenoso",
      "datetime": "2025-07-08T06:32:52.000Z",
      "text": "В любом случае живые люди присутствовали в процессе и в больших количествах, потому что рассматривал одновременно несколько поставщиков"
    },
    {
      "id": 28543208,
      "author": "aik",
      "datetime": "2025-07-08T07:05:22.000Z",
      "text": "Да. Но вы под конец всё равно решили проверить конфиг при помощи нейросети - и она вам сморозила фигню.Потому результат работы нейросети всё равно должен вычитывать человек, понимающий в данном вопросе."
    },
    {
      "id": 28542882,
      "author": "Popadanec",
      "datetime": "2025-07-08T05:59:24.000Z",
      "text": "Почему не АМД, вопрос хороший. Это как с ВР играми. Если планируете в них играть, то видяху АМД, лучше даже не рассматривать к покупке. Подробнее об этом на форумах давно расписано."
    },
    {
      "id": 28543026,
      "author": "aik",
      "datetime": "2025-07-08T06:25:09.000Z",
      "text": "Причём тут видеокарта? Про процессор речь.Что видеокарта нужна нвидия - это даже не обсуждается."
    },
    {
      "id": 28545592,
      "author": "TurboKiller13337",
      "datetime": "2025-07-08T15:12:37.000Z",
      "text": "Мамки под ам5 дороже чем под интол, так что экономии счас не будет. Сейчас интел это бюджетный сегмент, как раньше амудя"
    },
    {
      "id": 28545738,
      "author": "aik",
      "datetime": "2025-07-08T15:51:36.000Z",
      "text": "Одного класса примерно одинаково стоят. А процессор подешевле."
    },
    {
      "id": 28542694,
      "author": "jeny_tat",
      "datetime": "2025-07-08T05:05:13.000Z",
      "text": "Тоже начала через нейронки искать себе подходящее железо. Просто однажды поняла, что устала читать статьи и обзоры того или иного техно-блогера и серчить инет в поисках подходящего железа.Понятно, что это не панацея и все равно иногда надо будет искать и читать инфу бля более серьезных вещей. Но, думаю, для мелких задач ИИ как раз подойдет"
    },
    {
      "id": 28542752,
      "author": "rPman",
      "datetime": "2025-07-08T05:20:41.000Z",
      "text": "Оперативная память 32Gb 6000Mhz Kinbank DDR5Этого совершенно недостаточно, ни в каком виде. Докупайте еще столько же минимум. При этом чем больше памяти тем ниже придется опускать ее скорость.Нейросети (для домашнего компьютера) - это оперативная память в первую очередь, причем больше толку от ее БОЛЬШЕГО количества чем от ее скорости, по причинам принципиальной возможности использовать лучшие модели (грубо говоря разница между слабой DDR4 и топовыми DDR5 будут десятки процентов, максимум двухкратно). Причина - узкое место в контроллере памяти и пропускной способности, причем многокональный режим добавляет считанные проценты производительности (когда как синтетические тесты покажут кратный рост).Еще большее значение имеет как суммарный объем VRAM видеокарт так и объем одиночной (прирост производительности от использования двух малых против одной большой считанные проценты, потому что у десктопных процессоров мало pci-e линий, а значит скорость подключения видеокарты нескольких видеокарт в лучшем случае будет 8х но скорее 4х... т.е. узким местом станет шина данныхИтого, если ваша сборка не 64гб ram (лучше 128гб или даже 196гб) и не 24гб VRAM (можно 2x16гб VRAM) тодля нейронных сетей она будет подходить слабо.Запускать 8b модели то еще удовольствие, они слабые, переобученные на тестах (что бы красивые циферки рисовать), плохо понимающие русский язык и т.п. Мультимодальность и вовсе без оперативной памяти работает плохо (читай медленно), софта, эффективно использующего малый объем VRAM мало (спасибо что в принципе естьik_llamaно с мультимодальностью там все еще медленно).Адекватные модели начинаются где то с 30b: qwen3-30b-a3b, qwen3-32b, magistral small/medium 24b, gemma3 24b/14b, microsoft phi-4 14b (рекомендую) и для их запуска даже на процессоре может быть мало и 64гб ram, потому что контекстное окно пожирает оперативную память с его ростом.Итого, используя несколько десктопных gpu (например 2-4шт по 16-24гб) можно получить скорость в 600tps/60tps (input/generation) на процессоре в 10 раз меньше - порядка 5tps-10tps. А так как reasoning модели повышают качество результата значительно (по тестам 10-20% но по личным ощущениям выше, так как в тестах есть переобученные примеры, которые ломают статистику) но повышают время, требуемое на получение результата еще в 10-100 раз (нормально даже на видеокарте думать по 1-2 минуте) то процессор в чистом виде использовать нет никакого особого толку.И в догонку, железо, способное запускать локально модели обойдется в несколько тысяч $, которые можно было бы тратить годами у облачных провайдеров (openrouter) с лучшими предложениями по качеству (но мой выбор - локальные модели плюс изредка качественные в облаке)"
    },
    {
      "id": 28544692,
      "author": "empenoso",
      "datetime": "2025-07-08T11:36:21.000Z",
      "text": "Спасибо за советы по существу"
    },
    {
      "id": 28542760,
      "author": "kuza2000",
      "datetime": "2025-07-08T05:22:17.000Z",
      "text": "Зачем указывать возраст в ТЗ?Ну и столько внимания подсветке... Она отключается за несколько секунд на любом корпусе.Выдачу НС обязательно нужно проверять. Бывают неточности, бывают галлюцинации. А ещё они отстают от реального мира на год, а то и два.А локально запускать НС... Можно, но для того же дипсика нужно около 800 Гб памяти."
    },
    {
      "id": 28542870,
      "author": "empenoso",
      "datetime": "2025-07-08T05:57:36.000Z",
      "text": "С такой конфигурацией можно хотя бы попробовать вкатиться в локальное использование, а на  surface ноутбуке 2020 года далеко не уехать"
    },
    {
      "id": 28542876,
      "author": "empenoso",
      "datetime": "2025-07-08T05:59:10.000Z",
      "text": "А подсветки столько внимания потому что почти все системные блоки в каких-то рекламных материалах светятся как новогодняя гирлянда, а мне этого не хотелось. К тому же если дома ночью компьютер оставлять и такая гирлянда светится это слишком ярко даже пусть в отдельной комнате стоит."
    },
    {
      "id": 28543006,
      "author": "apxapuyc",
      "datetime": "2025-07-08T06:21:44.000Z",
      "text": "Если подсветка не нужна, то зачем за неё платить? Не хочется мотивировать производителя вообще отказаться от нормальных рабочих решений сделанных без цыганского гламура."
    },
    {
      "id": 28543184,
      "author": "aik",
      "datetime": "2025-07-08T07:01:53.000Z",
      "text": "Как правило, она дополнительных денег не стоит, а просто входит в базовый набор."
    },
    {
      "id": 28543498,
      "author": "apxapuyc",
      "datetime": "2025-07-08T07:59:10.000Z",
      "text": "На самом деле она включена в пакет \"у этого базового набора такая цена потому, что вот вам подсветочка\". И именно поэтому порой найти что-то нужное без оной подсветочки квест тот ещё."
    },
    {
      "id": 28544738,
      "author": "kuza2000",
      "datetime": "2025-07-08T11:44:29.000Z",
      "text": "Если исключить из условий выбора \"отсутствие подсветки\", то база выбора сильно расширяется. Расширение базы выбора очень часто приводит к выбору более оптимальной модели, в том числе и по соотношению цена/качество. А подсветку отключить - это просто выдернуть разъем"
    },
    {
      "id": 28542892,
      "author": "RulenBagdasis",
      "datetime": "2025-07-08T06:01:22.000Z",
      "text": "У меня уже есть монитор 27 дюймов 2K 100 Гц Разрешение 2560*1440, DP, HDMI.Это 2.5к. 2к, это \"примерно 2000 пикселей по горизонтали\". Изначально 2к это  2048 × 1080 у киношников. Сегодня в бытовом смысле, когда речь про мониторы, если не хотят никого запутать, под 2к подразумевают FullHD. Использование 2к для обозначения  QHD не очень грамотно и сильно сбивает с толку."
    },
    {
      "id": 28542910,
      "author": "empenoso",
      "datetime": "2025-07-08T06:05:47.000Z",
      "text": "Точно подмечено"
    },
    {
      "id": 28543274,
      "author": "ZirakZigil",
      "datetime": "2025-07-08T07:20:41.000Z",
      "text": "Использование 2к для обозначения  QHD не очень грамотноЭто правда, а этоСегодня в бытовом смысле, когда речь про мониторы, если не хотят никого запутать, под 2к подразумевают FullHDи сильно сбивает с толку.нет. В бытовом смысле, как раз, повсеместно 2к == 2560х1440"
    },
    {
      "id": 28543492,
      "author": "Popadanec",
      "datetime": "2025-07-08T07:58:12.000Z",
      "text": "А 4к это 5120х2880, да? Почему 3840х2160 это 4к, а1920х1080 это не 2к? Кто скурил логику? Тот кто породил и продолжает поддерживать эту путаницу, сидит и радостно потирает лапки."
    },
    {
      "id": 28547344,
      "author": "ZirakZigil",
      "datetime": "2025-07-09T05:52:59.000Z",
      "text": "Почему 3840х2160 это 4к, а1920х1080 это не 2к?  Кто скурил логику?Первое это конкретно и есть 4к, безо всяких там \"generic term\" как у вас по ссылке. И оно 4к потому, что в 4 раза больше фулл хд. Путаница только с параллелью между 2к и 2560*1440. Это как ксерокс, переживём."
    },
    {
      "id": 28543988,
      "author": "Vedomir",
      "datetime": "2025-07-08T09:40:46.000Z",
      "text": ">Сегодня в бытовом смысле, когда речь про мониторы, если не хотят никого запутать, под 2к подразумевают FullHD.Ни разу не видел такого использования. 2К устоявшееся обозначение именно для  2560*1440"
    },
    {
      "id": 28542986,
      "author": "apxapuyc",
      "datetime": "2025-07-08T06:17:50.000Z",
      "text": "Собрать ПК без подсветки сейчас не так уж просто, да. Эти дешманские светодиоды пихают везде в надежде увеличить таким образом цену изделия. Лично я всегда собирал себе именно устройства без подсветки - ёлочные гирлянды всегда можно докупить отдельно и повесить именно там, где им место; и иногда это было прямо проблемой, особенно в случае с кулерами. Видишь хороший кулер с нужными характеристиками и оппа, вуаля, а в нём стробоскоп прикручен специально для тех, кто не в монитор смотрит, а корпусом любуется - \"ах, дорохо, бохато! блестит, сверкает, мерцает! скажу пацанам, что за 300 тыщ собрал!\""
    },
    {
      "id": 28543002,
      "author": "empenoso",
      "datetime": "2025-07-08T06:21:05.000Z",
      "text": "Много лет уже не имел своего системного блока, а теперь оказалось что даже оперативная память с подсветкой идёт - меняли на другую по моей заявке"
    },
    {
      "id": 28543436,
      "author": "apxapuyc",
      "datetime": "2025-07-08T07:50:56.000Z",
      "text": "Жесть конечно. Мне кажется, что именно подсветка должна быть редкой опцией, а не её отсутствие."
    },
    {
      "id": 28543892,
      "author": "Popadanec",
      "datetime": "2025-07-08T09:16:45.000Z",
      "text": "Увы, именно на массу ориентируются производители. А толпа ведётся на самые дешёвые трюки по привлечению внимания. Как сороки, на яркое и блестящее. Думать хоть на пол секунды вперёд они не умеют. Только потом, после покупки, непрактичность данного решения становится очевидной для них. Подсветка мешает в полутьме или если ПК на столе, то даже днём. Глянец легко царапается и быстро пачкается."
    },
    {
      "id": 28543046,
      "author": "aik",
      "datetime": "2025-07-08T06:29:35.000Z",
      "text": "Подсветку можно просто не включать, если мешается. Разве что в дешевых кулерах она тупо при подаче питания включается, а не на отдельном проводе висит. Но дешевые вентиляторы всё равно принято менять на нормальные."
    },
    {
      "id": 28543068,
      "author": "empenoso",
      "datetime": "2025-07-08T06:34:08.000Z",
      "text": "А которые корпусные? Там просто физически включается - в разъем воткнуто - горит, если питание не подано - не горит"
    },
    {
      "id": 28543174,
      "author": "aik",
      "datetime": "2025-07-08T07:00:04.000Z",
      "text": "Нормальные корпусные тоже идут с управлением подсветкой. Ну, если они RGB. Если же без управления - то это тоже дешевые вентиляторы под замену на нормальные."
    },
    {
      "id": 28543446,
      "author": "apxapuyc",
      "datetime": "2025-07-08T07:52:22.000Z",
      "text": "А зачем я должен покупать то, что потом мне же надо будет отключать? Я не хочу оплачивать хотелки китайских манагеров, решивших, что нонстоп ёлка под столом это креативное решение, нужное каждому."
    },
    {
      "id": 28543558,
      "author": "aik",
      "datetime": "2025-07-08T08:10:05.000Z",
      "text": "Потому что это базовый набор сегодня. Хочется нестандартного - плати больше."
    },
    {
      "id": 28543642,
      "author": "apxapuyc",
      "datetime": "2025-07-08T08:25:55.000Z",
      "text": "Этот базовый набор и вырос из предыдущего \"вы хотите подсветки - их есть у меня\".Как это всё происходит? Почему это работает? Классические манипуляции капитализма.1) Берем и лепим подсветку на вентилятор, продаём дороже, чем вентиль без подсветки. Потому что ну вот подсветка же. Вы должны были застать эти времена и помнить их - судя по профилю, я не сильно старше Вас.2) Затем потихоньку начинаем лепить подсветку везде, удорожая продукт и создавая трудности в поиске продукта без подсветки.3) Продукт без подсветки становится премиальным и начинает стоить дороже, ведь его теперь меньше. Нонсенс? Нет, маркетинг.И вот я не хочу вписываться в схемы капиталистических выдумщиков. Если мне не нужна подсветка - я найду продукт без неё. Да, с точки зрения логики я в любом случае уже вляпался в схемы этих разводил. И с точки зрения той же логики ничего страшного в покупке сверкучих блестяшек и обматывания их потом вручную чёрным поролоном именно потому что мне нужны просто чёрные шарики вообще нет. Но для меня хороший солидный ПК это ничем кроме индикаторов не светящийся корпус без стеклянных стенок."
    },
    {
      "id": 28543804,
      "author": "aik",
      "datetime": "2025-07-08T09:00:54.000Z",
      "text": "Мне нужен корпус - я беру корпус. Вентиляторы в корпусе в любом случае под замену, с подсветкой они или без. Если же они достаточно хорошего качества, то подсветка там если и будет, то она будет отключаемая.Затем потихоньку начинаем лепить подсветку везде, удорожая продуктЗатем подсветка за счёт массового производства дешевеет и светящийся продукт сравнивается по цене с несветящимся."
    },
    {
      "id": 28656238,
      "author": "Moog_Prodigy",
      "datetime": "2025-08-03T15:57:18.000Z",
      "text": "Тут может быть хитрая схема. Условный дядя Ляо выпускает кучу корпусов с подсветкой. Потому что наводняет ими рынок. А вы такой особенный и хотите без подсветки. Дядя Ляо выпускает корпуса и без подсветки, в малом количестве и под другим брендом. И дороже. В итоге дядя Ляо всегда в плюсе)"
    },
    {
      "id": 28543998,
      "author": "Vedomir",
      "datetime": "2025-07-08T09:42:21.000Z",
      "text": "Как минимум можно проголосовать кошельком за тех производителей, что ее не пихают."
    },
    {
      "id": 28543452,
      "author": "wrewolf",
      "datetime": "2025-07-08T07:52:53.000Z",
      "text": "У меня глупый вопрос, а почему не использовали видяхи для ЛЛМ, они стоят копейки против монстров 40хх, 50хх и пямяти там 24Гб сразу будет, монитор не подлючить, но вам шашечки или ехать.В целом до сих пор такая видяха (по маркету поппулятна nvidia tesla k80) + что то приемлимое игровое для ОС и полетели, и в бюджет уложится"
    },
    {
      "id": 28543668,
      "author": "ZlobniyShurik",
      "datetime": "2025-07-08T08:31:12.000Z",
      "text": "Если совсем древние модели видюх, то бывает, что современный софт их уже толком не поддерживает.Условно, нужна CUDA/ROCm/что-там-ещё не ниже версии 100500, а не такая уж плохая и относительно дешёвая б/у карточка перестала поддерживаться в версии 100400. Иногда это обходится путём сборки софта из исходников, но часто обмануть реальность уже никак не получается."
    },
    {
      "id": 28543788,
      "author": "wrewolf",
      "datetime": "2025-07-08T08:58:24.000Z",
      "text": "Это относится к nvidia tesla k80 или к чему? Или промахнулся с ответом."
    },
    {
      "id": 28543816,
      "author": "wrewolf",
      "datetime": "2025-07-08T09:02:13.000Z",
      "text": "Загуглил внимательнее, а оно и правда древнее, всё понял, ушел думаь и учить матчасть"
    },
    {
      "id": 28544806,
      "author": "AcckiyGerman",
      "datetime": "2025-07-08T11:57:15.000Z",
      "text": "rtx 3090 has the highestperformance / costvalue for the LLMs at the moment."
    },
    {
      "id": 28545690,
      "author": "rPman",
      "datetime": "2025-07-08T15:40:44.000Z",
      "text": "где же вы найдете по хорошим ценам 3090?"
    },
    {
      "id": 28545580,
      "author": "TurboKiller13337",
      "datetime": "2025-07-08T15:09:33.000Z",
      "text": "Проблема мне видится с Авито, в конкретном регионе их не будет, чтоб проверить. А что придет не кирпич, никто гарантии не даст. Сам смотрел на тэслы, но, слишком беден, что-бы экономить."
    },
    {
      "id": 28544146,
      "author": "Vedomir",
      "datetime": "2025-07-08T10:01:27.000Z",
      "text": "Статья как по мне совершенно не уровень Хабра, здесь ждешь чего-то более технически сложного. Такое было бы к месту на Дзене или Пикабу.Сам исторически собираю все компьютеры сам - больше из принципа, оставаться как айтишнику чуть поближе к железу, с выбором комплектующих тоже никогда проблем не было, я же айтишник, мне же интересна отрасль в целом и что в ней происходит, так что новости и обзоры про новые железяки тоже почитываю. Ну и погуглить перед сборкой не сложно. Но писать об этом на Хабр даже в голову не приходило - не говоря уже о том, чтобы подробно писать как у нейросеток выспрашиваешь подробности о комплектующих. Вы бы еще подробные скриншоты поиска в гугле разместили.Единственный любопытный момент - выбор комплектующих без подсветки, сам такое выбираю и не подключаю даже лампочки-индикаторы включения. И как минимум для того, чтобы поддержать производителей, выпускающих такое железо и не поддающихся мании на уродливые и аляповатые гирлянды. Но это пара фраз, а не пост и тем более не статья."
    },
    {
      "id": 28544748,
      "author": "empenoso",
      "datetime": "2025-07-08T11:45:44.000Z",
      "text": "Спасибо, что не просто поставили минус, а нашли время подробно изложить свою точку зрения ведь на Хабре, где комментарии часто умнее самих статей - это правда.Я прекрасно понимаю ваш подход вам интересно разбираться в железе, собирать вручную и следить за новостями. Но моя цель была как раз показать, как с помощью современных инструментов вроде нейросетей можно пройти похожий путь человеку без подобного бэкграунда.Скорее всего, мы просто представляем разные аудитории: вы - как тот, кто всё знает и делает сам по железу, а я тот, кто пришёл со стороны, но хочет делать осознанный выбор.В этом и был мой мотив в этой статье - не техническая глубина, а путь, понятный многим."
    },
    {
      "id": 28545566,
      "author": "TurboKiller13337",
      "datetime": "2025-07-08T15:05:11.000Z",
      "text": "БП этот бронза, тебе нахрен не нужон. Взял бы чифтэк какой на 850 Вт.По хорошему, для твоих задач хватит и селерона какого, на нем ничего считать не будет. Не уверен что селероны выпускают. Можно и3 взять.Вот с pci-e нужно отнестись серьезно, для языковых версия не шибко важна. А вот если хочешь stable difusion там падение скорости может быть до 50% из-за версии pci-e. Так что тут нужно брать с пятой версией, чтоб далеко и на долго.По видюхе 5060 ti 16 gb это реал минимум. Но, 5080 тебе тоже не поможет, у нее так же 16гб. Если не срочно, можно подождать выхода ti super. Если прям счас надо. То бери 5060 ti.Чтоб вложиться в бюджет, нужно по классике покупать видюху, остальное на сдачу. Ценник на дешевое железо я не знаю, но если учесть как упала цена а на 5060ti, это вполне возможно.Так же бери материнку где минимум 2 pci-e пятой версии х8. От нвме диска можно и вовсе отказаться. Во первых скорости ты не заметишь по сравнению с сата. Во вторых сата может оказаться дешевле. В третьих, этот долбаный нвме может сожрать линии pci-e, которые тебе полюбасе понадобятся в будущем. По той причине, что ты захочешь купить вторую карту, а нейронки легко распределяют нагрузку между видюхами.Скажи честно, берешь чтоб стэлар Блэйд поиграть, а нейронка это оправдание для жены.))"
    },
    {
      "id": 28545702,
      "author": "empenoso",
      "datetime": "2025-07-08T15:43:11.000Z",
      "text": "Комп ведь уже куплен ;)"
    },
    {
      "id": 28545954,
      "author": "ThingCrimson",
      "datetime": "2025-07-08T17:07:49.000Z",
      "text": "Стол сделан из большого обрезка кухонной столешницыПрошу прощения, что не про конфигурацию ПК, но начинающий столяр во мне не смог пройти мимо такой конструкции стола. ЛДСП (пусть даже и толстая) работающая на изгиб плюс крепление металлических боковин к ЛДСП с работой на выламывание — это путь к проблемам. Хотя бы одна поперечина из профильной трубы просится, которая взяла бы на себя провисание столешницы и взаимофиксацию боковин…"
    },
    {
      "id": 28545978,
      "author": "rPman",
      "datetime": "2025-07-08T17:14:24.000Z",
      "text": "там 3см доска, это стол, на него нагрузки выше 2х собственного веса практически нет, какие тут могут быть проблемы? из более тонких некоторые шкафы-кровати делают, а тут только стол"
    },
    {
      "id": 28546328,
      "author": "dinarv",
      "datetime": "2025-07-08T19:26:21.000Z",
      "text": "Если говорить про выбор платформы, то китайский xeon e5 v4 с 10-20и физических ядер на серверной оперативке ddr4 ECC с 2хМ2 стоит около 100 баксов за комплект, а за 300-400 можно упаковать двухпроцессорный конфиг на 128ГБ ОЗУ и остаться ещё в указанном бюджете. Но нейросети вряд ли это знают(т.к. не мейнстрим)."
    },
    {
      "id": 28547096,
      "author": "lenyadish",
      "datetime": "2025-07-09T04:47:32.000Z",
      "text": "Распродал все эти зионы с 128гб скрипя зубами, они созданы только для многопоточки, но производительность на ядро очень малая, старый проц очень. Новые райзены хоть и дороже, да, но ты экономишь место и производительность отбивает часть затрат. Разница в цене тут не критичная."
    },
    {
      "id": 28569138,
      "author": "dinarv",
      "datetime": "2025-07-14T09:48:36.000Z",
      "text": "в статье обсуждалась сборка за 80к, о чем вы, какой новый райзен и много памяти?))разница в скорости ядра около 2х раз - не так уж и радикально и легко перебивается х3 х4 кол-вом ядер в ЦП (х4 и больше, если 2х сокетная система)понятно, что это \"говно и палки\", но условия задачи это не оговаривали)"
    },
    {
      "id": 28547084,
      "author": "lenyadish",
      "datetime": "2025-07-09T04:42:32.000Z",
      "text": "Зачем покупать в конторах, когда новое дешевле на Авито, это раз. Вся статья о том, что чел спрашивал у гпт подойдёт ли видяха и боролся со своей жабой. Ни о чем. Какой то низкопробный заход.Купи 4000 видяху с 12+ памяти и собери комп на ddr5 от 32гб, райзен выигрывает в производительности/цена. Выбор очевиден."
    },
    {
      "id": 28547106,
      "author": "empenoso",
      "datetime": "2025-07-09T04:58:03.000Z",
      "text": "Слишком категорично. И цене разве не так же получится?"
    },
    {
      "id": 28568412,
      "author": "zasyadko",
      "datetime": "2025-07-14T07:39:28.000Z",
      "text": "Del"
    },
    {
      "id": 28578004,
      "author": "empenoso",
      "datetime": "2025-07-16T04:37:47.000Z",
      "text": "А что добавить хотели?"
    },
    {
      "id": 28810032,
      "author": "EriIaz",
      "datetime": "2025-09-08T07:28:25.000Z",
      "text": "DDR5 в его случае избыточнаХороший пример того, почему оценочным суждениям LLM верить нельзя, да и некоторым \"фактам\" - тоже. В таких вопросах, LLM - это такой ортодокс-фундаменталист, выращенный на интернет-форумах.Несколько лет назад в DDR5 действительно было мало смысла - стоила такая память как гончая DDR4, да ещё и с наценкой за материнку, при том что не сильно превосходила старую память в играх, а AI-бум тогда ещё не свершился, и за пропускной способностью памяти не было смысла гнаться, да и не такая она высокая была: контроллеры памяти и материнские платы большие частоты не держали, из-за топологии и косячных BIOS.Поэтому люди резонно советовали: хочешь сборку с ограниченном бюджетом - можешь на оперативке экономить, а оставшиеся средства вложи в что-то более важное или в карман. Бери какой-нибудь AMDшный Zen 3, желательно X3D, а ему DDR4-3600 за глаза хватит, и все игрушки будут летать без проблем. Либо 10 и 12 поколения Intel - там можно было упороться и раскачегарить DDR4 выше 4000-4200MT/s, даже на хайниксах. Но лучше просто потратить больше на видеокарту. Память довольно мало влияла. И всё как бы верно, на тот момент. Никто не врал и не лукавил.А потом допилили BIOSы, вышли новые чипсеты а потом и процы, память DDR5 подешевела, и появилась потребность в высокой ПСП для каких нибудь llamaCPP. Там у DDR5 над DDR4 огромное преимущество, и по объему памяти, и по скорости. Старьё перестало быть актуальным, целесообразнее стала память DDR5.Но тексты с обсуждений и форумов остались и попали в датасеты! LLM не мыслит, она лишь воспроизводит датасет, в который актуальные сравнения либо не попадают, либо тонут в сточных устаревших оценок. Поэтому нейронка слоупочит \"хммм, а вдруг в DDR5 смысла нет, давай предложу юзеру DDR4-3600 для ИИ-нагрузок\". Ради того, чтобы сэкономить две копейки, ценой полутрократной потери пропускной способности памяти, ну да, конечно. Отличный план, надёжный!)"
    },
    {
      "id": 28810388,
      "author": "rPman",
      "datetime": "2025-09-08T08:27:56.000Z",
      "text": "потребность в высокой ПСП для каких нибудь llamaCPP. Там у DDR5 над DDR4 огромное преимуществонет, разница между ddr4 и ddr5 сборкой (при разнице 2х в бенчмарках), при запуске llama.cpp будет не больше 20%, и то, вместе с памятью обычно и процессор берут по лучше, и даже в этом случае дополнительно добавляются еще считанные проценты.По хорошему llm требуют gpu, любые другие конфигурации ... только для поиграться. Никто в здравом уме не будет пользоваться llm, ожидая 15 минут ответа (типовое время ответа reasoning какой-нибудь qwen32 или phi4 а это относительно слабые модели), а уж топовые модели, требующие от 196гб ram и подавно будут в секунду по слову генерировать.в конечном счете важно не тип ddr и не процессор, а стоимость за tps"
    }
  ]
}