{
  "url": "https://habr.com/ru/articles/933128/comments/",
  "article_id": 933128,
  "title": "Удаляем незваных подписчиков из своего телеграм канала",
  "comments": [
    {
      "id": 28662530,
      "author": "Klochko",
      "datetime": "2025-08-05T00:54:29.000Z",
      "text": "А что если взять обычного бота и поставить админом в канал? Обычные боты стучат в вебхук событие new_chat_member в котором есть вся базовая информация о пользователе. И просто этим ботом собирать информацию и складывать в отдельную БД?Понятное дело, что пост-фактом смысла в этом маловато, но лучше поздно чем никогда. И вот этот бот может собирать информацию: кто подписался; кто отписался; может удалять пользователей. И все это может лежат в БД. С пользователем и всей историей его «миграции». И это работает и в каналах и чатах. А затем выборочно можно удалять кого-то тем же ботом не прибегая к юзерботам и странным ограничениям тг."
    },
    {
      "id": 28662544,
      "author": "empenoso",
      "datetime": "2025-08-05T01:05:59.000Z",
      "text": "Да, поставить бота, который сразу записывает новых подписчиков в базу, это отлично  следить за аудиторией канала.В статье я описывал другую ситуацию: всплеск уже произошёл, и нужно как-то разобраться с теми, кто уже подписался. Ведь проблема в том, что если бот не стоял с самого начала, он не сможет узнать, кто именно пришёл раньше.Поэтому мой скрипт скорее «аварийный» инструмент."
    },
    {
      "id": 28662538,
      "author": "Sannis",
      "datetime": "2025-08-05T01:01:50.000Z",
      "text": "Ну если удалять всех подписчиков, но невелика задача так пачками это делать. Вам при этом не кажется что там могут быть и полезные подписчики?"
    },
    {
      "id": 28662550,
      "author": "empenoso",
      "datetime": "2025-08-05T01:11:39.000Z",
      "text": "Конечно могут. Просто надо знать точное время когда стали \"заливать\" ботов"
    },
    {
      "id": 28663660,
      "author": "AVX",
      "datetime": "2025-08-05T08:43:43.000Z",
      "text": "А если обычный пользователь в это же время подписался? Выкинет и его? Мне кажется, алгоритм неправильный. Надо как-то анализировать профили пользователей и по каким-то выявленным признакам уже чистить.Либо, если цель - обеспечить активность пользователей, то надо чистить любых неактивных, указав этот нюанс в правилах канала. На обычных форумах такое вполне практиковали - прямо в админке можно выбрать тех, кто неактивен более полгода-год (или по своему видению), и блокировать, потом кто долго заблокирован удалять. Не знаю, есть ли в телеге такие возможности."
    }
  ]
}