{
  "url": "https://habr.com/ru/articles/933806/comments/",
  "article_id": 933806,
  "title": "Лучшие статьи Хабра в июле 2025 года",
  "comments": [
    {
      "id": 28671840,
      "author": "Sazonov",
      "datetime": "2025-08-07T00:43:21.000Z",
      "text": "Хм, статья для тех, кто не осилил фильтры в Хабре? Или реклама «умного дома инвестора»?"
    },
    {
      "id": 28671864,
      "author": "empenoso",
      "datetime": "2025-08-07T00:56:56.000Z",
      "text": "По фильтрам так не отобрать.Как вы выберете самые сохраняемые в закладки например?"
    },
    {
      "id": 28671950,
      "author": "Sazonov",
      "datetime": "2025-08-07T02:38:53.000Z",
      "text": "А зачем это нужно? Ничего интересного вы сами не написали, рекламу странного телеграмм канала при этом всунули."
    },
    {
      "id": 28677366,
      "author": "empenoso",
      "datetime": "2025-08-08T03:27:42.000Z",
      "text": "На мой взгляд, фильтры и ручной поиск решают разные задачи. Фильтром вы подберёте статьи по ключевым словам, а здесь - срез того, что реально оказалось в фокусе аудитории за месяц. Кому-то это помогает открыть для себя неожиданных авторов или темы. Реклама канала в подписи - просто часть стандартного оформления моих материалов, не более."
    },
    {
      "id": 28672956,
      "author": "monowar",
      "datetime": "2025-08-07T07:53:11.000Z",
      "text": "\"Читайте комменты, чтоб понимать русских\". В большинстве \"вирусных\" статей они (комменты) сводятся к обсуждениям технической части. Или просто стебу. И Слава Ктулху!"
    },
    {
      "id": 28673454,
      "author": "Chumikov",
      "datetime": "2025-08-07T09:03:05.000Z",
      "text": "Спасибо за статью! Мне интересны подобные рейтинги!"
    },
    {
      "id": 28673520,
      "author": "empenoso",
      "datetime": "2025-08-07T09:15:02.000Z",
      "text": "Спасибо и Вам!"
    },
    {
      "id": 28674006,
      "author": "lgorSL",
      "datetime": "2025-08-07T10:43:01.000Z",
      "text": "Забавно, что даже среди перечисленных \"лучших\" статей я не читал практически ничего (исключение - несколько технических типа той что про OpenCV), и даже сейчас по их заголовкам желания читать их не возникло."
    },
    {
      "id": 28674048,
      "author": "empenoso",
      "datetime": "2025-08-07T10:49:29.000Z",
      "text": "Это по метрикам эти статьи выделились. А у вас какой подход?"
    },
    {
      "id": 28675134,
      "author": "lgorSL",
      "datetime": "2025-08-07T14:11:28.000Z",
      "text": "Читаю технические статьи и стараюсь игнорировать кликбейтные заголовки.\"Разработка высоконагруженных API: проблемы, решения, практические рекомендации\" - сразу понятно, что там и захочу ли я читать (статья, кстати, топовая)\"Тебе не поступить на программиста. Всё кончено\" - вижу кликбейт и в общем-то мне и уже и не нужно никуда поступать.\"Я ставлю датчик, иду на Авито и зарабатываю 2 млн в месяц на курьерах\" - сразу понятно, что это Слава Рюмин и читать я это не хочу.\"Я 10 лет искал причину головной боли, оказалось — чипсы\" - у меня такая же голова и она не болит, можно не тратить время\"Крах ИИ: Почему нейросети не пережили свою первую зиму\" - не знаю кто там что не пережил, гоняю локально LLM и Stable diffusion, всё нравится. Возможно автор думает, что он провокационным заголовком заставит меня зайти. Ему не удалось.\"AGI математически невозможен, но хайп уже не остановить\" - пока одни рукомахательно рассуждают что там невозможно, другие берут и делают. Тех кто реально что-то делает, читать на пару порядков интереснее."
    },
    {
      "id": 28677364,
      "author": "empenoso",
      "datetime": "2025-08-08T03:27:02.000Z",
      "text": "Кто-то выбирает только техническое, кто-то - по заголовку, кто-то ориентируется на рекомендации или рейтинг. Моя задача в этой статье - не агитировать за конкретные публикации, а показать картину по метрикам: какие темы реально читали, обсуждали, сохраняли."
    },
    {
      "id": 28683218,
      "author": "lgorSL",
      "datetime": "2025-08-09T07:57:25.000Z",
      "text": "Я понимаю, к Вам никаких претензий. Моё недовольство направлено в сторону хабра и сложившейся ситуации."
    },
    {
      "id": 28675832,
      "author": "kneaded",
      "datetime": "2025-08-07T17:02:42.000Z",
      "text": "О боже как же приятно попасть в такой рейтинг просто благодаря своей истории про изучение Python))) спасибо)))"
    },
    {
      "id": 28676800,
      "author": "PaaLadin",
      "datetime": "2025-08-07T21:21:28.000Z",
      "text": "Однако сообщество также высоко ценит качество, что видно по высокому рейтингу Павла Семёнова.КачествоиПавел Семёнов- это слова которые не могут стоять в одной строке. Там же вырвиглазные статьи которые автор пишет будучи серъёзно под градусом. Вот действительно - этот  рефренс мне напомнил пару цитат начала века, когда в досудебной переписке секретарю надо было вставить хоть что-то приятное в письмо, и там появлялись такие перлы как:один из ведущих в городе фоторепортеров (С) Piterstoryсотрудничество с [...] известным в журналистской среде фотокорреспондентом\" (С) ИА \"Росбалт\"Как по мне, так серия материалов давшая высокий рейтинг - откровенное графоманство человека перепутавшего Хабр с личным бложиком, в результате чего его сопливые жалобы на \"попытки выхода из АйТи\" видят серъёзные специалисты, которые из-за застилающей глаза кровавой пелены сначала не могут найти выход из материала, а потом ошибочно кликают на+к рейтингу статьи, думая, что это крест закроющий сей адский контент.Ничего, завтра последнюю главу допишу и попробую выйти из запоя.PS:Кстати, коллеги, посоветуйте на каком бесплатном хостинге легко поднять в нынешнее время свой стэндалон блог? А то я лет 5 назад забросил сайт, а тут вдруг подписчики и фанаты спрашивают почему не работает."
    },
    {
      "id": 28677228,
      "author": "empenoso",
      "datetime": "2025-08-08T01:06:31.000Z",
      "text": "На GitHub Pages"
    },
    {
      "id": 28676950,
      "author": "checkpoint",
      "datetime": "2025-08-07T22:24:03.000Z",
      "text": "Нда. Моя статья на 90 страниц про Фрюху, на написание которой у меня ушло больше месяца, осталась совсем незамеченной. Видимо пора прекращать писать что-то полезное и делиться знаниями, достаточно потолочь воду в ступе на злободневные темы и профит."
    },
    {
      "id": 28677232,
      "author": "empenoso",
      "datetime": "2025-08-08T01:07:33.000Z",
      "text": "Не согласен с Вами. Это больше вопрос мотивации"
    },
    {
      "id": 28677370,
      "author": "empenoso",
      "datetime": "2025-08-08T03:29:59.000Z",
      "text": "Хочу ещё добавить что мой формат - это именно обзор метрик, а не «гонка за хайпом». Цель - показать, что в топ по просмотрам и рейтингам попадает разный контент: и глубокие технические материалы, и лёгкие истории. При этом качественные вещи тоже находят своего читателя, просто это не всегда отражается в массовых просмотрах. Думаю, ваш труд тоже ценят - просто метрики и аудитория у каждого автора свои"
    },
    {
      "id": 28742672,
      "author": "DashBerlin",
      "datetime": "2025-08-23T00:18:43.000Z",
      "text": "Впервые решил заглянуть в подобный обзор, порадовала позиция количество закладок, интересено, после эти публикации читаются. Я подписан на автора, он пачками сохраняет статьи в закладки, какой процент он потом перечитывает из этого. Спасибо за обзор ))"
    },
    {
      "id": 28749368,
      "author": "empenoso",
      "datetime": "2025-08-25T06:35:08.000Z",
      "text": "совершенно не весь 😢"
    }
  ]
}