{
  "url": "https://habr.com/ru/articles/935098/comments/",
  "article_id": 935098,
  "title": "Анализ лиц с домофона: как я победил несовместимости и собрал dlib+CUDA на Ubuntu — готовый скрипт",
  "comments": [
    {
      "id": 28725030,
      "author": "nronnie",
      "datetime": "2025-08-19T00:40:43.000Z",
      "text": "а может, кто-то что-то высматривает?А может вам к специалисту соответствующего профиля?"
    },
    {
      "id": 28725134,
      "author": "shlmzl",
      "datetime": "2025-08-19T02:08:31.000Z",
      "text": "А что не так с комментом? Если тебе интересна деятельность по выявлению тех кто что-то кое-где еще порой высматривает, то обратись специалисту соответствующего профиля из силовиков, я так понимаю. Самостоятельная активность в этой тематике с учетом текущих реалий, без контроля сами знаете каких структур, может не особо приветствоваться."
    },
    {
      "id": 28725146,
      "author": "empenoso",
      "datetime": "2025-08-19T02:31:48.000Z",
      "text": "Я не занимаюсь «оперативной деятельностью» и не претендую на роль силовиков. Это чисто технический эксперимент для себя - посмотреть, можно ли применить компьютерное зрение и CUDA-ускорение к реальным бытовым данным (в данном случае видеозаписям с камер).Это личный эксперимент, а не система."
    },
    {
      "id": 28725264,
      "author": "shlmzl",
      "datetime": "2025-08-19T04:06:13.000Z",
      "text": "видеозаписи с камер - бытовые данные, только если внутри квартиры. А снаружи, даже если это общий коридор с другой квартирой - это не бытовые данные, не говоря про открытое пространство. Недоброжелатель может хакнуть доступ и наблюдать в своих недоброжелательных целях."
    },
    {
      "id": 28725410,
      "author": "dim0xff",
      "datetime": "2025-08-19T04:56:37.000Z",
      "text": "из статьи мне осталось непонятно: как видео с домофона попадает на сетевое хранилище?"
    },
    {
      "id": 28725436,
      "author": "empenoso",
      "datetime": "2025-08-19T05:04:25.000Z",
      "text": "Примерно так:https://habr.com/ru/articles/817117/"
    },
    {
      "id": 28725424,
      "author": "ahdenchik",
      "datetime": "2025-08-19T05:02:00.000Z",
      "text": "CUDA-ускорение - технология NVIDIAНедавно открыл для себя Vulkan API. Там предлагается загружать в GPU скомпилированные в некоем промежуточном формате бинарники с шейдерами, которые в процессе загрузки в GPU будут скомпилированы в нативный код для конкретного видеопроцессораВопрос: почему CUDA всё ещё важна? Почему на неё делают упор в статьях про ML?"
    },
    {
      "id": 28725464,
      "author": "ahdenchik",
      "datetime": "2025-08-19T05:13:06.000Z",
      "text": "Но и здесь есть нюанс: один и тот же человек в куртке и без неё, в кепке или с распущенными волосами, зачастую определяется как разные личности - видимо надо где-то крутить настройки.Можно попробовать распознавать походку"
    },
    {
      "id": 28725472,
      "author": "empenoso",
      "datetime": "2025-08-19T05:15:28.000Z",
      "text": "Эта статья просто исследовательская проверка возможностей GPU. К тому же текст вероятно затрагивает законы, о которых я не задумывался."
    },
    {
      "id": 28725508,
      "author": "ahdenchik",
      "datetime": "2025-08-19T05:27:29.000Z",
      "text": "Никакой закон не запрещает распознавать (лица, походку), писать софт для этого и распространять его"
    },
    {
      "id": 28725546,
      "author": "empenoso",
      "datetime": "2025-08-19T05:37:43.000Z",
      "text": "Мне подсказали что 152 фз."
    },
    {
      "id": 28728014,
      "author": "Newcss",
      "datetime": "2025-08-19T14:40:19.000Z",
      "text": "Неповерите, но можно руками в папочку с лицом положить другие его фотки и система точнее сможет определять этого человека...."
    },
    {
      "id": 28727944,
      "author": "Newcss",
      "datetime": "2025-08-19T14:26:14.000Z",
      "text": "Поздравляю Вас с изобретением велосипеда. Вместо тогг чтобы поискать что уже до вас сделано и какие есть решения, вы решили изобрести очередной костыль. Потом вы узнаете, что вместо всего потока данных можно анализировать только кусочек 3 секунды до и 3 секунды после, можно определять пол и возраст, а так же курьеров. А потом для себя вы откроете решение под названием frigate nvr с возможностью интегрироваться с HA. Ну и на последок, чтобы не заниматься подобными изысканиями давно уже придуман - docker. Достаточно было взять образ с предустановленной  cuda и доставить туда dlib.  Но видимо желание провести не один час любви со сборкой исходников взял верх."
    },
    {
      "id": 28728188,
      "author": "empenoso",
      "datetime": "2025-08-19T15:30:58.000Z",
      "text": "Спасибо, всё по делу. Проголосовал за вас"
    },
    {
      "id": 28730608,
      "author": "Gordon01",
      "datetime": "2025-08-20T08:11:18.000Z",
      "text": "Почему не подошло принести зависимости через nix, ну или как выше, собрать в докере?"
    }
  ]
}