{
  "url": "https://habr.com/ru/articles/942232/comments/",
  "article_id": 942232,
  "title": "Как локально и бесплатно распознать текст лекции или совещания и делать это регулярно",
  "comments": [
    {
      "id": 28783540,
      "author": "granv1",
      "datetime": "2025-09-02T01:29:23.000Z",
      "text": "а в docker не хотелось собирать?"
    },
    {
      "id": 28783572,
      "author": "empenoso",
      "datetime": "2025-09-02T02:09:10.000Z",
      "text": "Docker - хороший вариант для удобного развёртывания. Но в статье я специально показал самый простой путь для любого новичка.P.S. Контейнер соберу позже."
    },
    {
      "id": 28783628,
      "author": "PopovPS",
      "datetime": "2025-09-02T02:40:43.000Z",
      "text": "А как решаете вопрос со специализированными терминами? Мы пробовали такой подход на лекциях медицинской тематики. Оказалось что с терминологией whisper работает, прямо скажем, не очень хорошо. А поскольку нам это нужно было для дальнейшего перевода лекций на язык студентов, это оказалось серьезной проблемой."
    },
    {
      "id": 28783642,
      "author": "LittleMeN",
      "datetime": "2025-09-02T02:52:43.000Z",
      "text": "Попробуйте постобработкой с локальной llm. В промпт зашиваете специфические термины, и просьбу исправить после whisper который ошибся при распознавании.Если все равно плохо выходит — увы только дообучать whisper под свою терминологию"
    },
    {
      "id": 28783718,
      "author": "LittleMeN",
      "datetime": "2025-09-02T03:59:32.000Z",
      "text": "Кстати в whisper.cpp можно задать инициирующий промпт с терминологией:./main -m models/ggml-large-v3.bin -f lecture.wav--language en --temperature 0 --beam-size 5--initial-prompt \"Today we discuss cardiology: myocarditis, troponin, echocardiography, ACE inhibitors, beta-blockers, atrial fibrillation, heparin, warfarin, NOACs...\""
    },
    {
      "id": 28783730,
      "author": "PopovPS",
      "datetime": "2025-09-02T04:06:24.000Z",
      "text": "Как вариант для английского хорошо. Но с русским языком работает через раз."
    },
    {
      "id": 28784178,
      "author": "Gar02b",
      "datetime": "2025-09-02T06:26:59.000Z",
      "text": "А может ли ИИ делать де-диареизацию (она же - \"горловое пение докладчика\")? Это когда \"Наша а-а-а-а команда разработала а-а-а-а решение а-а-а-а, которое м-м-м...\".Актуально, к сожалению, везде: и на совещаниях, и на вебинарах."
    },
    {
      "id": 28786222,
      "author": "sneg2015",
      "datetime": "2025-09-02T12:55:39.000Z",
      "text": "Я использую приложение чатГПТ на маке. Оно позволяет записывать аудио и отправлять его Чат гпт, который потом его расшифровывает и анализирует. Думаю ещё можно нуотбукЛМ для этих целей использовать. Но о приватности тут конечно речи не идёт."
    },
    {
      "id": 28806028,
      "author": "Ralory",
      "datetime": "2025-09-07T04:47:40.000Z",
      "text": "Я использовал гемини для транскрипции стримов, тк там контекстное окно позволяет загружать аудио до 9 часов (если только аудио, проста расходует токены). Но работает не всегда хорошо"
    },
    {
      "id": 28787526,
      "author": "astenix",
      "datetime": "2025-09-02T18:01:00.000Z",
      "text": "Мои скрипты скриптее ваших! Транскрибирование через Whisper на bashhttps://github.com/testitquickly/bystro.whisperТам тоже всё запускается через питоновский venv, и недавно добавил дополнительную обработку текста черезsentence-transformer, который работает на Pythong, поэтому «чистый bash» отпадает.И описание проекта будет сделано только в финале — еще надо развести настройки на две ветви, чтобы поменьше что-то переписывать, если для работы доступен только CPU. А и когда есть GPU, надо тонко балансировать нагрузку на CPU, бо Whisper начинает активно жарить только одно ядро, даже если их множество.И с качеством итоговых текстов ещё получается криво, даже при запуске на самой старшей модели. Без сохранения исходного звука и субтитров к нему в файле vtt автору бывает сложно понять, о чем автор говорил, глядя в транскрибированный текст. Раньше это частично решалось тем, что транскрибаторы иногда что-то переписывали «на понятный язык», а сейчас куда всё подевалось…"
    },
    {
      "id": 28788444,
      "author": "empenoso",
      "datetime": "2025-09-03T01:19:46.000Z",
      "text": "Хорошо"
    },
    {
      "id": 28787764,
      "author": "meeshanya",
      "datetime": "2025-09-02T19:03:25.000Z",
      "text": "Совершенно не волнуюсь о приватности не грею свое железо - гоняю с таким же успехом гугловские машины на колабе, часовая лекция на модели large транскрибируется минут за 10."
    }
  ]
}