{
  "url": "https://habr.com/ru/articles/944670/comments/",
  "article_id": 944670,
  "title": "Как получать котировки с любых сайтов в Эксель на примере investing.com",
  "comments": [
    {
      "id": 28813756,
      "author": "alexzen",
      "datetime": "2025-09-09T02:45:27.000Z",
      "text": "Недавно тоже была задача получения курсов валют. У Центробанка РФ есть открытое бесплатное API, через которое можно получать данные о валютах в XML. Плюсы, что не нужно заморчачиваться с эмуляцией браузера и обходить защиту от парсинга."
    },
    {
      "id": 28813804,
      "author": "empenoso",
      "datetime": "2025-09-09T03:29:25.000Z",
      "text": "Я знаю, но это пример о другом - о том что можно получать любые данные практически с любых сайтов для личного использования"
    },
    {
      "id": 28814132,
      "author": "catBasilio",
      "datetime": "2025-09-09T05:36:17.000Z",
      "text": "Excel: это удобно,бесплатноВообще-то msoffice не бесплатный (мы же не говорим про пиратство?)А так есть реально бесплатные аналоги - LibreOffice со своими блекджеками"
    },
    {
      "id": 28814164,
      "author": "empenoso",
      "datetime": "2025-09-09T05:45:44.000Z",
      "text": "Мы только про домашнее использование говорим.Да, я знаю про LibreOffice - на нём тоже эта схема будет работать."
    },
    {
      "id": 28814456,
      "author": "KSLcom",
      "datetime": "2025-09-09T06:57:11.000Z",
      "text": "Для самых простых задач этого хватит, но в Office есть стандартный механизм с куда более широкими возможностями."
    },
    {
      "id": 28814694,
      "author": "empenoso",
      "datetime": "2025-09-09T07:53:48.000Z",
      "text": "Но Power Query настраивать надо"
    },
    {
      "id": 28815388,
      "author": "slavius",
      "datetime": "2025-09-09T09:52:08.000Z",
      "text": "Спасибо, попробуем.А можно проверить - обрабатываетсяhttps://www.lme.com/en/Metals/Non-ferrous/LME-Copper#Trading+summary? Там cloudflare проверка на человека. Ну что-бы зря не ставить весь проект..."
    },
    {
      "id": 28816230,
      "author": "empenoso",
      "datetime": "2025-09-09T12:53:00.000Z",
      "text": "Любой сайт можно. По подобной схеме через скрипт-прокладку так точно"
    },
    {
      "id": 28816478,
      "author": "KEugene",
      "datetime": "2025-09-09T13:51:43.000Z",
      "text": "А почему бы не вставить питоновский скрипт прямо в Эксель? То есть, это будет функция на Питоне."
    },
    {
      "id": 28816910,
      "author": "empenoso",
      "datetime": "2025-09-09T15:36:52.000Z",
      "text": "Я выбрал использовать Python скрипт отдельно от встроенный функции Python в Excel, потому что встроенная функция накладывает множество ограничений. Например, у меня был Microsoft Office 2021 - в нём функции Python нет. Пришлось установить Microsoft Office 2024 - только в нём есть встроенный Python в Excel. Но и этого оказалось недостаточно чтобы запускать встроенный Python в Excel. Необходимо иметь Office 365 (Mondo 2016) подписку, чтобы функция активировалась. И будет работать только под Windows. Да и сам Python в Excel обрезанный, можно использовать только библиотеки рекомендованные Microsoft и Anaconda."
    }
  ]
}