{
  "url": "https://habr.com/ru/articles/948224/comments/",
  "article_id": 948224,
  "title": "Можно ли войти в реку Технотекста дважды? А трижды? Анализ победителей Хабра за 7 лет",
  "comments": [
    {
      "id": 28878968,
      "author": "kesn",
      "datetime": "2025-09-25T07:09:25.000Z",
      "text": "Как судья одного из технотекстов, могу сказать, что рецепт есть и достаточно формализован: хорошо оформляйте статью, не лейте воду и пишите материал, который несёт какую-то пользу читателям или затрагивает актуальную проблему. Что интересно, тут нет пунктов \"высокий рейтинг\" и \"много просмотров\"."
    },
    {
      "id": 28879016,
      "author": "haqreu",
      "datetime": "2025-09-25T07:19:11.000Z",
      "text": "Высокий рейтинг и много просмотров часто являются следствием хорошо оформленной статьи, которая несёт пользу читателям или затрагивает актуальную проблему."
    },
    {
      "id": 28879020,
      "author": "empenoso",
      "datetime": "2025-09-25T07:20:15.000Z",
      "text": "Не всегда это связано мне кажется"
    },
    {
      "id": 28879062,
      "author": "haqreu",
      "datetime": "2025-09-25T07:29:42.000Z",
      "text": "Чем более узкая тема, тем меньше просмотров, и как следствие, рейтинг. Но тем не менее, хорошо поданная актуальная тема всегда лучше оценивается, нежели скучная/неактуальная, да и поданная плохо :)"
    },
    {
      "id": 28879036,
      "author": "dmitriyrudnev",
      "datetime": "2025-09-25T07:24:23.000Z",
      "text": "Для информации коллеге@empenosoСкрытый текст"
    },
    {
      "id": 28879076,
      "author": "empenoso",
      "datetime": "2025-09-25T07:32:58.000Z",
      "text": "А в таблице только одна статья:https://habr.com/ru/companies/ruvds/articles/789418/Видимо где-то пропустил строчку при сборе данных. Приношу извинения!"
    },
    {
      "id": 28879042,
      "author": "haqreu",
      "datetime": "2025-09-25T07:25:53.000Z",
      "text": "В первые годы (2018-2019) бал правили фундаментальные технологии: системное программирование, алгоритмы, архитектура баз данных. Тогда Хабр был настоящей площадкой для «гиков».Затем фокус сместился. В 2020-2021 годах в лидерах оказались статьи о процессах и DevOps: CI/CD, культура команд, автоматизация тестирования.Я больше скажу, фундаментальных технологий не было даже всписке темпоследнего технотекста. А можно заглянуть ещё ближе. Вот я написал на прошлой неделе пару статей про то, как числа представляются внутри компьютера. Хабр при написании статьи меня заставляет выбрать целевую аудиторию. Плавающая точка - это фронт или бэк?Просто основы информатики не вписываются ни в одну из категорий целевой аудитории на хабре."
    },
    {
      "id": 28879094,
      "author": "empenoso",
      "datetime": "2025-09-25T07:38:35.000Z",
      "text": "Согласен, например писал про расшифровку аудио недавно - куда это отнести?"
    },
    {
      "id": 28886424,
      "author": "vasily-v-ryabov",
      "datetime": "2025-09-26T14:55:23.000Z",
      "text": "Да, «системное программирование» добавить было бы неплохо."
    },
    {
      "id": 28886722,
      "author": "haqreu",
      "datetime": "2025-09-26T16:27:13.000Z",
      "text": "Да меня бы и просто \"программирование\" устроило бы :)"
    }
  ]
}