{
  "url": "https://habr.com/ru/articles/948894/comments/",
  "article_id": 948894,
  "title": "«Просто используй Docker» — мой путь от Whisper к WhisperX",
  "comments": [
    {
      "id": 28870080,
      "author": "JuryPol",
      "datetime": "2025-09-23T03:11:48.000Z",
      "text": "Это был настолько лучший результат«вам дали гораздо лучший мех. Это шанхайские барсы». Да уж... И ведь ничего не ворохнулось...что я смог передать его большой языковой модели (LLM) и получить глубокий анализ одной очень важной для меня личной ситуации - под таким углом, о котором я сам бы никогда не задумался....Я понял, что их главная ценность «ИИ-диктофонов» - не в способности записывать каждый ваш шаг, а в умении превращать хаос человеческого общения в структурированные, машиночитаемые данные.«Роскошь человеческого общения»... Да ну на... Еще пяток Docker'ов и вообще все ваши разговоры можно будет отдать на откуп LLM . Структурированно и машиночитаемо будет..."
    },
    {
      "id": 28870196,
      "author": "empenoso",
      "datetime": "2025-09-23T04:34:18.000Z",
      "text": "(это не я минус поставил)"
    },
    {
      "id": 28870228,
      "author": "Vlad_06",
      "datetime": "2025-09-23T04:49:23.000Z",
      "text": "А вы не сталкивались при использовании Whisper с ситуацией, что он пропускает некоторые фрагменты (размером в  2-3 предложения)? На записи они есть, речь звучит точно также, а в расшифровке - даже намека нет.При этом Whisper.cpp просто молча проходит мимо, а faster-whisper выдает в таких местах  \"Добрый день!\", \"Мы снова в эфире\", \"Подписывайтесь...\". Выглядит так, словно модель чрезмерно настойчиво пытается быть умной, и если в какой-то момент у нее не получается построить связные (с ее точки зрения) предложения, она просто пропускает этот кусок речи."
    },
    {
      "id": 28870278,
      "author": "empenoso",
      "datetime": "2025-09-23T04:52:39.000Z",
      "text": "Да, я тоже замечал такие моменты. Думаю, многое зависит от качества записи и фонового шума - иногда модель спотыкается и перескакивает. Но для моих задач это не критично: важнее сохранить общий смысл и структуру диалога, чем каждое отдельное слово"
    },
    {
      "id": 28870384,
      "author": "pol_pot",
      "datetime": "2025-09-23T05:29:20.000Z",
      "text": "В больших записях часто бывает что целые абзацы пропадают. Приходится использовать джемини вместо виспера. У него тоже бывают ИИ глюки, но вроде поменьше чем у виспера."
    },
    {
      "id": 28892140,
      "author": "novomir",
      "datetime": "2025-09-28T12:53:13.000Z",
      "text": "Сталкивался, этот момент обычно на длинных аудио, в этом случае whisper делит на части и в итоге на стыке частей могут появляться проблемы. Настраивал его через ChatGPT, он мне это подсвечивал при настройке"
    },
    {
      "id": 28870354,
      "author": "utya",
      "datetime": "2025-09-23T05:20:35.000Z",
      "text": "Все классно в whisperx кроме pyanote с лицензией."
    },
    {
      "id": 28870628,
      "author": "empenoso",
      "datetime": "2025-09-23T06:31:12.000Z",
      "text": "Вроде просто форму заполнить под логином?"
    },
    {
      "id": 28871342,
      "author": "utya",
      "datetime": "2025-09-23T09:14:02.000Z",
      "text": "Платная для коммерческого использования. Только если втихаря использовать. Кстати я крутил на 1080. Нормально работает митинги по 40 минут"
    },
    {
      "id": 28871434,
      "author": "empenoso",
      "datetime": "2025-09-23T09:33:44.000Z",
      "text": "У меня только личное. 18 часов распознавал в файле. Там не всё запись только была"
    },
    {
      "id": 28871430,
      "author": "Scorygel",
      "datetime": "2025-09-23T09:32:34.000Z",
      "text": "а в тексте я пропустил это? или надо отдельно все что вы описали сделать, и потом получать лицензию?"
    },
    {
      "id": 28871440,
      "author": "empenoso",
      "datetime": "2025-09-23T09:34:49.000Z",
      "text": "Подготовка:Docker и NVIDIA GPU:для работы требуется установленный Docker и видеокарта NVIDIA с актуальными драйверами.Токен Hugging Face:для диаризации необходим токен доступа.Получите его внастройках профиля Hugging Face.Примите условия использования моделейpyannote/speaker-diarization-3.1иpyannote/segmentation-3.0.Из гитхаба:https://github.com/empenoso/offline-audio-transcriber"
    },
    {
      "id": 28870606,
      "author": "HepoH",
      "datetime": "2025-09-23T06:25:36.000Z",
      "text": "Смог запустить на CPU в wsl2: запись длиной две с половиной минуты обрабатывал 3 с половиной минуты на ryzen 5600x.Начало серии КЯВВМ застенографировал неплохо. Единственное, что не хватает — это саммари по получившейся стенографии, пока что пришлось в чатгпт закинуть, но на больших совещаниях такое не прокатит."
    },
    {
      "id": 28870632,
      "author": "empenoso",
      "datetime": "2025-09-23T06:32:15.000Z",
      "text": "Как я встретил вашу маму?Почему не прокатит?"
    },
    {
      "id": 28870662,
      "author": "HepoH",
      "datetime": "2025-09-23T06:43:02.000Z",
      "text": "Как я встретил вашу маму?Ага.Почему не прокатит?Потому что совещания обычно длятся сильно дольше трех с половиной минут. Хотя, если прикрепить текстовый файл, а не закинуть его содержимое, возможно и получится получить таким образом саммари длинного обсуждения, но хотелось бы конечно чтобы все локально уже генерировалось.А так в целом результат очень даже хороший и получилось запустить почти без каких-либо проблем, спасибо за вашу работу!"
    },
    {
      "id": 28870844,
      "author": "empenoso",
      "datetime": "2025-09-23T07:25:25.000Z",
      "text": "А причём здесь три с половиной минуты?Я скриптом расшифровывал 18 часов записи"
    },
    {
      "id": 28871080,
      "author": "HepoH",
      "datetime": "2025-09-23T08:21:10.000Z",
      "text": "Речь не про стенографирование аудио в текст, а про получение саммари (выжимки основных тем и резюмирования разговора) из полученного текста."
    },
    {
      "id": 28871190,
      "author": "holgw",
      "datetime": "2025-09-23T08:39:39.000Z",
      "text": "Получение саммари к Whisper никакого отношения не имеет, это модель для перевода аудио в текст.Если хотите чтоб саммари локально генерировался, то придется рядом с whisper разворачивать LLM (делается просто через UI, при помощи LM Studio, например) и руками уже в чат закидывать файл стенограммы с нужной инструкцией."
    },
    {
      "id": 28874148,
      "author": "Thrust813",
      "datetime": "2025-09-24T01:38:00.000Z",
      "text": "Или запускать все через python по очереди: whisper/whisperx, тут же тем же скриптом вызывать llm"
    },
    {
      "id": 28873820,
      "author": "bebych",
      "datetime": "2025-09-23T20:30:05.000Z",
      "text": "Я не умею писать код, но получилось с помощью перплексити поставить whisperx на MacBook air M4. Запускаю через терминал medium модель. Распознает быстро, дольше идёт диаризация. Ругается, кстати, что pyannote у меня версии 3.1, а модель научена на 0.1."
    },
    {
      "id": 28874120,
      "author": "Elaugaste",
      "datetime": "2025-09-24T00:49:08.000Z",
      "text": "Описанные \"проблемы\", а принципе не являются проблемами. Подход с докером весьма упрощает жизнь, если этот самый докер освоить. В случае нормальных образов, сразу есть описание того как образ использовать."
    },
    {
      "id": 28874130,
      "author": "overslepter",
      "datetime": "2025-09-24T01:11:20.000Z",
      "text": "Начало статьи бы подправить. Речь всë же про использование нейросети а не ИИ ."
    },
    {
      "id": 28874152,
      "author": "empenoso",
      "datetime": "2025-09-24T01:38:29.000Z",
      "text": "Сейчас уже в следующий раз только :("
    },
    {
      "id": 28883998,
      "author": "ndubinkin",
      "datetime": "2025-09-26T07:16:50.000Z",
      "text": "для тех кому нужно простое и работающее решение под win (faster whisper, diarization) -https://github.com/Purfview/whisper-standalone-win"
    },
    {
      "id": 28888714,
      "author": "gkaliostro8",
      "datetime": "2025-09-27T11:21:09.000Z",
      "text": "Зачем изобретать велосипед, если он уже создан другими изобретателями)))))@cognitivepro_bot- здесь и аудиотранскрибация и видео и текст и картинки"
    }
  ]
}