{
  "url": "https://habr.com/ru/articles/951288/comments/",
  "article_id": 951288,
  "title": "Побывал в сердце HTF трейдинга России и вот что я понял",
  "comments": [
    {
      "id": 28896798,
      "author": "unicorn_style",
      "datetime": "2025-09-29T14:02:17.000Z",
      "text": "\"представитель «ручного» скальпинга и арбитража, где главное оружие — это глаза трейдера и его умение читать стакан.\"Давайте все таки определим верно понятие. Стакан – визуальное представление для удобства инкрементных данных которые исключают появление там заявок типа AGR и FOK. Т.е всех типов заявок которые используются крупными игроками. Более того общепринятая цифра агрегации 0.25мс, т.е стакан отдается 4 раза в секунду. Так что там глаза анализируют трейдеры?Глеб заметил, что на протяжении нескольких контрактов подряд за 2–3 недели до экспирации в стакане появлялся участник, который начинал агрессивно давить спред вниз огромными заявками‑айсбергами («айсами»)Еще раз зафиксируем. Глеб заметил айсберги которые не отображаются не в ленте сделок, не тем более в ленте инкрементного стакана на !внимание! дериватив. Напомню, дериватив – производный инструмент от БАЗОВОГО АКТИВА, на MOEX он управляется автомейкером. Т.е цена синхронизируется до отправки стакана. Действительно \"decoy price\" можно на фьюче получить, но это крайне редкие кейсы, тем более заметить их глазами....на стаканеЭта ситуация привела к каскадному эффекту. Из‑за давления на фьючерс юаня возникла огромная (до 8-9%!) раздвижка между фьючерсом на доллар и фьючерсом на юань. Те, кто зашортил этот спред на пике, не видя стакана, получили колоссальные убытки. А те, кто, как Глеб, видел, что в стаканах появились аналогичные «айсы», но уже в другую сторону, смогли зайти в сделку на схождение и не только заработать на самом арбитраже, но и получать двойной положительный фандинг.Тут прекрасно все. Мы берем 2 дериватива управляемые автомейкером и рассказываем занимательную историю что мы что-то там заметили и поставили правильно. Это называется азартная игра. И это именно азартная игра, с хорошим исходом. Для того чтобы это перестало быть азартной игрой в тексте (и видимо в выступлении) должен быть рассказ примерно следующий: там где-то на другой бирже после 14:30 пошло неравномерное движение валютных пар, и мы клевые и глазастые ребята заметили это и зашортили/залонговали что-то там и реализовали практически валютный своп. И тут это больше своп, чем арбитраж.Робот может быть лишь исполнителем — он поможет войти в сделку по лучшей цене и безпроскальзываниясмотрим картинку bid/ask стакана. Он может поможет войти в сделку, и даже поможет выйти. Без проскальзывания – тут я очень сильно сомневаюсь. Слева цена актива если что, и это примерно 10 секундный интервал.Так отпустим Глеба, перейдем дальше:Особо Дмитрий отметил, что для написания таких формул сегодня не нужно быть гуру C++. Современные нейросети (он рекомендовал китайскую Qwen и Perplexity для анализа новостей) отлично справляются с переводом бизнес‑логики на язык кода, если им предоставить документацию и примеры.Я согласен что Qwen + Ollama встает в 3-клика, но это больше похоже на привлечение внимания за счет бума нейросетей. Звучит очень здорово и умно, только вот как только ты сталкиваешься с реальной работой с этими LLM оказывается что все таки нужно знать хорошо \"хотя бы\" что-то типа Python, а желательно быть хотя бы знакомым как обучить сеть на TF. Потому что заставить LLM прочитать условный отчет компании и сделать сводку – это доступно на разныз платформах типа Investing. Провести глубокий анализ, тут уже задача со звездочкой. Ты по-сути должен придумать для LLM свой дата-сет куда вгружаются отчеты которые уже распрасили + новости + реальное движение цены за эн период и все это объединить таким образом, чтобы к примеру выходит отчет печально известно Intel и тебе нейросеть еще 2 года назад рассказывает что за счет отделения Intel Foundation компания тянет себя на дно. А ты как трейдер или владелец робота уже выстраиваешь режим работы по этой компании. Это сложнейшая задача, которая требует навыков программирования и очень хорошо разбираться в финансах.Оказывается, для достижения максимальной скорости HFT‑платформа...С помощью коннектора (в их случае — к терминалу «АЛОР Трейд») они в реальном времени собирают реальные данные о сделках от брокера.Значит кто-то бьется над тем чтобы стакан собрать за быстрее 2000ns и покупкой FPGA карт, а кто-то называет HFT Алор Трейд с задержкой больше секунды. Это не претензия, хорошо. Просто забавное наблюдениеРезультат — робот за 3 секунды совершил 3000+ сделок в обе стороныУ меня подключен Fullview америки, там когда дядя Паша (Пауэлл) говорит в пике я видел 110к сделок в секунду на все тикеры NASDAQ без опционов. В среднем 12k-18k rpsСудя по всему речь идет тут о MOEX. Т.е у кого-то робот сделал 3000 сделок за 3 секунды на МОЕКС т.е 1000 сделок в СЕКУНДУ и они прошли. Я специально спросил у своего коллеги кто занимается МОЕКСом, там 1100 спот и столько же фьючи это среднее в секунду.Но самое интересное это конечно лимиты брокеров и лимиты MOEX, да без доп соглашений никто такое не пропустит. На NASDAQ/Cboe мы готовили кипу документов которые снимают лимиты заявок (не сделок), по-умолчанию через TR там было что-то около 30 в секунду. Даже если речь идет о заявках...вы представляете себе вообще торговую систему которая выкидывает не 1000, а хотя бы 100 заявок при всем при этом посчитан баланс, посчитан алгоритм...Можно было дальше разбирать текст по молекулам, уважительно отношусь к автору и читаю его статьи, его поиски...но тут вспоминается песня \"Фантазер...\""
    },
    {
      "id": 28898372,
      "author": "empenoso",
      "datetime": "2025-09-30T01:31:49.000Z",
      "text": "Спасибо за ваш очень подробный комментарий.По поводу докладов - я всего лишь пересказал их содержание, мероприятие было в субботу весь день, статью написал за субботу вечер / воскресенье рано утром - я не проводил анализ это лишь пересказ докладов."
    },
    {
      "id": 28899164,
      "author": "unicorn_style",
      "datetime": "2025-09-30T07:25:52.000Z",
      "text": "К вам нет претензий. Фантазеры - это все остальные"
    }
  ]
}