{
  "url": "https://smart-lab.ru/blog/1087424.php?nomobile=1",
  "article_id": 1087424,
  "title": "Отслеживание позиций торгового робота Московской биржи через CSV файл",
  "comments": [
    {
      "id": 17570610,
      "author": "T-800",
      "datetime": "2024-11-27T06:50:00.000Z",
      "text": "В Квике можно не только через текстовые *.tri файлы работать, но и через Trans2Quik.dllА вообще, удачи в вашем начинании."
    },
    {
      "id": 17570678,
      "author": "akumidv",
      "datetime": "2024-11-27T07:39:00.000Z",
      "text": "По мере усложнения логики код будет сложно поддерживать. Надо разделять на независимые модули. Отделять работу с апи брокером от логики, логику от конфигурирования. Модель данных выносить. Как минимум попробуйте паттерн Model-View-Controller. Но я бы добавил Interface к брокеру в этот паттерн — там часто нужно контроль кол-ва запросов делать, чтобы лимиты не привысить.Сохранение не потокобезопасное — будут ошибки при синхронной записи и считать. Очередь поможет.И новые функции лучше разрабатывать через тесты — тестирование позволит делать менее связанный код, его потом легче поддерживать и модифицировать. Ну а тесты позволят прогонять функционал и быть более уверенным, что работает.Из простых решений еще можно ESLint добавить в проект — он будет помогать ошибки находить и стиль поддерживать.Сам JS для бота сложный выбор. Проще питон подучить и на нем делать. Там хотя бы pandas и numba с Jit копиляцией есть и мультипроцессорность понятная.PS логи и данные в проекте — зло."
    },
    {
      "id": 17570691,
      "author": "IliaM",
      "datetime": "2024-11-27T07:43:00.000Z",
      "text": "QUIK конечно поразительная программа, в эпоху санкций, работающая на Windows. За 20 лет, могли бы и кроссплатформенность добавить. А вам удачи."
    },
    {
      "id": 17571303,
      "author": "SergeyJu",
      "datetime": "2024-11-27T10:07:00.000Z",
      "text": "У квика всегда были конкуренты, которые так и не распространились.У гуты-банка, у Цериха, у Атона, у Альфы, у Айти-инвеста, был еще  нет-трейдер и это неполный список. И, насколько я знаю, из под линукса на квике торгуют.Что касается авторского проекта, если рассматривать его как рабочий макет, то все здорово. Осталось понять косяки, учесть принципиальные недостатки и написать заново.Автор, как я понимаю, пишет быстро, так что все в его руках."
    },
    {
      "id": 17572894,
      "author": "Михаил Шардин",
      "datetime": "2024-11-27T13:03:00.000Z",
      "text": "SergeyJu, линукса на квике скорее всего через эмулятор. Тот же Wine например"
    },
    {
      "id": 17572993,
      "author": "SergeyJu",
      "datetime": "2024-11-27T13:16:00.000Z",
      "text": "Михаил Шардин, т-банк плохой брокер.По хорошему бы надо для надежности получать данные от двух разных брокеров. Ну и деньги по счетам разложить.  Например, на одном создать пассивный портфель. А торговать на втором активно.Да, и учтите, данные об транзакциях могут иногда теряться. Систем должна быть устойчива к максимально большому спектру искажений в данных. Не  в смысле частоты появления, а в смысле критичности дла портфеля.Быстрый робот моего знакомого как-то, теряя подтверждения о сделках, считал, что сделка не проведена и долбал снова и снова, пока не вышел на максимально возможное плечо."
    },
    {
      "id": 17573610,
      "author": "Denis",
      "datetime": "2024-11-27T14:34:00.000Z",
      "text": "Михаил Шардин, Wine не эмулятор, а имплементация подмножества Win API для запуска под X. Для маков тоже должен быть.Гораздо проще использовать нативный Офис/Excel, да и Квик от них ничем не отличается. Просто рисуется все не в винде, а в Линуксе."
    },
    {
      "id": 17571995,
      "author": "Константин Лебедев",
      "datetime": "2024-11-27T11:24:00.000Z",
      "text": "Тебя T-bank дурит и на самом деле об заявки обрабатывает у себядля выходя на прямую лучше использоватьgithub.com/kmlebedev/txmlconnectorДа он немного легаcи, но это прямо прямой доступ, там есть пример как данные выгрузить в клик, а дальше можно с ними вертеть как захочешь."
    },
    {
      "id": 17572968,
      "author": "Slan",
      "datetime": "2024-11-27T13:13:00.000Z",
      "text": "что мешает в json формате хранить данные? их и получать обратно проще нативными методами. зачем эта компиляция в csv туда-сюда? Ну и раз предполагается хранение — не имеет ли смысл использовать базу данных?"
    },
    {
      "id": 17573001,
      "author": "SergeyJu",
      "datetime": "2024-11-27T13:17:00.000Z",
      "text": "Slan, конечно, данные должны быть в базе. И структура базы не самое последнее дело при проектировании."
    },
    {
      "id": 17576237,
      "author": "amberfoxman",
      "datetime": "2024-11-27T19:29:00.000Z",
      "text": "Slan, база -  это сразу сложность на ступень выше, а выгоды сомнительные, csv достаточно, если масштаб не тиковый, конечно, без стакана и ордерлога"
    },
    {
      "id": 17577177,
      "author": "Beach Bunny",
      "datetime": "2024-11-27T21:37:00.000Z",
      "text": "Для Backtrader есть готовы коннектор для Тинька, смысл писать велосипед на JSgithub.com/cia76/TinkoffPy"
    }
  ]
}