{
  "url": "https://smart-lab.ru/blog/1126711.php?nomobile=1",
  "article_id": 1126711,
  "title": "Тестирование торговой стратегии с использованием нового индикатора Джона Ф. Элерса на Python для дневных данных Московской биржи",
  "comments": [
    {
      "id": 17969879,
      "author": "Хоббит",
      "datetime": "2025-03-11T06:48:00.000Z",
      "text": "Не работаютbacktesting.py => backtesting.ru?"
    },
    {
      "id": 17969882,
      "author": "Михаил Шардин",
      "datetime": "2025-03-11T06:47:00.000Z",
      "text": "Хоббит, это ведь не ссылка… так библиотека называетсяВот ссылка:https://kernc.github.io/backtesting.py/"
    },
    {
      "id": 17970061,
      "author": "Михаил Шардин",
      "datetime": "2025-03-11T08:35:00.000Z",
      "text": "Сергей Сергаев, например в каком направлении? Одним словом"
    },
    {
      "id": 17970148,
      "author": "Noname",
      "datetime": "2025-03-11T08:57:00.000Z",
      "text": "Решение запаздывания скользящий средней решается уменьшением таймфрейма, у Элиота в то время этой возможности не было, у нас есть.15ma на часовом таймфрейме равна 900ma на минутном таймфрейме. Проблема решена)"
    },
    {
      "id": 17970226,
      "author": "SergeyJu",
      "datetime": "2025-03-11T09:13:00.000Z",
      "text": "Никита Шляпников, зачем 15 минут. Сама цена и есть неотстающий индикатор."
    },
    {
      "id": 17970251,
      "author": "Noname",
      "datetime": "2025-03-11T09:20:00.000Z",
      "text": "SergeyJu, 15ma часового таймфрейма -> 15 moving avarange for timeframe 1 hours. Скользящие средние базис всех индикаторов и служит для принятия решения. Проблема большинства индикаторов строящихся на цене состоит в том что заранее не известно как закроется временной период (например часовик, при этом волатильность в течение часа может быть существенной) поэтому индикаторы на бектесте работают отлично, а в реальности ужасно, из-за эффекта запаздывания и несвоевременно принятого решения."
    },
    {
      "id": 17970299,
      "author": "SergeyJu",
      "datetime": "2025-03-11T09:31:00.000Z",
      "text": "Никита Шляпников,1. Скользяшки не базис, поскольку есть системы,  в которых вообще не используются скользяшки.2. У А.Г., если взять публичный пример,  используются условные приказы. Например, если цена пробьет такой-то уровень, купить или продать. Эти уровни вычисляется наперед  и иногда корректируются. То есть нет прогноза ровно на час или ровно на день."
    },
    {
      "id": 17970222,
      "author": "Михаил Шардин",
      "datetime": "2025-03-11T09:11:00.000Z",
      "text": "Сергей Сергаев, вы имеете ввиду что если стратегия показывала хорошие результаты на исторических данных, это не означает, что она будет работать в будущем.Но я-то думал что единственное слово будет что-то вроде «фундаментал»."
    },
    {
      "id": 17970247,
      "author": "SergeyJu",
      "datetime": "2025-03-11T09:19:00.000Z",
      "text": "Не понял методологический посыл статьи.Если тестируется индикатор, так надо на всех ликвидных в одном и том же временном окне его и бэктестить.А если тестируется выбор сильнейшей акции по типу моментума, но на новом индикаторе, тоже проще было бы прогнать на фиксированном наборе акций, тем более, что список ликвидных за последние 5 лет не сильно изменился."
    },
    {
      "id": 17970255,
      "author": "RiskTrader",
      "datetime": "2025-03-11T09:20:00.000Z",
      "text": "Сергей Сергаев, ты нашел?)"
    },
    {
      "id": 17970263,
      "author": "OnlyHuman",
      "datetime": "2025-03-11T09:23:00.000Z",
      "text": "Спасибо за такой качественный и подробный пример. Сам потихоньку копаюсь в Python, ваш код мне будет очень полезен для дальнейшего погружения в эту тему."
    },
    {
      "id": 17970276,
      "author": "Михаил Шардин",
      "datetime": "2025-03-11T09:25:00.000Z",
      "text": "OnlyHuman, на гитхабе выложил. Ещё туда залью — пока остановился немного.Для фьючерсов сделал что-то похожее только без библиотеки aiomoex.Всё таки проще без неё похоже работать напрямую с API Мосбиржи"
    },
    {
      "id": 17970282,
      "author": "Михаил Шардин",
      "datetime": "2025-03-11T09:26:00.000Z",
      "text": "Сергей Сергаев, просто общие слова"
    },
    {
      "id": 17970298,
      "author": "Riskplayer",
      "datetime": "2025-03-11T09:30:00.000Z",
      "text": "Если стоит Python в сборке от Anaconda, то установка ta-lib очень простая."
    },
    {
      "id": 17970317,
      "author": "RiskTrader",
      "datetime": "2025-03-11T09:37:00.000Z",
      "text": "Сергей Сергаев, в процессе)"
    },
    {
      "id": 17970329,
      "author": "SergeyJu",
      "datetime": "2025-03-11T09:41:00.000Z",
      "text": "Кстати, а угол наклона считается по ценам или по самой скользяшке и как связаны временное окно расчета линейной регрессии и параметр скользяшки."
    },
    {
      "id": 17970444,
      "author": "SergeyJu",
      "datetime": "2025-03-11T10:06:00.000Z",
      "text": "Сергей Сергаев, неэргодичные ряды бывают разные. Также как и нестационарные.Фишка в том, что стандартные критерии оптимальности для фильтров, что ВЧ, что НЧ, что Гильберта не подходят для ценовых рядов. Поэтому приходится эмпирически  выбирать тот или иной фильтр. Я не нашел преимуществ стандартных фильтров перед экспоненциальной скользяшкой. Да и адаптивные скользяшки не порадовали, тут я согласен."
    },
    {
      "id": 17970807,
      "author": "Дмитрий Овчинников",
      "datetime": "2025-03-11T11:13:00.000Z",
      "text": "И в отличие от MetaTrader, StockSharp, TSLab и Quik, которые работают с Московской биржей, но требуют Windows, если брокер имеет API, то можно запускать скрипт на любом сервере, включая облачные решения и Raspberry Pi.Не уловил в чем именно торговое преимущество."
    },
    {
      "id": 17970855,
      "author": "Noname",
      "datetime": "2025-03-11T11:25:00.000Z",
      "text": "Сергей Сергаев, я в настоящее время использую скользящую среднюю как базис, потому что есть одно фундаментальное правило — цена не может бесконечно долго отклоняться от скользящей средней, и из этого правила можно черпать закономерности связи двух параметров цена-время, второе правило цена не может бесконечно далеко уйти от скользящей средней, поэтому можно находить закономерности и оценивать в какой стадии тренда сейчас находиться инструмент, отличие боковика от тренда — степень отклонения от своей средней цены."
    },
    {
      "id": 17971531,
      "author": "SergeyJu",
      "datetime": "2025-03-11T13:21:00.000Z",
      "text": "Никита Шляпников, Ваш подход вполне имеет право на жизнь. Только он далеко не единственный."
    },
    {
      "id": 17971791,
      "author": "Noname",
      "datetime": "2025-03-11T14:09:00.000Z",
      "text": "Сергей Сергаев, биржа все таки не рандом, тут есть пределы волатильности и профессиональные участники которые контролируют движение цены"
    }
  ]
}