{
  "url": "https://smart-lab.ru/blog/1134901.php?nomobile=1",
  "article_id": 1134901,
  "title": "Заметка на тему индикатора измерения силы тренда",
  "comments": [
    {
      "id": 18048193,
      "author": "amberfoxman",
      "datetime": "2025-03-31T08:42:00.000Z",
      "text": "идея. не факт что сильно улучшит, но точно даст пищу для размышления* отклонение от среднего имеет некоторое распределение* когда значение отклонения слишком большое или слишком маленькое — повышается вероятность того, что следующий день будет в сторону приближения к среднему* в первом приближении распределение можно считать нормальным и отклонения измерять в сигмах"
    },
    {
      "id": 18048475,
      "author": "SergeyJu",
      "datetime": "2025-03-31T09:48:00.000Z",
      "text": "LN(price/EMA(price))По мне, так это вариант осциллятора. Можно, если поднапрячь зрение, увидеть не силу тренда, а зоны перепроданности и перекупленности.Впрочем, все простое придумано до нас. И основная часть сложного тоже."
    },
    {
      "id": 18049249,
      "author": "Replikant_mih",
      "datetime": "2025-03-31T12:10:00.000Z",
      "text": "SergeyJu, Это всё условно. Зона перепроданности, перекупленности, по сути это какое-то время идущий тренд на меньшем интервале."
    },
    {
      "id": 18049441,
      "author": "SergeyJu",
      "datetime": "2025-03-31T12:53:00.000Z",
      "text": "Replikant_mih, все условно и это условно."
    },
    {
      "id": 18050670,
      "author": "Replikant_mih",
      "datetime": "2025-03-31T17:59:00.000Z",
      "text": "SergeyJu, Ну просто люди сами себе часто шоры выставляют всякими ярлыками, мутными классификациями и подобным)."
    },
    {
      "id": 18048874,
      "author": "Riskplayer",
      "datetime": "2025-03-31T10:56:00.000Z",
      "text": "Как вариант. В свое время Кауфман предложил индикатор ER (Efficiency Ratio), которое по сути измеряет силу тренда и используется в его адаптивной средней."
    },
    {
      "id": 18049277,
      "author": "Shara",
      "datetime": "2025-03-31T12:17:00.000Z",
      "text": "У меня почему то индикатор появился не полностью, только нижняя часть.Без обьемов. В чем может быть причина?Или нужно отдельно индикатор Обьема ставить на график."
    },
    {
      "id": 18049760,
      "author": "Михаил Шардин",
      "datetime": "2025-03-31T14:05:00.000Z",
      "text": "Shara, попробуйте другой таймфрейм выбрать"
    },
    {
      "id": 18049429,
      "author": "svgr",
      "datetime": "2025-03-31T12:47:00.000Z",
      "text": "Как этим практически пользоваться, чтобы извлекать прибыль? В статье не хватает такого раздела.Аналогичные идеи приводят к несложным выводам:Как совершенно верно заметил вышеamberfoxman, нужно найти такие значения текущего отклонения, при входе на которых затем получите статистический плюс при чем-то обоснованном выходе. Например, аналогичном показателе в противоположную сторону. Обычно это 2-4% отклонения. Причём для каждого инструмента диапазон свой.Эффект от подхода — около половины отданных при этом сумм комиссий. То есть, если при случайном входе вы статистически проигрываете комиссию, то тут станете проигрывать полкомиссии."
    },
    {
      "id": 18049765,
      "author": "Михаил Шардин",
      "datetime": "2025-03-31T14:06:00.000Z",
      "text": "svgr, это как раз самый интересный вопрос и его в заметке нет."
    },
    {
      "id": 18050230,
      "author": "svgr",
      "datetime": "2025-03-31T15:50:00.000Z",
      "text": "Михаил Шардин, ну, вот я и описал, что примерно будет по итогам тестов в лучшем случае. На плохих инструментах и этого не будет.Проверял такое в 2015-2018.Потом додумал как дальше улучшить результативность и всё же в плюсы систематически выйти."
    }
  ]
}