{
  "url": "https://smart-lab.ru/blog/1144486.php?nomobile=1",
  "article_id": 1144486,
  "title": "Раздельное тестирование на скриптовом языке TradingView выходов торговой системы: обычный трейлинг стоп и ATR стоп",
  "comments": [
    {
      "id": 18134925,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T06:48:00.000Z",
      "text": "VLTorgovie, да, классическая модель трейлинга действительно включает эти параметры.Я в своей версии реализовал это через Pine Script, и всё прозрачно — можно посмотреть, как работает логика, где формируются уровни, и когда именно идёт смещение.Главное отличие в том, что ваше мнение субъективно («не нравится, не использую»), а у меня — проверяемая и воспроизводимая реализация с открытым исходником."
    },
    {
      "id": 18134974,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T07:20:00.000Z",
      "text": "VLTorgovie, если вы действительно проводили тесты на 43 фьючерсах ММВБ — это здорово.Что касается SI и стопа 1.5% — он использовался как условный пример, чтобы показать механику. Оптимальность параметров — отдельная тема, которая, как вы правильно заметили, может сильно зависеть от инструмента и волатильности."
    },
    {
      "id": 18135348,
      "author": "svgr",
      "datetime": "2025-04-22T09:30:00.000Z",
      "text": "Михаил Шардин, лень разбираться в синтаксисе оператора этого языка, меняется ли в действительности стоп в 1,5% с шагом 0,1% или нет.Если не меняется, то вполне возможна ситуация, когда стоп в 3,5%, например, побьёт адаптивный трейлинг-стоп по результату."
    },
    {
      "id": 18135093,
      "author": "Большой Брат",
      "datetime": "2025-04-22T08:40:00.000Z",
      "text": "Давно было, когда только начинал искать ТС, поэтому чисел-цифр оценок сравнения уж и не вспомню, но я тоже сравнивал процентный и адаптивный трейлинг. У меня такой разницы не получалось, адаптивный получше, но не настолько как у вас. У вас на процентном просто крест надо ставить.Но были отличия от вашего способа.1.Я не делал со случайными входами. Я сравнивал реверсивные, вход в лонг там где выход из шорта и вход в щорт где выход из лонга. Случайные входы, по крайней мере при таком малом количестве сделок тоже могут сделать некорректным сравнение. Надо для чистоты хотя бы несколько генераций случайных ( да и подобрать параметры чтобы было равное количество сделок).2.Я делал не по ценам закрытия, трейлинг отсчитывался от макс/мин цены и входы/выходы тоже не по ценам закрытия а по уровням трейлингов ( для больших стопов как у вас это не так критично, но чем меньше размер стопа тем это будет критичней).3. Адаптивный по АТР  трейлинг у вас какой то «неправильный». У классического не будет таких же как на процентном горизонтальных полок как у вас на графике ( у вас размер адаптивного стопа фиксируется что ли на точке экстремальной цены закрытия....)."
    },
    {
      "id": 18135167,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T08:41:00.000Z",
      "text": "Большой Брат, хочу пояснить механику работы адаптивного трейлинга в этом скрипте.В моей реализации адаптивный трейлинг-стоп работает по следующему принципу:При открытии позиции устанавливается начальный трейлинг-стоп на уровне:close - atr * atrMultiplierдля лонгов илиclose + atr * atrMultiplierдля шортов.Далее, трейлинг обновляется при движении цены в прибыльном направлении:Для лонгов:trailingStopLong := math.max(trailingStopLong, close - atr * atrMultiplier)Для шортов:trailingStopShort := math.min(trailingStopShort, close + atr * atrMultiplier)Эти горизонтальные «полки», которые вы заметили, возникают когда цена не обновляет максимум (для лонгов) или минимум (для шортов), и трейлинг-стоп остается на прежнем уровне. Это особенность данной реализации — трейлинг-стоп сдвигается только когда текущая цена создает новую, более выгодную для нас точку размещения трейлинга с текущим ATR.Классический адаптивный трейлинг может быть реализован по-разному. Если вы предпочитаете версию, где трейлинг постоянно «плавает» вместе с ATR даже при боковом движении (без горизонтальных полок), можно модифицировать код, убрав функцииmath.maxиmath.min, и просто пересчитывать трейлинг каждый бар какclose ± atr * atrMultiplier.Текущая реализация была выбрана осознанно, так как она обеспечивает более консервативное управление позицией — трейлинг-стоп никогда не отодвигается от достигнутой прибыли."
    },
    {
      "id": 18135193,
      "author": "Большой Брат",
      "datetime": "2025-04-22T08:53:00.000Z",
      "text": "Михаил Шардин, Понятно. Я код не читал. Я хренею сразу с кривого «творца» меню когда нужно чтобы посмотреть прокручивать вбок тем более когда весь скрипт по высоте не помещается."
    },
    {
      "id": 18135145,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T08:35:00.000Z",
      "text": "@VLTorgovie, а куда все ваши комментарии пропали?"
    },
    {
      "id": 18135406,
      "author": "Антон Иванов",
      "datetime": "2025-04-22T09:43:00.000Z",
      "text": "Эх, на заре своей алготорговли тоже баловался трейлинг-стопами. На практике выяснилось, что слишком сильно снижают доходность систем. Но ностальгические воспоминания всколыхнулись :)"
    },
    {
      "id": 18135682,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T10:50:00.000Z",
      "text": "Антон Иванов, а сейчас как делаете?"
    },
    {
      "id": 18135708,
      "author": "Антон Иванов",
      "datetime": "2025-04-22T10:54:00.000Z",
      "text": "Михаил Шардин, сейчас стопов и тейк-профитов не использую вообще."
    },
    {
      "id": 18135916,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T11:34:00.000Z",
      "text": "Антон Иванов, а с просадками как боретесь?"
    },
    {
      "id": 18135950,
      "author": "Антон Иванов",
      "datetime": "2025-04-22T11:42:00.000Z",
      "text": "Михаил Шардин, я с ними не борюсь, я с ними смиряюсь. Это неизбежные этапы торгового процесса, я эквити без просадок ни у кого не видел. Разве что HFT, но мне такая торговля недоступна."
    },
    {
      "id": 18135410,
      "author": "svgr",
      "datetime": "2025-04-22T09:44:00.000Z",
      "text": "И сам подход брать случайные места входов тоже вызывает сомнения в последующей полезности. В какой-то ТС входы происходят при каких-то условиях, то есть некоторое время после поведение рынка не вполне случайное. Соответственно статистика стопов получится иная, чем если брать все подряд ситуации."
    },
    {
      "id": 18135662,
      "author": "Красный богатырь",
      "datetime": "2025-04-22T10:46:00.000Z",
      "text": "Три тренинга в одном с разными отступами"
    },
    {
      "id": 18135688,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T10:51:00.000Z",
      "text": "Perl, что вы имеете в виду?"
    },
    {
      "id": 18139185,
      "author": "Красный богатырь",
      "datetime": "2025-04-23T00:13:00.000Z",
      "text": "Михаил Шардин, цикл в цикле, один пол процента, второй 3% и третий 5%.Пераый начинает как стоп защитный, второй или третий срабатывает.Точка входа на развороте, если войдёшь.Пераый стоп стоит и если не сработал он стоит и второй встанет повыше, тот уберется. Пока в безубытке, потом третий, профит и если не упадёт вручную продать в канале, где там.Как запрограммировать"
    },
    {
      "id": 18140407,
      "author": "Михаил Шардин",
      "datetime": "2025-04-23T11:20:00.000Z",
      "text": "Perl, спасибо"
    },
    {
      "id": 18135917,
      "author": "Skifan",
      "datetime": "2025-04-22T11:35:00.000Z",
      "text": "господи, вы дебилы не, акции идет к себестоиомстикто умный тот берет,вы считаете свою оценку,  дорого богата эта ваша оценка стоимостихотите стабильности, физическое золото и доллары в погребвсе остальное в 21 веке"
    },
    {
      "id": 18135925,
      "author": "Skifan",
      "datetime": "2025-04-22T11:37:00.000Z",
      "text": "Skifan, меня вот удивляет, что ребята «инвесторы» не видят компании которые стрельнутВ РФВЫ серьезно, не понимаете как обычные экономические процессы развиваются, и куда будет двигаться капиталлТогда РБК это ваш уровень, слушайте дальше  )"
    },
    {
      "id": 18136013,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T11:53:00.000Z",
      "text": "Skifan, вы сам с собой диалог выстраиваете? Только не могу понять — спорите или соглашаетесь?"
    },
    {
      "id": 18136166,
      "author": "Skifan",
      "datetime": "2025-04-22T12:28:00.000Z",
      "text": "Михаил Шардин, мир обычно к согласию приходит, а спор рождает истину ))))"
    },
    {
      "id": 18136174,
      "author": "Skifan",
      "datetime": "2025-04-22T12:29:00.000Z",
      "text": "Михаил Шардин, научись считать инфляцию, и давай бахнем, чтоб все закончилось"
    },
    {
      "id": 18136183,
      "author": "Skifan",
      "datetime": "2025-04-22T12:30:00.000Z",
      "text": "не хочу ругаться, не до тебя если честноза пацанов"
    },
    {
      "id": 18136603,
      "author": "Бомж-спекуль",
      "datetime": "2025-04-22T13:55:00.000Z",
      "text": "Михаил, скажите пожалуйста, а файлики из этого постаsmart-lab.ru/blog/1073200.php#commentsс выступлением с конференции можно ли где-то скачать? Жаль, но я не программист совсем…"
    },
    {
      "id": 18136620,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T13:57:00.000Z",
      "text": "Бомж-спекуль, ответил вам в комментарии к тому посту"
    },
    {
      "id": 18136865,
      "author": "Бомж-спекуль",
      "datetime": "2025-04-22T14:47:00.000Z",
      "text": "Михаил Шардин, спасибо большое!"
    },
    {
      "id": 18137325,
      "author": "Бомж-спекуль",
      "datetime": "2025-04-22T16:40:00.000Z",
      "text": "Михаил Шардин, запросила, но автоответа нет, ну и доступа тоже("
    },
    {
      "id": 18137532,
      "author": "Михаил Шардин",
      "datetime": "2025-04-22T17:27:00.000Z",
      "text": "Бомж-спекуль, по утрам только отвечает скрипт"
    },
    {
      "id": 18140237,
      "author": "Красный богатырь",
      "datetime": "2025-04-23T10:51:00.000Z",
      "text": "Я делал, куьуа только работает, 3 круга, малый стоп подтягивался на последний третий. В день поднимался, менял отступы. Малый подьяг вался только на третий и там срабатывал. Но вход тяжёлый.Шпильки, сопли вышибают стопы и малый 0,3% делал.Если все норм он повезёт хорошо.Потом забросил.Роботов нет"
    },
    {
      "id": 18140871,
      "author": "Красный богатырь",
      "datetime": "2025-04-23T12:50:00.000Z",
      "text": "На зм круге первый вкл и профит.Обычно срабатывал.Есть Параболик робот, этот понравился.Но роботы в прибыль не работают, на ме те топчатся, но немного в минус, плюс бывает.Роботы не работают.Нужен канальный робот автотрейда autotreid на марте есть из него сделать.Пожалуйста."
    }
  ]
}