{
  "url": "https://smart-lab.ru/blog/1153389.php?nomobile=1",
  "article_id": 1153389,
  "title": "Отвечаю на критику: бэктест линейной регрессии (из S&C 2007 года) на фьючерсах MOEX в 2025. Код и результаты!",
  "comments": [
    {
      "id": 18206759,
      "author": "Владимиров Владимир",
      "datetime": "2025-05-13T06:37:00.000Z",
      "text": "Спасибо, интересно прочитать в каком направлении копают коллеги.Интересный подход к тренду, хотя по сути R2 к нему отношения не имеет, поскольку являеся собственно мерой соответствия регрессии к факту. Думаю, спорны предположения о начале движения в области роста от малых значений R2 — по этой же причине (грубо говоря, это сигнализирует прежде всего о росте нелинейности). При оптимизации потребуется учитывать дополнительные параметры (длина выборки и проч.). Но идея подхода интересная. Плюсую."
    },
    {
      "id": 18206796,
      "author": "Casiopeia",
      "datetime": "2025-05-13T07:08:00.000Z",
      "text": "А есть просто кнопка - бабки? Регрессии, фибы и миллион других стратегий без всяких гарантий. А может лудомания под соусом \"грааля\"   - Forever?  Такой же вечный вопрос как \"Быть или не быть? Моя стратегия это - расслабиться и получать удовольствие. В переводе на трейдинг - плыть по течению. В случае заноса уходить в дрифт."
    },
    {
      "id": 18206829,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T07:40:00.000Z",
      "text": "Casiopeia, «плыть по течению» тренда?"
    },
    {
      "id": 18209489,
      "author": "Gypsy",
      "datetime": "2025-05-13T18:52:00.000Z",
      "text": "Casiopeia, у меня кнопка есть)"
    },
    {
      "id": 18207133,
      "author": "SergeyJu",
      "datetime": "2025-05-13T09:33:00.000Z",
      "text": "ta.correlation(targetSrc, lrc, len)<br />Это же не просто к-т корреляции, там какие-то скользяшки в описании?"
    },
    {
      "id": 18207341,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T10:22:00.000Z",
      "text": "SergeyJu, в Pine Script функция ta.correlation(targetSrc, lrc, len) вычисляет коэффициент корреляции Пирсона, но на последних len барах, и значение пересчитывается на каждом новом баре. Это делает её «динамической»."
    },
    {
      "id": 18208231,
      "author": "SergeyJu",
      "datetime": "2025-05-13T13:33:00.000Z",
      "text": "Михаил Шардин, в том описании, что я нашел, было по другому написано. Интересно, почему именно Пирсона. Для малых выборок естественнее  Кэндалла или Спирмена.И еще, интересно почему R2 не в лоб считают, а через корреляцию."
    },
    {
      "id": 18208657,
      "author": "VladMih",
      "datetime": "2025-05-13T15:25:00.000Z",
      "text": "Михаил Шардин, вы грамотный человек — по всему видать.Найдите сами в вашем тексте ошибку. Очень важную!егоростс низких уровней (например, с 0.1 до 0.3) часто указывает наначало движения;падениес высоких (например, с 0.6 до 0.3) — признакослабленияи возможного флэта."
    },
    {
      "id": 18208673,
      "author": "VladMih",
      "datetime": "2025-05-13T15:31:00.000Z",
      "text": "Михаил Шардин, Кстати, добавлю — за этот пост с удовольствием плюсанул. Он намного лучше обзоров со списком «много чего и ни о чём», особенно для невладеющих инглишем.Предложил бы на будущее на ваш выбор сделать анализ одного из фигурантов рейтинга. На пробу.Что-то типа этого поста, но желательно со стандартными индикаторами и/или в Метатрейдере (это уже чисто личное)."
    },
    {
      "id": 18208712,
      "author": "VladMih",
      "datetime": "2025-05-13T15:35:00.000Z",
      "text": "Михаил Шардин, значения 99% индикаторов пересчитываются на каждом баре или даже тике, но от этого Stochastic, например, не становится динамическим индикатором.Динамическими принято называть индикаторы, подстраивающие свои настройки (обычно период) под текущий рынок. Многие это правило нарушают (как и вы), от этого только путаница."
    },
    {
      "id": 18208798,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T15:59:00.000Z",
      "text": "VladMih, понятно"
    },
    {
      "id": 18210005,
      "author": "VladMih",
      "datetime": "2025-05-13T21:54:00.000Z",
      "text": "Михаил Шардин, приятно )Что не забили в хомут, как большинство присутствующей публики."
    },
    {
      "id": 18207148,
      "author": "SergeyJu",
      "datetime": "2025-05-13T09:38:00.000Z",
      "text": "R2=1-D(x|y)/D(x)"
    },
    {
      "id": 18207200,
      "author": "Большой Брат",
      "datetime": "2025-05-13T09:54:00.000Z",
      "text": "Я протестировал стратегию на двух таймфреймах: дневном и часовом.Ничего вы не протестировали. Количество сделок даже не то что не позволяет сделать какие то выводы, а просто хохма.И если была задача показать эффективность фильтра по лин.регрессии нужно было сравнить со стратегией без него, просто на одном том же самым выбранном вами значении трейлинг стопа."
    },
    {
      "id": 18207242,
      "author": "Большой Брат",
      "datetime": "2025-05-13T10:10:00.000Z",
      "text": "Тем не менее, эта стратегия может служить хорошей основой или фильтром внутри более сложной торговой системы.Не может. По поводу этого и вашего предыдущего поста о разных «чудотворящих» сложных ( с большим количеством параметров) моделях:мой друг Джонни фон Нейман говорил, что с четырьмя параметрами он может описать слона, а с пятым — заставить его махать хоботомСлон фон Неймана — Википедия"
    },
    {
      "id": 18207300,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T10:13:00.000Z",
      "text": "Большой Брат, код открыт. Любой желающий может подогнать под свои нужды."
    },
    {
      "id": 18207308,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T10:15:00.000Z",
      "text": "Большой Брат, эта стратегия  вроде как раз простая?Не может. По поводу этого и вашего предыдущего поста о разных «чудотворящих» сложных ( с большим количеством параметров) моделях:"
    },
    {
      "id": 18207316,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T10:16:00.000Z",
      "text": "Большой Брат, а что вы предлагаете — куда смотреть?По поводу этого и вашего предыдущего поста о разных «чудотворящих» сложных ( с большим количеством параметров) моделях"
    },
    {
      "id": 18207250,
      "author": "amberfoxman",
      "datetime": "2025-05-13T10:02:00.000Z",
      "text": "меньше 100 сделок — ну такое...если виртуально закрывать на каждом баре и открывать заново — статистики побольше наберётся, только проскальзывание и комис в перезаходах нужно занулитьа в целом — отлично, спасибо!"
    },
    {
      "id": 18207323,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T10:18:00.000Z",
      "text": "amberfoxman, tradingview на бесплатном аккаунте даёт ограниченную историю внутри дня."
    },
    {
      "id": 18207393,
      "author": "amberfoxman",
      "datetime": "2025-05-13T10:33:00.000Z",
      "text": "Михаил Шардин, СЛ глючит… большой коммент был, пропал, по тезисам: дневки, переоткрытие, средней и сигмы хватит чтобы перфоманс мерять"
    },
    {
      "id": 18207542,
      "author": "zam",
      "datetime": "2025-05-13T10:58:00.000Z",
      "text": "Спасибо за интересную статью"
    },
    {
      "id": 18207561,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T11:01:00.000Z",
      "text": "zam, спасибо что прочитали"
    },
    {
      "id": 18207861,
      "author": "Eugene Bright",
      "datetime": "2025-05-13T12:06:00.000Z",
      "text": "Начнём с периода:10 баров— для поиска коротких импульсов и ранних сигналов,20 баров— сбалансированный вариант для дневных графиков,50 баров— для фильтрации шума и работы по тренду. Выбор зависит от стиля торговли и таймфрейма.Вот так бегать за доверительными интервалами? а торговать-то когда?Стоит ММ поменять частоту, и вся конструкция летит в бездну.Самая надежная ТС — это система, не зависящая от частоты колебаний цены."
    },
    {
      "id": 18208131,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T13:08:00.000Z",
      "text": "Eugene Bright, очень интересно, но это например какая?"
    },
    {
      "id": 18208179,
      "author": "Eugene Bright",
      "datetime": "2025-05-13T13:17:00.000Z",
      "text": "Михаил Шардин, ренко, каги, «крестики/нолики», например."
    },
    {
      "id": 18207911,
      "author": "George Martin",
      "datetime": "2025-05-13T12:19:00.000Z",
      "text": "Михаил, Вы молодец. Даже если еще не то или не так, в итоге формализуете стратегию так как надо и будет работать. Сразу начнете ее вариавативность исследовать. в итоге будет примерно 2-5 моделей на основе одной базы, это как разные машины на одной платформе, разные ситуации, разные машины выбираете. Написание кода, даже с помощью жпт, не так уж и просто. Кайф! Эти исследования, подгонка и поиск той самой верной стратегии. Отличная история. Выйдете на развитой рынок, откроете счет под него и новый океан будет. Но приедтся уже учитывать деривативы, на основании входящих данных крапать или руками или роботом. Удачи!"
    },
    {
      "id": 18208137,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T13:08:00.000Z",
      "text": "George Martin, спасибо"
    },
    {
      "id": 18207921,
      "author": "George Martin",
      "datetime": "2025-05-13T12:22:00.000Z",
      "text": "В качественно постоянно-переменных всегда учитывайте соотношение цены и объема в движении. Интервалы по усмотрению. Всякие SМА работают, это правда)"
    },
    {
      "id": 18208141,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T13:09:00.000Z",
      "text": "George Martin, объёмы кстати на самом деле редко когда стратегиях учитываются.А открытый интерес и вообще ужасно редко — хотя открытый интерес есть в данных трейдингвью."
    },
    {
      "id": 18208238,
      "author": "SergeyJu",
      "datetime": "2025-05-13T13:35:00.000Z",
      "text": "Михаил Шардин, объемы играют там, где есть памп и дамп. На ликвидах они (строго ИМХО) малоинформативны."
    },
    {
      "id": 18208279,
      "author": "George Martin",
      "datetime": "2025-05-13T13:43:00.000Z",
      "text": "SergeyJu, объемы нужны для понимания истинного движения или нет. Пробитие или тренд, все завязано на объемах, в первую очередь в ликвиде как раз."
    },
    {
      "id": 18208270,
      "author": "George Martin",
      "datetime": "2025-05-13T13:42:00.000Z",
      "text": "Михаил Шардин, это практически основа здорового трейдинга) ОИ нужен для опционов однозначно."
    },
    {
      "id": 18207936,
      "author": "DrManhattan",
      "datetime": "2025-05-13T12:25:00.000Z",
      "text": "конечно, линейная регрессия с R² может стать эффективным фильтром и подтверждением тренда для слепого машинного зрения.Трейдер с опытом сразу видит тренды.Особенно на длинных периодах.Проблем с этим нет.А вот вопрос определения слома тренда стоит куда острее."
    },
    {
      "id": 18208335,
      "author": "George Martin",
      "datetime": "2025-05-13T14:05:00.000Z",
      "text": "DrManhattan, почему не формализировать это в визуальный пробой и закрепление ниже линии тренда? там по сути уже где то стоп и сработает."
    },
    {
      "id": 18208347,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T14:10:00.000Z",
      "text": "DrManhattan, сегодня по существу комментарии?"
    },
    {
      "id": 18208724,
      "author": "DrManhattan",
      "datetime": "2025-05-13T15:37:00.000Z",
      "text": "Михаил Шардин, а по существу, тренд — это явление пост-фактумное.Мы можем сказать, что это тренд, а не коррекция,только если цена сильно уйдет от точки перегиба.А пока она далеко не уйдет нет никаких способов определить,что это будет тренд.А вот коррекцию определить проще.И случаются они чаще."
    },
    {
      "id": 18208067,
      "author": "Хоббит",
      "datetime": "2025-05-13T13:07:00.000Z",
      "text": "Очень интересно! Со стратегией пока не разобрался. Тупо скопировал ваш код в бесплатный аккаунт. Получилось 21 сделка на часовике с 14 августа 2023го. Результат -4% ("
    },
    {
      "id": 18208078,
      "author": "Хоббит",
      "datetime": "2025-05-13T13:07:00.000Z",
      "text": "Хоббит, Удивительно, что можно тестировать на бесплатном аккаунте… В чём же тогда преимущества платного? Видимо только для более глубокой истории…"
    },
    {
      "id": 18208121,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T13:07:00.000Z",
      "text": "Хоббит, а инструмент и таймфрейм у вас какой?"
    },
    {
      "id": 18208136,
      "author": "Хоббит",
      "datetime": "2025-05-13T13:08:00.000Z",
      "text": "Михаил Шардин, Si и час"
    },
    {
      "id": 18208153,
      "author": "Хоббит",
      "datetime": "2025-05-13T13:12:00.000Z",
      "text": "Михаил Шардин, Попробую скрин сюда поместить )"
    },
    {
      "id": 18208297,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T13:47:00.000Z",
      "text": "Хоббит, а можете полностью скриншот сделать всего монитора? Вот так:"
    },
    {
      "id": 18208320,
      "author": "Хоббит",
      "datetime": "2025-05-13T13:55:00.000Z",
      "text": "Михаил Шардин,"
    },
    {
      "id": 18208343,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T14:08:00.000Z",
      "text": "Хоббит, у вас инструмент другой. У меня склеенный фьючерс, а у вас нет. Должен быть:https://ru.tradingview.com/chart/?symbol=RUS%3ASI1%21"
    },
    {
      "id": 18208414,
      "author": "Хоббит",
      "datetime": "2025-05-13T14:26:00.000Z",
      "text": "Михаил Шардин, Понятно. Спс. Но -2% за полтора года (примерно) тоже не очень впечатляет )"
    },
    {
      "id": 18208457,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T14:38:00.000Z",
      "text": "Хоббит, да, но на Московской бирже (ФОРТС) фьючерсные контракты переключают в марте, июне, сентябре и декабре, а вы один выбрали — тестирование вроде как не совсем корректное."
    },
    {
      "id": 18208552,
      "author": "Хоббит",
      "datetime": "2025-05-13T15:14:00.000Z",
      "text": "Михаил очень интересно читать ваши исследования. Буду с нетерпением ждать новости. У меня есть своя простая стратегия. Используются специальные SAR. Возможно они есть в TradingView. Надо будет посмотреть.Только что проверил на CNYRUB_TOM с 28.03.2024. Получилось +20% Будет ориентиром )"
    },
    {
      "id": 18208563,
      "author": "Хоббит",
      "datetime": "2025-05-13T15:01:00.000Z",
      "text": "Хоббит, Это часовик. Даходность на 2й панели"
    },
    {
      "id": 18208573,
      "author": "Михаил Шардин",
      "datetime": "2025-05-13T15:04:00.000Z",
      "text": "Хоббит, спасибо, обязательно посмотрю"
    },
    {
      "id": 18224500,
      "author": "svgr",
      "datetime": "2025-05-18T13:45:00.000Z",
      "text": "1. Не увидел в приведённом коде выходов из позиции и подсчёта результата сделки. Также учёт комиссии в ней. Переменная комиссии установлена.В переменной highestLongPrice хранится уровень входа? От неё надо считать реальный уровень входа highestLongPrice * (1+commission_value). Потом так же для выхода. И складывать реальные вход с выходом.Тогда возможно показанная доходность в 26% существенно снизится.2. Очень неустойчивый результат из 4 всего прибыльных сделок. Предположим, не хватило бы один раз несколько пунктов и прибыльная сделка в итоге укатилась бы в убыточную. А это ещё минус 11% от преставленного результата. Что останется? Не минус ли?"
    },
    {
      "id": 18224573,
      "author": "Михаил Шардин",
      "datetime": "2025-05-18T14:08:00.000Z",
      "text": "svgr, комиссия в условиях задана была:strategy(\"Линейная регрессия + R² стратегия\",\r\n     overlay=true,\r\n     commission_type=strategy.commission.percent,   // Тип комиссии: процент\r\n     commission_value=0.04,                         // Значение комиссии: 0.04%\r\n     slippage=10,                                   // Проскальзывание в тиках\r\n     process_orders_on_close=true,\r\n     default_qty_type=strategy.fixed,\r\n     default_qty_value=3,\r\n     initial_capital=500000)                        // Начальный капитал"
    },
    {
      "id": 18224739,
      "author": "svgr",
      "datetime": "2025-05-18T14:56:00.000Z",
      "text": "Михаил Шардин, что-то как-то… не ожидал такого непонимания написанного.Ваш абзац отражён у меня фразой «Переменная комиссии установлена.»Повторюсь, а где код её использования? Как я понимаю использование в своём посте я кратко описал."
    },
    {
      "id": 18224786,
      "author": "Михаил Шардин",
      "datetime": "2025-05-18T15:07:00.000Z",
      "text": "svgr, у вас очень точные вопросы, перед тем как ответить на которые надо думать.Вот мой ответ: в Pine Script использование commission_type, commission_value и slippage в strategy() влияет на симуляцию сделок и, соответственно, на итоговую метрику доходности в бэктесте. То есть, платформа TradingView при расчёте доходности учитывает комиссию и проскальзывание автоматически, без необходимости вручную корректировать цены входа/выхода.На счёт 4х прибыльных сделок на интервале теста — да, это мало. Это скорее технический прототип, иллюстрирующий идею: как можно комбинировать линейную регрессию с коэффициентом детерминации R² и трейлинг-стопом."
    },
    {
      "id": 18224966,
      "author": "svgr",
      "datetime": "2025-05-18T16:05:00.000Z",
      "text": "Михаил Шардин, понятно, спасибо. Про только иллюстрацию тоже сразу было понятно. И смысл моего поста был в том, что этот старый метод ничем не лучше многих других. Они все — взгляды на тренд чуть под другим углом средствами, лишь технически отличающимися.Все они не позволяют зацепить глубинное явление тренда вовремя. Повезло с фазой рынка — в существенном плюсе, не повезло — в некотором минусе. Любой из методов.А возьмёте вы не 1,5 года, а 8, например. Может вообще не быть прибыльных параметров у метода, постоянных на весь период. Даже после подгонки.Я лет 10 назад искал метод, который будет успевать перестраиваться на новое направление тренда вслед за рынком, имея итоговый плюс за каждый год. То есть систематически уменьшить запаздывание.Скорее всего методами усреднения прошлых данных и регрессиями это в принципе невозможно.Хотя три года назад пришёл к некоей системе, которая давала запаздывание поменьше, чем в известных методах. Чтоб убедиться, что этого было бы достаточно для плюса почти каждый год хотя бы, осталось набрать ещё часть кода и протестировать. Но в последний год было не до этого.Сейчас буду это всё заново набирать в OsEngine вместе с изучением платформы.Вы, если хотите, напишите в ЛС, и реализуйте на другой платформе параллельно. За месяц поэтапно мог бы изложить подход."
    },
    {
      "id": 18225155,
      "author": "Михаил Шардин",
      "datetime": "2025-05-18T17:33:00.000Z",
      "text": "svgr, в итоге я переезжаю на связку Raspberry Pi и Backtrader. Прямо сейчас статью дописываю, во вторник опубликую.А можно вам в телеграм написать? Вы пользуетесь?"
    }
  ]
}