{
  "url": "https://smart-lab.ru/blog/1159732.php?nomobile=1",
  "article_id": 1159732,
  "title": "Хватит тестировать на мусоре! Python-скрипт для отбора ликвидных акций Мосбиржи под Backtrader через библиотеку Игоря Чечета",
  "comments": [
    {
      "id": 18254233,
      "author": "Anest",
      "datetime": "2025-05-27T05:52:00.000Z",
      "text": "Что думаем… думаем, что это плохо, когда брокер постоянно «теребонькает» своё API. Что там можно улучшать? стандартные методы запроса данных, отправка заявок. Либо, если уж так чешется «улучшалка», то тогда надо сохранять последовательность и делить API на версии, к примеру, V1, V2… V5 с сохранением работоспособности всех версий."
    },
    {
      "id": 18254288,
      "author": "Михаил Шардин",
      "datetime": "2025-05-27T07:04:00.000Z",
      "text": "Anest, финам поменял кардинально"
    },
    {
      "id": 18254285,
      "author": "Николай",
      "datetime": "2025-05-27T06:59:00.000Z",
      "text": "Зачем так усложнять? Берешь сортируешь все акции по объему в квике и берешь первые 15. Вот тебе и список самых ликвидных )) И времени занимает 5 сек"
    },
    {
      "id": 18254289,
      "author": "Михаил Шардин",
      "datetime": "2025-05-27T07:05:00.000Z",
      "text": "Николай, я не пользуюсь квиком"
    },
    {
      "id": 18254307,
      "author": "Михаил Шардин",
      "datetime": "2025-05-27T07:20:00.000Z",
      "text": "Николай, да и вообще торговых роботов ведь писать проще простого. Там алгортим-то:1. Покупай дёшево.2. Продавай дорого."
    },
    {
      "id": 18254310,
      "author": "Vkt",
      "datetime": "2025-05-27T07:22:00.000Z",
      "text": "Николай, вариант! И вывести по ДДЕ в эксель. В таблицах Квика очень гибкие настройки по фильтрам и сортировке, но не все знают и пользуются."
    },
    {
      "id": 18254456,
      "author": "Евгений (synth-lab)",
      "datetime": "2025-05-27T08:29:00.000Z",
      "text": "самое интересное что для бота нужны как раз низколиквидные акции так как именно там находятся неэффективности которые можно монетизировать, а в ликвидных акциях рынок на грани эффектиности и не понятно что вы там будете торговать, а так в целом хорошо что либы делают и поддерживают ребята"
    },
    {
      "id": 18254502,
      "author": "Михаил Шардин",
      "datetime": "2025-05-27T08:42:00.000Z",
      "text": "Евгений (synth-lab), на тестах всё идеально будет — а в реальной жизни потом как?"
    },
    {
      "id": 18254546,
      "author": "Евгений (synth-lab)",
      "datetime": "2025-05-27T08:57:00.000Z",
      "text": "Михаил Шардин, дак отсутствие ликвидности и есть та самая неэффекность вокруг которой нужно тс выстраивать, и строить алгоритмы, какие есть ситуации на неликвидных акциях? самое простое, это стоять в спреде, второе это ловля спайков (шпилек), руками эти две неэфективности практически не забрать, ботом легко, ловить спайки на дальних полностью неликвидных фьючах вообще сказка учитывая что вы всегда можете дельту перекрыть на акциях, про неликвидные прем опционы молчу, там вообще клад зарыт для алго"
    },
    {
      "id": 18254830,
      "author": "Replikant_mih",
      "datetime": "2025-05-27T10:20:00.000Z",
      "text": "Михаил Шардин, У меня в предыдущем фреймворке был 2 варианта эмуляции экзекьюшена — для ликвидных и неликвидных инструментов. Эмулировать действительно в неликвиде сложнее, если у тебя нет данных ордерлога или чего-то такого. Но всегда можно моделировать процесс и пытаться в целом попасть в цифры."
    },
    {
      "id": 18257340,
      "author": "zhorzh",
      "datetime": "2025-05-27T22:14:00.000Z",
      "text": "Евгений (synth-lab), зависит от торговой системы и от объёма счета"
    },
    {
      "id": 18254505,
      "author": "Михаил Шардин",
      "datetime": "2025-05-27T08:44:00.000Z",
      "text": "Сергей Сергаев, разумно, но как это протестировать — выглядит сложной конструкцией и не для всех стратегий наверное это важно"
    },
    {
      "id": 18254809,
      "author": "SergeyJu",
      "datetime": "2025-05-27T10:14:00.000Z",
      "text": "ИМХО, в данных явный косяк. Самая ликвидная бумага до разделения — РАО ЕЭС. И где она?Эти МРСК вообще не должны в таком числе входить в число самых ликвидных.Только в 18 году появились правдоподобные результаты."
    },
    {
      "id": 18255388,
      "author": "Михаил Шардин",
      "datetime": "2025-05-27T12:15:00.000Z",
      "text": "SergeyJu, больше чем на 3-5 лет скорее всего нет смысла для тестов на истории"
    },
    {
      "id": 18255506,
      "author": "SergeyJu",
      "datetime": "2025-05-27T12:40:00.000Z",
      "text": "Михаил Шардин, смысл есть, потому что рынок год от года всегда разный. Другое дело, что некачественные данные брать — сомнительное удовольствие."
    },
    {
      "id": 18256293,
      "author": "igor12",
      "datetime": "2025-05-27T16:17:00.000Z",
      "text": "Может здесь кто знает, с какого адреса своих серверов Финам в моменте отдаёт исторические данные… Последние годы он менял эти адреса… Хотя Финам и версию  API менял ко всему…"
    },
    {
      "id": 18256327,
      "author": "Михаил Шардин",
      "datetime": "2025-05-27T16:23:00.000Z",
      "text": "igor12, надо через хром посмотреть в режиме разработчика"
    },
    {
      "id": 18289798,
      "author": "Максим Качур",
      "datetime": "2025-06-06T13:56:00.000Z",
      "text": "Часть с установкой можно улучшить, используя вместо deprecated метода с setup.py современную альтернативу в виде файла описания проекта pyproject.toml. С ним работает как setuptools привычный, так и всякие разные uv / hatch, PDM, poetry и т.д., можно ставить так же, соответственно, и через pip install / pipx install. В том числе и в режиме редактирования (install editable).В целом, спасибо за статью."
    }
  ]
}