{
  "url": "https://smart-lab.ru/blog/1173716.php?nomobile=1",
  "article_id": 1173716,
  "title": "Почему я не пошёл на Smart-Lab Conf 2025 и что купил вместо этого",
  "comments": [
    {
      "id": 18354166,
      "author": "Zvr",
      "datetime": "2025-06-30T07:09:00.000Z",
      "text": "Бугага сравнил здоровье и инфоцыганский шабаш)) на котором льют воду, лучше эти деньги в банк положили там за год +24%. А мозговики год назад на уровне 2750 втарились… и сидят ждут манны небесной.  А зарабатывают от хомяков на конфе, стабильно))"
    },
    {
      "id": 18354180,
      "author": "Михаил Шардин",
      "datetime": "2025-06-30T07:19:00.000Z",
      "text": "Zvr, я никогда не был подписан на мозговик"
    },
    {
      "id": 18354401,
      "author": "Silent Hamster",
      "datetime": "2025-06-30T09:20:00.000Z",
      "text": "Жениться тебе пора, а не спортом заниматься! Твое время прошло!  Уж если хочешь- займись физкультурой. Бегай по утрам в белых  тапочках по асфальту и хватит тебе. Помни, каждый шаг приближает нас к концу жизни."
    },
    {
      "id": 18354572,
      "author": "batsion",
      "datetime": "2025-06-30T10:08:00.000Z",
      "text": "Silent Hamster, «твое время прошло» — такой фразы нормальный мужик, даже который сильно старше и понял жизнь, другому сказать не может, только обиженный, которого задело, спортом заниматься никогда не поздно и женитьба здесь совсем ни при чем. Его женитьба — это не вашего старого ума дело. Разочаровал дядя."
    },
    {
      "id": 18355110,
      "author": "Silent Hamster",
      "datetime": "2025-06-30T12:34:00.000Z",
      "text": "batsion, и тебя задело мое ворчание!!  Просто я знаю жизнь! Лучше бы ребенка родил, чем по городам и весям мотаться!"
    },
    {
      "id": 18392312,
      "author": "DrManhattan",
      "datetime": "2025-07-11T20:52:00.000Z",
      "text": "batsion, особенно, что есть категория 60+ в том же триатлоне.Дело не в возрасте, дело в человеке."
    },
    {
      "id": 18392307,
      "author": "DrManhattan",
      "datetime": "2025-07-11T21:27:00.000Z",
      "text": "По поводу триатлона.Знакомый пишет, что там какие-то безумные цены на технику, омуницию и спец питание! Просто запредел!Просто сколько в год это удовольствие стоит?"
    },
    {
      "id": 18393080,
      "author": "Михаил Шардин",
      "datetime": "2025-07-12T08:42:00.000Z",
      "text": "DrManhattan, это не совсем правда. Всё это очень дорогое оборудование легко купить, но самое сложное — это именно регулярно заниматься.Проблема именно в этом мне кажется.Да и в самом начале зачем тратить много денег на то что может быть вообще и не зайдёт вовсе?"
    },
    {
      "id": 18393493,
      "author": "DrManhattan",
      "datetime": "2025-07-12T11:45:00.000Z",
      "text": "Михаил Шардин, мне кажется, что с низким уровнем МПК вообще не стоит заниматься циклическими видами спорта."
    },
    {
      "id": 18393596,
      "author": "Михаил Шардин",
      "datetime": "2025-07-12T12:37:00.000Z",
      "text": "DrManhattan, Гармин его показывает"
    }
  ]
}