{
  "url": "https://smart-lab.ru/blog/1182701.php?nomobile=1",
  "article_id": 1182701,
  "title": "Индикаторы - это ловушка? Что говорят алготрейдеры о \"реальной альфе\"",
  "comments": [
    {
      "id": 18422275,
      "author": "22022022",
      "datetime": "2025-07-22T08:02:00.000Z",
      "text": "Всегда можно сказать «Вы просто не умеете готовить»… Таким образом накинуть тумана таинственности и скрытых уменииДумаю, так устроены люди, когда видятожидаютитп. итд.Бредовость, но на самом деле с этим очень-очень сложно бороться.Гипотезу о том что рынок всегда повторяется, или о том что рынок не меняется, поддерживает большинство, поддерживают книги, учителя, преподаватели. Идея максимально комфортна, она удобна мозгу, сразу представляешь всякое)) Думаю всем знакомо «Рынки не меняются, потому что люди не меняются. А люди не меняются потому что психология». Вот так хитро вырулили на психологию, хотя при чем тут психология? Разве сделки мы совершает закрытыми глазами чисто психологически? Мы все психи?))Гипотеза о повторяемости рынка, о скрытых постоянных «неэффективностях», о каких то устойчивых «закономерностях» настолько популярна, настолько вбита в головы людей, что люди даже после череды потерь игнорирует реальность."
    },
    {
      "id": 18423470,
      "author": "svgr",
      "datetime": "2025-07-22T13:42:00.000Z",
      "text": "22022022, ничто не мешает составить программу, что найдёт вам повторяемость таких зубчиков. За заданный временной интервал сколько раз поочерёдно будут достигнуты два достаточно отстоящих значения цены. Прогоните хоть за 20 лет.Обычно 3-4 полных цикла случаются, если болтанка началась. Соответственно, на первые два смотрите, третий — торгуете. Останется убедиться, что правильно взятые колебания в сумме превзойдут неудачные. Обычно размер одного плюса при этом втрое меньше одного минуса."
    },
    {
      "id": 18424209,
      "author": "Хоббит",
      "datetime": "2025-07-22T16:31:00.000Z",
      "text": "22022022, Думаю, повторяемости всё же существуют. Например, для реакции на новость «толпе» всегда требуется время. Даже если оно колеблется от минуты до часа, это — повторяемость. Сильные тренды тоже начинаются не сразу. Требуется время для срабатывания разных «индикаторов» у разных людей. Некоторым для «осознания» требуется три дня. Но это тоже повторяемость. Остаётся только найти наиболее эффективные параметры (диапазоны) этой повторяемости )"
    },
    {
      "id": 18438772,
      "author": "LogikoMen",
      "datetime": "2025-07-27T22:37:00.000Z",
      "text": "22022022, психология действительно создаёт закономерности. Только вы не понимаете какие и что толкает людей на это. Основное желание, не правильного с точки зрения психологии трейдера, уйти от риска. Не имееть никогда убытки. Потому что они приносят боль. И это норма для 99 людей. 1 процент — это авантюристы. Их психология правильная."
    },
    {
      "id": 18422290,
      "author": "ves2010",
      "datetime": "2025-07-22T08:08:00.000Z",
      "text": "Надо спрашивать за индикаторы тех кто уже нашел альфу и успешно торгует...Мысль в том что альфа это та самая неэффективность рынка которая позволяет делать деньги. И при помощи технических средств в виде индикаторов эта альфа сторговывается.Т.е индикаторы не делают альфу… альфу делает сам рынок… вид индикатора это вариант инженерного решения…"
    },
    {
      "id": 18422330,
      "author": "SergeyJu",
      "datetime": "2025-07-22T08:29:00.000Z",
      "text": "Из всего, что там перечислил товарищ опционный игрок, использую только EMA. Но, как верно заметил предыдущий оратор, смысл не в отдельных деталях, а в том, какую самодвижущуюся телегу ты из них можешь собрать. И можешь ли вообще.P.S.Если бы я торговал на Америке, в эти опционы-мотыльки даже бы и не совался. Зачем, если можно торговать долгоживущие производные на наждак. QQQ как база и все остальное."
    },
    {
      "id": 18424184,
      "author": "CapITank",
      "datetime": "2025-07-22T16:23:00.000Z",
      "text": "SergeyJu, «зачем» звучит как то непонятно… мотылек-одна математика и производные вещи, долгоиграющие-другая математика и производные.Почему (на основании чего) пришли к заключению «что. математика мотыльков» неподходящая… непонятно.  Мотлыек-одно, долгосрок-другое, разве нет? Я предполагаю.что ответом будет «значения того то того то-не подходят (малы-большие) под то то», но это если использовать «что то то, что вам знакомо» или не?"
    },
    {
      "id": 18424422,
      "author": "SergeyJu",
      "datetime": "2025-07-22T17:22:00.000Z",
      "text": "CapITank, Я БЫ НЕ СОВАЛСЯ.То есть, лично мне однодневные опционы торговать не с руки. Даже и пробовать бы не стал. Знаю людей на смартике, которых бы это, вероятно,  привлекло. Люди разные."
    },
    {
      "id": 18422686,
      "author": "Assetman",
      "datetime": "2025-07-22T10:27:00.000Z",
      "text": "Алготрейдеры признали все таки, что классический рынок торговать не умеют?"
    },
    {
      "id": 18423329,
      "author": "SergeyJu",
      "datetime": "2025-07-22T12:56:00.000Z",
      "text": "Assetman, не вижу признаний, более того, что такое «классический рынок» и чем он отличается от «неклассического» Вы забыли объяснить. Так что вброс засчитан."
    },
    {
      "id": 18422696,
      "author": "⧸_⎠ Виктор Громов ⎝_⧹",
      "datetime": "2025-07-22T10:34:00.000Z",
      "text": "ЦБ РФ следит за тем, чтобы на рынке была высокая форма эффективности, сам рынок уже давно эффективен и вера в то, что скользящие средние дадут неэффективность это бредовое состояние психически больного лудомана, которого нужно вести к психиатру."
    },
    {
      "id": 18424112,
      "author": "George Martin",
      "datetime": "2025-07-22T16:11:00.000Z",
      "text": "Стандартные индикаторы и методы ТА в торговле акциями очень даже работают. С опционами совсем другая история и методы."
    },
    {
      "id": 18424393,
      "author": "Роман Беседовский",
      "datetime": "2025-07-22T17:10:00.000Z",
      "text": "В 0DTE опционах при ежедневных трейдах влетаешь на такие комиссии, что они убивают любую альфу. Многие думают, что альфу убивают индикаторы или что-то подобное, первое, что убивает альфу - это переторговка, спреды и комиссии, когда выходишь на нормальный объем торгов.\n\nНу и sp500 это суперэффективный инструмент, альфу лучше искать на РФ рынке или крипте или ещё где, но точно не на sp500 или eurusd. Там любая неэффективность сжирается моментально местными суперпрофи."
    },
    {
      "id": 18426071,
      "author": "Spekyl",
      "datetime": "2025-07-23T09:37:00.000Z",
      "text": "Индикатор — это та же цена, только с запозданием.Рынок не обыграть, если бы не:1. Рулит инсайд2. Ликвидность сильно ограничена3. 1+2=инсайдерам слишком сложно маскировать свои действия4. Действия инсайдеров имеют специфический след, или отпечаток5. Мы действуем как инсайдеры, но быстрее набирая и сбрасывая позициюДругих способов обыграть рынок я не вижу, ибо рынок сам по своей сути действует на грани своей эффективности"
    },
    {
      "id": 18438748,
      "author": "LogikoMen",
      "datetime": "2025-07-27T22:25:00.000Z",
      "text": "Если доход виден. Он обязательно будет сьеден. Если он виден большинству. То это неизбежность. И так же верно. Если большинство действуют одинакового. Они создадут закономерности. Вот и весь секрет. Стандартные индикаторы работают. Как и не стандартные."
    }
  ]
}