{
  "url": "https://smart-lab.ru/blog/1191119.php?nomobile=1",
  "article_id": 1191119,
  "title": "Рецензии на книги|Технический анализ - «астрология», а фундаментальный - «полезный идиотизм». Читаю книгу «Как делаются деньги?»",
  "comments": [
    {
      "id": 18484567,
      "author": "dnmsk ☮",
      "datetime": "2025-08-12T05:47:00.000Z",
      "text": "Все так и есть."
    },
    {
      "id": 18484575,
      "author": "Eugen Invest Malina",
      "datetime": "2025-08-12T06:23:00.000Z",
      "text": "Целая книга о том что биржевики это лудоманы в казино? Ну ок понятно кэп)"
    },
    {
      "id": 18484685,
      "author": "SergeyJu",
      "datetime": "2025-08-12T08:10:00.000Z",
      "text": "Портфель Марковица уже по построению не присоединение к рынку в рамках ГЭР, а, наоборот, попытка обыграть рынок, используя корреляционные связи между активами и инерцию.Когда-то в ответ на «Философию нищеты» Прудона Карл Маркс написал «Нищета философии». А тут философия рынка… и автор не Прудон."
    },
    {
      "id": 18485220,
      "author": "старый трейдер",
      "datetime": "2025-08-12T10:55:00.000Z",
      "text": "SergeyJu, imo — нормально/типично, для абсолютно закрытой области знаний.Автор — социолог, не имеющий отношения у торговле, пытается что-то понять, так же, как Маркс и с тем же успехом. Соображающим — достаточно посмотреть review на английском.Кстати Вы похоже высказываетесь, едва отклоняетесь от тем алготорговли. Так уж люди устроены."
    },
    {
      "id": 18485331,
      "author": "SergeyJu",
      "datetime": "2025-08-12T11:14:00.000Z",
      "text": "старый трейдер, Маркс гений и его ошибки грандиозны и гениальны. Никто иной не смог бы довлеть над умами многих миллионов людей в течение, как мы видим, полутора веков, кроме гения. Вот цитата из предисловия к Нищете философии.«К несчастью г-на Прудона его странным образом не понимают в Европе. Во Франции за ним признают право быть плохим экономистом, потому что там он слывет за хорошего немецкого философа. В Германии за ним, напротив, признается право быть плохим философом, потому что там он слывет за одного из сильнейших французских экономистов. Принадлежа одновременно к числу и немцев и экономистов, мы намерены протестовать против этой двойной ошибки.»"
    },
    {
      "id": 18485506,
      "author": "старый трейдер",
      "datetime": "2025-08-12T11:51:00.000Z",
      "text": "SergeyJu, похоже, что Ваш подход, весьма типичный для технарей, не позволяет видеть разницу между действительно грандиозным успехом идеологии Маркса, фактически превращенной в религию и тем, что называется наукой и научным, т.е., что можно как-то использовать, кроме идеологической работы.Если возьметесь спорить, попробуйте сформулировать, для начала, каковы научные достижения, что открыл в науке Маркс, тем более, что он без устали называл свои сочинения «научными» .(еще интересно, чем Вам не нравится Дудь, который исповедует неомарксизм, переименованный в либерализм? Неужели примерно тем, чем шиитам не нравятся сунниты?)"
    },
    {
      "id": 18485174,
      "author": "ArtyomZvezdoff",
      "datetime": "2025-08-12T10:46:00.000Z",
      "text": "Спорно. Я каждый месяц наблюдаю «неэффективность рынка», когда активы стоят меньше их реальной стоимости. Естественно подобное видят не только я один, поэтому цена выравнивается где то быстро, где то медленно. Согласен только, что долгосрочно обыгрывать индекс смысла нет, главное доходность и рост капитала."
    },
    {
      "id": 18485196,
      "author": "22022022",
      "datetime": "2025-08-12T11:05:00.000Z",
      "text": "Под техническим анализом в 98% случаях обычно имеется ввиду примитивный статистический трейдинг, когда берут OHLC производят простые/сложные вычисления и якобы получают нечто, ответ)) Тогда да, это шляпа, даже не астрология а легкой помешательство. Запутанность математикой.Не нужно забывать, что мы пришли зарабатывать, а это значит отбирать деньги. Для этого нужно делать больно остальным, постоянно причинять страдания (убытки). Борьба рисует график а не наоборот! Не ковыряние в графике создает график)))Мне трейдинг напоминает детскую песочницу. Большинство детей сидят и пытаются выстроить песочные замки, дворцы, как то всё структурировать, упорядочить. Задача зарабатывающего мальчика, периодически набегать и всё ломать и рушить, шокировать, отбирать и убегать. После чего дети осознав ошибки, заново пытаются всё упорядочить и строят уже песочные усадьбы))"
    },
    {
      "id": 18485212,
      "author": "Alchemist01",
      "datetime": "2025-08-12T10:53:00.000Z",
      "text": "Троллинг как способ продать книгу, причём сказанное может быть отчасти верно только «если допустить гипотезу эффективного рынка». Но гипотеза не аксиома"
    },
    {
      "id": 18485283,
      "author": "Михаил Шардин",
      "datetime": "2025-08-12T11:07:00.000Z",
      "text": "Там основная идея книги немножко в другом — но то что я вынес в статью — это прямо очень мне ярко понравилось"
    },
    {
      "id": 18487467,
      "author": "VladMih",
      "datetime": "2025-08-12T22:49:00.000Z",
      "text": "Михаил Шардин, спасибо, сэкономили время — пройду мимо этогополитико-философскогоидиота. Ну как еще можно назвать человека, отрицающего ТА, фрактальность, присущую всему в природе, даже живой(!) и т.д. и т.п.?Тимофей номер два! Точней, наоборот, конечноМихаил, вы же понимаете, что 99% роботов работают на ТА?А какие обороты делаются роботами вы в курсе?А динамику роста робо-оборотов знаете?Тогда зачем позоритесь так… бездарно?HFT вообще без ТА не может существовать —уж это точно не портфельное инвестирование )"
    },
    {
      "id": 18485306,
      "author": "d_d",
      "datetime": "2025-08-12T11:11:00.000Z",
      "text": "многообещающее начало, но всё скатывается в какую-то муть. Автор пытается продать теорию портфеля Марковица из 1950-х годов как что-то новое??!!  Будучи социологом, по всей видимости не знает о существовании предсказательных рынков и как делаются деньги на стыке трейдинга и  социологии."
    },
    {
      "id": 18485577,
      "author": "Михаил Шардин",
      "datetime": "2025-08-12T12:03:00.000Z",
      "text": "d_d, вы про историию с акциями GameStop, когда трейдер, известный как Roaring Kitty использовал свою популярность на платформе Reddit для организации ажиотажного спроса на акции этой компании, что привело к резкому росту их стоимости и убыткам для крупных инвестиционных фондов?Фильм про это: Дурные деньги (2023), Dumb Money"
    },
    {
      "id": 18485638,
      "author": "d_d",
      "datetime": "2025-08-12T12:13:00.000Z",
      "text": "Михаил Шардин,   я про «Философию посткредитного капитализма» некоего Уле Бьерга"
    },
    {
      "id": 18485772,
      "author": "старый трейдер",
      "datetime": "2025-08-12T12:41:00.000Z",
      "text": "Roaring Kitty использовал свою популярность на платформе Redditдля организации ажиотажного спросаМихаил Шардин, тоже пример фантазий «чайников»проверяйте, открывайте график, можно прямо сейчас и смотрите самостоятельно"
    }
  ]
}