{
  "url": "https://smart-lab.ru/blog/1196714.php?nomobile=1",
  "article_id": 1196714,
  "title": "Народный Python: строим универсальный шаблон для алгоритмической торговли на Московской бирже",
  "comments": [
    {
      "id": 18528048,
      "author": "Rostislav Kudryashov",
      "datetime": "2025-08-26T06:27:00.000Z",
      "text": "В книге «Deep Learning for Time Series Forecasting in Python»приводятся данные, что в прогнозировании биржевых цен нейросети работают хуже статистических методов. Причем более поздние и сложные алгортимы хуже самой простой MLP — многослойного персептрона.Мои опыты на Pythonsourestdeeds.github.io/pdf/DeepLearning with Python.pdf«Deep Learning with Python 2Ed» Fransois Cholletс этим вполне согласуются.Обучение нейросети по истории биржевых цен не дало полезных результатов.А вот прогнозирование температуры по часовой истории погоды немецкого города Ены (Jena) оказалось лучше базового прогноза на 10%.Базовый прогноз состоит в том, что в 75% случаев, температура в конце часа отличается от начала не более 0.1 градуса."
    },
    {
      "id": 18528061,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T06:49:00.000Z",
      "text": "Rostislav Kudryashov, мой проект про Backtrader — это не про «суперточный прогноз нейросетей», а про удобный фреймворк. Хотите использовать простую SMA, ARIMA или LSTM — инструмент один и тот же."
    },
    {
      "id": 18528100,
      "author": "SergeyJu",
      "datetime": "2025-08-26T07:23:00.000Z",
      "text": "Для тепловой карты может потребоваться свободный выбор функционала. Кроме доходности, навскидку, сортино.Тема управления набором систем даже не затронута."
    },
    {
      "id": 18528158,
      "author": "Михаил",
      "datetime": "2025-08-26T08:10:00.000Z",
      "text": "Думаю не взлетит. Видно, что вы не программист. Чтобы тащить проект с открытым кодом нужны линтеры, типизация и настроенный CI с проверками. pip странно использовать на современных проектах"
    },
    {
      "id": 18528385,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T09:41:00.000Z",
      "text": "Михаил, это действительно нужно, когда проект ориентирован на разработчиков. Но моя цель другая: сделать максимально простой инструмент для розничного инвестора, а не для профессиональных программистов. Как раз из-за перегруженности инфраструктурой многие проекты становятся слишком сложными и недоступными широкой аудитории"
    },
    {
      "id": 18529168,
      "author": "Михаил",
      "datetime": "2025-08-26T12:29:00.000Z",
      "text": "Михаил Шардин, без проверок это часто скатывается в говнокод. Тут на самом деле вопрос про целевую аудиторию. Люди которые и так умеют писать и так напишут под себя со своими особенностями и ваше решение их не устроит. Кто чего-то накликивает в коробочных решениях, вряд ли будет питон осваивать"
    },
    {
      "id": 18532023,
      "author": "Juri",
      "datetime": "2025-08-27T11:27:00.000Z",
      "text": "Михаил, Вы упомянули лишь две крайности, а между ними ещё много кто есть. Например, человек имеет представление о программировании (этому чуть ли не в школе учат), но не может / хочет заниматься инфраструктурой, а его торговый алгоритм сложно / не возможно реализовать в коробочном продукте."
    },
    {
      "id": 18530041,
      "author": "Доктор",
      "datetime": "2025-08-26T16:25:00.000Z",
      "text": "Михаил Шардин, розничный инвестор это человек с депошкой 100-300к в основном с автоследованием.Это тул для гиков,, коих единицы. Надо чётче рисовать портрет своего пользователя."
    },
    {
      "id": 18528343,
      "author": "Juri",
      "datetime": "2025-08-26T09:34:00.000Z",
      "text": "А по моему, идея отличная! Желаю успеха!"
    },
    {
      "id": 18528395,
      "author": "Juri",
      "datetime": "2025-08-26T09:45:00.000Z",
      "text": "А через QUIK ваш шаблон сможет торговать?"
    },
    {
      "id": 18528448,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T10:02:00.000Z",
      "text": "Juri, да, через библиотекуgithub.com/cia76/QuikPy"
    },
    {
      "id": 18528934,
      "author": "Prophetic",
      "datetime": "2025-08-26T11:41:00.000Z",
      "text": "Михаил Шардин, Не забудьте упомянуть, что эта библиотека «честно слизана» с коннектора QUIKSharp."
    },
    {
      "id": 18529363,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T13:16:00.000Z",
      "text": "Prophetic, главное, что библиотека развивается и позволяет быстро подключить Backtrader к QUIK. Для инвестора наверное ценность именно в этом"
    },
    {
      "id": 18529527,
      "author": "Prophetic",
      "datetime": "2025-08-26T13:59:00.000Z",
      "text": "Михаил Шардин, Более главным является соблюдение лицензии Apache 2.0. Настоятельно рекомендую ознакомиться."
    },
    {
      "id": 18529575,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T14:12:00.000Z",
      "text": "Prophetic, я не автор и никак не связан ни с QUIKSharp ни с QuikPy."
    },
    {
      "id": 18529729,
      "author": "Prophetic",
      "datetime": "2025-08-26T14:56:00.000Z",
      "text": "Михаил Шардин, С Backtrader тоже никак не связаны?"
    },
    {
      "id": 18529808,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T15:26:00.000Z",
      "text": "Prophetic, я предлагаю его использовать.Обозначьте пожалуйста свою позицию, а то мы вроде как препираемся, а о чём мы спорим-то?PS. До меня дошло. Вы один из авторов этой библиотеки:github.com/finsight/QUIKSharp/blob/master/AUTHORS.md"
    },
    {
      "id": 18529843,
      "author": "Beach Bunny",
      "datetime": "2025-08-26T15:30:00.000Z",
      "text": "Prophetic, у Backtrader лицензия GPL3.0 а на Apache"
    },
    {
      "id": 18529963,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T16:00:00.000Z",
      "text": "Beach Bunny, у моего шаблона MIT.MIT — максимально либеральная лицензия: «делайте что хотите, только сохраните копирайт и отказ от гарантий».GPL-3.0 — «копилефт»: если распространяешь производную работу, то обязан распространять её также под GPL-3.0.Но мой шаблон это независимый проект, который лишь вызывает Backtrader как библиотеку."
    },
    {
      "id": 18529987,
      "author": "Beach Bunny",
      "datetime": "2025-08-26T16:08:00.000Z",
      "text": "Михаил Шардин, в main.pyна мой взгляд, не совсем корректные параметрыcerebro = bt.Cerebro(\r\n        stdstats=False, \r\n        optreturn=False if MODE == 'OPTIMIZATION' else True,\r\n        runonce=False,  # КЛЮЧЕВОЙ ПАРАМЕТР: отключаем синхронизацию данных\r\n        preload=False,  # НЕ предзагружаем все данные в память\r\n        oldsync=False,   # НЕ используем старый механизм синхронизации\r\n        exactbars=-1    # ДОБАВИТЬ: позволяет разную длину данных\r\n    )Работать будет, очень медленно, особенно тестирование.Документацию читайте и проверяйте!"
    },
    {
      "id": 18529836,
      "author": "Beach Bunny",
      "datetime": "2025-08-26T15:28:00.000Z",
      "text": "Prophetic, ну Python часть ниоткуда не слизана, а написана автором, намного через попу, но самостоятельно, а про то что остальная чсать из другого проекта, так там так и написано"
    },
    {
      "id": 18530017,
      "author": "Prophetic",
      "datetime": "2025-08-26T16:18:00.000Z",
      "text": "Beach Bunny, Да, согласен. Требования лицензии соблюдены (не сразу увидел в самом начале ссылку на QUIKSharp)."
    },
    {
      "id": 18528937,
      "author": "Антон Б",
      "datetime": "2025-08-26T11:43:00.000Z",
      "text": "Добрый день Михаил.А Walk-Forward тестирование реализовано?Дело в том что на примере sma Walk-Forward покажет что лучшие на прошлом периоде почти всегда хуже 0 на следующем.есть бектетсы.Этим страдает кстати и мета трейдер — пере оптимизируя параметры.Он есть в OSA — вы можете взять ту-же sma стратегию там и пробекстесить WF  методом.Вообще без WF оптимизация не имеет практического смысла 99%"
    },
    {
      "id": 18529367,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T13:11:00.000Z",
      "text": "Антон Б, хорошие вопросы. В текущем виде его нет"
    },
    {
      "id": 18551206,
      "author": "Антон Станкевич",
      "datetime": "2025-09-02T14:33:00.000Z",
      "text": "Михаил Шардин, возможно эта статья поможет Вам в реализацииntguardian.wordpress.com/2017/06/19/walk-forward-analysis-demonstration-backtrader/"
    },
    {
      "id": 18531101,
      "author": "GOLD",
      "datetime": "2025-08-26T23:44:00.000Z",
      "text": "Антон Б, метод WF действует на малолетних алгашей, разноцветных инфоцыган и продавцов роботов как перекись водорода для микробов)))от этого метода у них тускнеет взгляд и пропадает румянец на щеках... короче… валит микробов наповал))оно и понятно… метод окунает их головой в навоз, лишая иллюзий, подписчиков и денег… кому ж такое понравится?)))"
    },
    {
      "id": 18531415,
      "author": "Антон Б",
      "datetime": "2025-08-27T08:33:00.000Z",
      "text": "GOLD, мои боты проходят WF тесты).и некоторые! боты заказчиков проходят.но тут — «ты сам обманываться рад» — уходит много времени объяснить что такое переоптимизация.и что чем больше индикаторов тем хуже.и что должна быть какая-то неэффективность рыночная на входе в разработку.и что это ошибка выжившего — на примере дельфинов.так что да.от переоптимизации спасает.и от иллюзий.но зато дает достаточно качественную картину.кстати те кто пишет роботов для клиентов и не используют WF зарабатывают больше на разработке.это вопрос совести против денег."
    },
    {
      "id": 18529434,
      "author": "Maxim Abrosimov",
      "datetime": "2025-08-26T13:32:00.000Z",
      "text": "а в чем проблема генерировать картинки высокого разрешения?я себе такие вот генерирую под каждую стратению"
    },
    {
      "id": 18529590,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T14:15:00.000Z",
      "text": "Maxim Abrosimov, это именно через Backtrader? Matplotlib?"
    },
    {
      "id": 18532406,
      "author": "Maxim Abrosimov",
      "datetime": "2025-08-27T13:06:00.000Z",
      "text": "Михаил Шардин, визуализация matplotlib, backtrader еще не подключал! пока занимаюсь описанием паттернов для поиска сигналов! потом буду засовывать в backtrader или в backtest. хотя и на обще картинке если построить все сигналы за год или 5 — видно что происходит! надо еще риски прикрутить и правила выхода, трейлстопы может тоже! в общем есть чем заниматься)"
    },
    {
      "id": 18529625,
      "author": "amberfoxman",
      "datetime": "2025-08-26T14:27:00.000Z",
      "text": "уважаю ваши усилия, пару раз ваши скрипты помогалино конкретно этот проект — думается, из серии «больному не поможет, здоровому не нужно»"
    },
    {
      "id": 18529638,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T14:32:00.000Z",
      "text": "amberfoxman, я не в обиде. Здесь больше для того чтобы собрать конструктивную критику на основе чужого личного опыта — но как-то не очень сработало."
    },
    {
      "id": 18531425,
      "author": "Антон Б",
      "datetime": "2025-08-27T08:40:00.000Z",
      "text": "Михаил Шардин, очень хороший задел.но в какой-то момент понимаешь что нужна надежность — типизация прибитая в компилятор.и переходишь на rust \\ c# .а если еще и скорость то rust.кстати у вас используется тип float  в данных — это видно по cvs файлам.а нужен decimal.или ЦЕЛОЧИСЛЕННЫЙ int64\\int128docs.python.org/3/library/decimal.htmlпотому что с ошибками округления бороться это трешь.и брокер на такую цену с ошибкой округления вернет ОШИБКУ.особенно плохо если это будет стоп… он же в долях от цены берется.пока бектесты это мелочь.а потом вы говорите в боевой переводить — а там он эти сделки будет откидывать брокер.с неправильной ценой."
    },
    {
      "id": 18532065,
      "author": "Juri",
      "datetime": "2025-08-27T11:35:00.000Z",
      "text": "Антон Б, можно подумать, что тип  decimal избавляет от ошибок округления."
    },
    {
      "id": 18532098,
      "author": "Антон Б",
      "datetime": "2025-08-27T11:43:00.000Z",
      "text": "Juri, избавляет. цены в decimal.и лоты тоже — в своем потомке от децимал, так как торгуют лотами.и округления цен и лотов везде ловятся в момент конвертации в децимал.а не пропускаются.часто вижу код который в реальности брокер \\ биржа отбросит заявку так как округление не то.причем не все заявки а некоторые — где float сработало неожиданно оставив 0.000000002 к лоту) или к цене.можно конечно при генерации заявки все это делать и проще, но тогда план-факт по лотам\\ценам не совпадает."
    },
    {
      "id": 18529722,
      "author": "Synthetic",
      "datetime": "2025-08-26T15:09:00.000Z",
      "text": "Главная задача — построить открытый шаблон, который позволит частному инвестору, даже с небольшими навыками в программировании, сосредоточиться на главном — на разработке и тестировании стратегий, а не на борьбе с инфраструктурой.Это шаблон, который десятилетиями вбивают в голову трейдерам разнообразные инфоцыгане. На самом деле он глубоко ошибочен. Попробуйте так сделать самолет. Он не полетит.Сначала надо изучить аэродинамику, и понять, почему самолеты вообще летают. После этого Вы сможете сделать самолет, который хоть и с трудом, но оторвется от земли. После этого можно  его  тестировать и оптимизировать.Теоретическая база трейдинга ничуть не меньше аэродинамики. И требует определенных усилий для своего усвоения. Существенная разница в том, что самолет, сделанный без знания основ точно не полетит. А стратегия разработанная методом случайного тыка может заработать. И даже много заработать. Случайно. Нассим Талеб даже книжку про это написал. «Одураченные случайностью» называется."
    },
    {
      "id": 18529813,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T15:22:00.000Z",
      "text": "Synthetic, кажется задача слегка проще"
    },
    {
      "id": 18531436,
      "author": "Антон Б",
      "datetime": "2025-08-27T08:42:00.000Z",
      "text": "Михаил Шардин, сделать летающий самолет — любительский.или вот на квадриках что-то поднимающее человека.ГОРАДО ПРОЩЕ чем рабочую стратегию.и ДЕШЕВЛЕ.Вот пройти потом лицензию с уже летающим прототипом — да это много бумажной волокиты."
    },
    {
      "id": 18529782,
      "author": "Алекс П",
      "datetime": "2025-08-26T15:11:00.000Z",
      "text": "зачем сохранять график, когда можно использовать визуализацию вроде apache superset?"
    },
    {
      "id": 18529821,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T15:23:00.000Z",
      "text": "Алекс П, посмотрю, спасибо"
    },
    {
      "id": 18530633,
      "author": "Алекс П",
      "datetime": "2025-08-26T19:43:00.000Z",
      "text": "Михаил Шардин, нужно покопаться, какая библиотека хорошо подходит для графиков акций. Plotly для этого точно используется."
    },
    {
      "id": 18529881,
      "author": "Beach Bunny",
      "datetime": "2025-08-26T15:41:00.000Z",
      "text": "Тебе надо новую рисовалку графиков подключить, с блек-джеком и шл**ми — с нормальным zoom, маштабированием и прочим.Библиотек которые рисуют свечные графики под Python сейчас много, выбираешь и делаешь.Там работы всего то на 2-4недели !"
    },
    {
      "id": 18529892,
      "author": "Михаил Шардин",
      "datetime": "2025-08-26T15:45:00.000Z",
      "text": "Beach Bunny, какую библиотеку посоветуешь?"
    },
    {
      "id": 18530319,
      "author": "Synthetic",
      "datetime": "2025-08-26T18:05:00.000Z",
      "text": "Beach Bunny,Вот умеете Вы все усложнять...Получаешь данные (realtime), делаешь инсерт в скуль и имеешь картинку (с масштабированием, зумом и т.п.)  в браузере:А потом 2-4 недели попиваешь пивко… ;)PS: Но я свечи ненавижу. Только тики. Поэтому вот так:"
    },
    {
      "id": 18530354,
      "author": "Beach Bunny",
      "datetime": "2025-08-26T18:03:00.000Z",
      "text": "Synthetic, и хде индикаторы, хде сделки ?Зум готовой статичной-картинки, он нам им даром не нужон.Нужно чтобы отдельный участок можно было отмаштабировать и картинку подвигать, типа как в TradingView на графиках.А это можете оставить себе."
    },
    {
      "id": 18530413,
      "author": "Synthetic",
      "datetime": "2025-08-26T18:30:00.000Z",
      "text": "Beach Bunny,Индикаторов нет, они исключительно для лохов.Это реал-тайм график. Период обновления указан в верхнем правом углу — 1с. Можно и 0,1с поставить, но мне это не нужно. А сделок нет специально, а то слюной подавитесь… :)"
    },
    {
      "id": 18531489,
      "author": "Антон Б",
      "datetime": "2025-08-27T08:58:00.000Z",
      "text": "Synthetic, а сделки где? есть возможность из коробки показать сделки.не только голый график.и индикаторы для лохов — ну такое себе.а доверительный интервал 5% это тоже для лохов к примеру?а линии показывающие страйки опционов… там где опцины выходят в деньги\\уходят из денег — это тоже для лохов?вся математика для дохов?и опционная доска для лохов?не обязательно индикаторы это бред вида macd в луне)"
    },
    {
      "id": 18537193,
      "author": "Скромный комментатор",
      "datetime": "2025-08-28T19:50:00.000Z",
      "text": "Synthetic, о, графана!"
    },
    {
      "id": 18530359,
      "author": "Beach Bunny",
      "datetime": "2025-08-26T18:07:00.000Z",
      "text": "Synthetic, а еще нужно вот такой вот анализ результативностиgithub.com/ranaroussi/quantstats(желательно чуть получше)"
    },
    {
      "id": 18530420,
      "author": "Synthetic",
      "datetime": "2025-08-26T18:33:00.000Z",
      "text": "Beach Bunny,а еще нужно вот такой вот анализ результативностиЯ стремлюсь к стабильной доходности 10% в день. Поверьте, когда Вы этого достигнете, все эти графики Вам нах не будут нужны."
    },
    {
      "id": 18531248,
      "author": "Михаил Шардин",
      "datetime": "2025-08-27T04:32:00.000Z",
      "text": "Synthetic, сказки всё это.10%в день * 250 торговых дней в году = 2500% годовых.Пусть будет начальный капитал 10 тысяч.1. Через 5 дней: 10 000 × 1.1⁵ ≈ 10 000 × 1.61 = 16 100 руб.2. Через 10 дней: 10 000 × 1.1¹⁰ ≈ 10 000 × 2.59 = 25 900 руб.3. Через 20 дней: 10 000 × 1.1²⁰ ≈ 10 000 × 6.73 = 67 300 руб.4. Через 30 дней (1.5 месяца): 10 000 × 1.1³⁰ ≈ 10 000 × 17.45 = 174 500 руб.5. Через 44 дня: 10 000 × 1.1⁴⁴ ≈ 10 000 × 80 = 800 000 руб. Ваши 10 тысяч превращаются в 800 тысяч менее чем за 2 месяца.6. Через 60 дней: 10 000 × 1.1⁶⁰ ≈ 10 000 × 304 = 3 040 000 руб.7. Через 100 дней: 10 000 × 1.1¹⁰⁰ ≈ 10 000 × 13 781 = 137 810 000 руб. (137 миллионов рублей).Продолжать?"
    },
    {
      "id": 18531365,
      "author": "Synthetic",
      "datetime": "2025-08-27T08:11:00.000Z",
      "text": "Михаил Шардин,Здесь много говорят о том, что плечи убивают депозит. Я вот так не считаю. Разумные плечи (а мосбиржа других и не дает) весьма полезны.Гораздо вреднее пресловутое реинвестирование. Чудес не бывает. На бирже высокая прибыль равноценна высокому риску. Поэтому прибыль надо выводить и реинвестировать туда, где это будет оптимально, обязательно предварительно хорошо подумав.А помечтать конечно не вредно…"
    },
    {
      "id": 18531508,
      "author": "Антон Б",
      "datetime": "2025-08-27T09:09:00.000Z",
      "text": "Михаил Шардин, перепись тех кто реально кодит под алго устроил просто.спасибо!"
    },
    {
      "id": 18530367,
      "author": "Beach Bunny",
      "datetime": "2025-08-26T18:10:00.000Z",
      "text": "Synthetic, ужасная кардиограмма, срочно вызывайте реанимобиль с бригадой"
    },
    {
      "id": 18530770,
      "author": "SergeyJu",
      "datetime": "2025-08-26T20:43:00.000Z",
      "text": "Urtrade, я про это же."
    },
    {
      "id": 18530806,
      "author": "Turbo Pascal",
      "datetime": "2025-08-26T21:01:00.000Z",
      "text": "Питон питоном, но я бы предпочел расчетную часть писать фундаментально, на Java.Делал так: на lua в Quik только маленький модуль двусторонней связи, который сразу перебрасывает данные в endpoint, а там уже Java во всей красе обрабатывает и укладывает данные а postgres, и потом работает с ними. И обратно команды на сделки кидает в Lua. В теории туда же можно натравить питон для анализа и каких то решений. Но я питон не люблю.Визуально морда — на react, тащит данные через то же джавовкое бэк-приложение по rest.Но потом что-то всё забросил, скучно стало. Надо бы поднять архив, ещё покопаться."
    },
    {
      "id": 18530952,
      "author": "Synthetic",
      "datetime": "2025-08-27T08:06:00.000Z",
      "text": "Turbo Pascal,Делал так: на lua в Quik только маленький модуль двусторонней связи, который сразу перебрасывает данные в endpointQuik был сделан в те времена, когда ядро биржи работало на MS SQL SERVER. Брокерский сервер естественно тоже работал на MS SQL SERVER. Протокол квиковский был рассчитан на обмен между SQL серверами. Поэтому терминал Quik Весь пропитан идеологией SQL. Поэтому есть возможность, по крайней мере теоретическая, используя локальный MS SQL сервер, получить у себя что-то вроде локального дубля брокерского сервера (ессно read only).Это можно сделать вообще без квика с использованием «Модуля экспорта биржевой информации.» Но можно попытаться и с квиком, который заносит в SQL всю необходимую информацию по odbc. При этом обеспечивая синхронизацию с брокерским сервером, обрабатывая разрывы связи и т.п. Читать из SQL может кто и что и как угодно. А заявки можно посылать и через dll, если конечно у Вас не ХФТ. С MS SQL сервером работает очень стабильно. Включил и забыл. Пробовал с другими — не работает вообще...Все это к тому, что можно не тратить особо усилия на добывание данных из Quik. Но это для тех. кто с SQL на ты."
    },
    {
      "id": 18531185,
      "author": "Андрей К",
      "datetime": "2025-08-27T00:53:00.000Z",
      "text": "Synthetic, вроде как на ms sql они начали строить срочный рынок )а другие сектора были на других движках, более модных в нулевых"
    },
    {
      "id": 18531331,
      "author": "Synthetic",
      "datetime": "2025-08-27T07:37:00.000Z",
      "text": "Андрей К,Ну, для меня в то время других рынков, кроме срочного, как бы и не существовало.Скучные они были какие-то."
    },
    {
      "id": 18531225,
      "author": "Replikant_mih",
      "datetime": "2025-08-27T02:29:00.000Z",
      "text": "LLM и вайбкодинг при разработке проекта используете? Щас сильно меньше порог входа стал в эти (соорудить что-то своё) вещи стал."
    },
    {
      "id": 18531249,
      "author": "Михаил Шардин",
      "datetime": "2025-08-27T04:33:00.000Z",
      "text": "Replikant_mih, это современный инструмент, странно если не использовать"
    },
    {
      "id": 18531698,
      "author": "Андрей К",
      "datetime": "2025-08-27T10:02:00.000Z",
      "text": "Replikant_mih,вайбкодингпрочитал что это такоея сейчас веб управление и мониторинг делал. Вот 1 в 1 вайбкодинг )"
    },
    {
      "id": 18532151,
      "author": "Replikant_mih",
      "datetime": "2025-08-27T11:54:00.000Z",
      "text": "Андрей К, ) Ну это по сути ярлык для того, чтобы разные люди понимали, что речь о вот этом. На мой взгляд не идеально описывает явление.Ну и я тут вкладываю использование специальных IDE по типу Cursor. Чтобы не просто ChatGPT по запросу код писал, а чтоб система могла за рычажки дергать, сама смотреть ошибки, запускать команды и т.д."
    },
    {
      "id": 18532076,
      "author": "Антон Б",
      "datetime": "2025-08-27T11:37:00.000Z",
      "text": "Synthetic, смотреть где делает сделки автоматический бот в реале, и на истории — на бектесте.важно.так-же важно видеть где именно делает бот сделки, и где ты\\я ожидал, просто на этапе теста работы.тоже полезно — тест бота.хотя можно как-то прикрутить автотесты — но я не делал так.наверно можно, но не делал.сравнивать фильтр сделок."
    },
    {
      "id": 18548222,
      "author": "broker25",
      "datetime": "2025-09-01T17:11:00.000Z",
      "text": "А зачем??? Сложность реализации в изменении и уточнении позиции. С этим BT не поможет. Индикаторы там написаны как-то сложно, дольше времени потришь на изучение и исправление. Чатгпт сделает любой индикатор и внедрить его в код будет на порядок проще, чем с BT, у которого куча собственных тараканов. Ну разве что вы собираетесь торговать рыночными заявками, но это же аут полный. В чем смысл?"
    },
    {
      "id": 18548268,
      "author": "Михаил Шардин",
      "datetime": "2025-09-01T17:32:00.000Z",
      "text": "broker25, немного не понял какую альтернативу вы предлагаете?"
    },
    {
      "id": 18548363,
      "author": "Роман Захаров",
      "datetime": "2025-09-01T17:59:00.000Z",
      "text": "С точки зрения визуализации посмотри в сторонуgrafana.com/— туда можно сливать сырые данные и там уже строить графики в динамике."
    },
    {
      "id": 18551472,
      "author": "Антон Станкевич",
      "datetime": "2025-09-02T15:22:00.000Z",
      "text": "Инициатива с шаблоном хорошая. Сам смотрел в сторону backtrader и так руки не дошли разобраться. В общем клонировал репозиторий, буду изучать.А насчёт визуализации можно посмотреть в строну plotly:pypi.org/project/backtrader-plotly/Библиотека позволяет строить интерактивные графики, что можно попробовать использовать для анализа стратегий."
    },
    {
      "id": 18560691,
      "author": "Константин Комаров",
      "datetime": "2025-09-05T08:08:00.000Z",
      "text": "Проблема алгоритмов в проскальзывании и нудно ещё учитывать объемы в моменте, а так же крайне не эффективны утренние и вечерние сессии. В итоге если алгоритм научился учитывать объемы, то есть более простые и эффективные алгоритмы."
    }
  ]
}