{
  "url": "https://smart-lab.ru/blog/1210344.php?nomobile=1",
  "article_id": 1210344,
  "title": "В сердце российского HFT: как я съездил на мастер-класс для «квантов» и что понял о больших деньгах",
  "comments": [
    {
      "id": 18638271,
      "author": "myaucha",
      "datetime": "2025-09-28T08:12:00.000Z",
      "text": "Написано хорошо. Наиболее логично выглядит доклад Рамиза. Примерно такой принцип пробовал для индекса ммвб. Создавал справедливое значение его фьючерса. Но ничего не получилось. Комиссия и проскальзывание многократно превышали все неэффективности. На истории был 200 т р. профит в месяц 1-3 контрактами и плавное эквити, а в реале — убыток и неисполнение сделок по заявочным ценам."
    },
    {
      "id": 18639051,
      "author": "Night Bars",
      "datetime": "2025-09-28T13:05:00.000Z",
      "text": "myaucha, фиг знает, что там за логика называть арбитражем(«раздвигая концепцию») то, что таковым не является…"
    },
    {
      "id": 18638293,
      "author": "RiskTrader",
      "datetime": "2025-09-28T08:25:00.000Z",
      "text": "реклама викинга, заплатили хоть?"
    },
    {
      "id": 18638299,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T08:27:00.000Z",
      "text": "RiskTrader, мне кажется это всё-таки это не реклама, тем более я написал это добровольно и мне никто ничего не платил"
    },
    {
      "id": 18638316,
      "author": "RiskTrader",
      "datetime": "2025-09-28T08:32:00.000Z",
      "text": "Михаил Шардин, ну и зря, надо было просить деньги, Курбанову конечно прикольно когда за бесплатно пиарят его бизнес"
    },
    {
      "id": 18638319,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T08:34:00.000Z",
      "text": "RiskTrader, тут ведь вопрос такой — есть ли какие-то альтернативы этой системы для HTF?"
    },
    {
      "id": 18638330,
      "author": "RiskTrader",
      "datetime": "2025-09-28T08:39:00.000Z",
      "text": "Михаил Шардин, конечно есть — собственные мозги, огромное количество хфтешников в единственном числе, хотя есть и команды по несколько человек. Есть прямое подключение к бирже. Ты недавно что ли на бирже?"
    },
    {
      "id": 18638398,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T09:06:00.000Z",
      "text": "RiskTrader, как я и указал в самом начале статьи, это мой личный взгляд. Я не связан с организаторами и поделился впечатлениями добровольно. Моей целью было показать срез индустрии, а не рекламировать конкретную платформу."
    },
    {
      "id": 18638318,
      "author": "Vkt",
      "datetime": "2025-09-28T08:33:00.000Z",
      "text": "нужен стартовый капитал минимум 30–50 миллионов рублейИнтересно, какая доходность будет на этот капитал. Что-то мне подсказывает, что не сильно больше депозитов. Но если важен процесс, то почему бы и нет."
    },
    {
      "id": 18638343,
      "author": "RiskTrader",
      "datetime": "2025-09-28T08:44:00.000Z",
      "text": "Vkt, про стартовый капитал конечно фигня полная написана, просто автор особо не в теме"
    },
    {
      "id": 18638359,
      "author": "Vkt",
      "datetime": "2025-09-28T08:52:00.000Z",
      "text": "RiskTrader, вот именно! Рынок еле еле шевелится, в какое «хфт» такие деньги можно запихнуть не понятно."
    },
    {
      "id": 18640027,
      "author": "Андрей К",
      "datetime": "2025-09-28T21:00:00.000Z",
      "text": "Vkt,Интересно, какая доходность будет на этот капитал. Что-то мне подсказывает, что не сильно больше депозитовв текущих реалиях, 50млн норм прожевываются в hft. Доходность сильно зависит от инфраструктуры. В любом случае, это значительно выше банковских."
    },
    {
      "id": 18638377,
      "author": "Hydraplazmoonic25",
      "datetime": "2025-09-28T09:01:00.000Z",
      "text": "Купить робота-гуманоида дешевле и рубить бабосик на тиктоке)"
    },
    {
      "id": 18638407,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T09:09:00.000Z",
      "text": "Hydraplazmoonic25, в озможно, на следующей конференции кто-то представит доклад о парсинге трендов Тиктока для арбитража на акции медиакомпаний :)"
    },
    {
      "id": 18638389,
      "author": "Маркиз Лафайет",
      "datetime": "2025-09-28T09:05:00.000Z",
      "text": "На какие биржи ориентированы эти системы? Есть ли торгующие на условном Байбите? Как результат?"
    },
    {
      "id": 18638405,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T09:08:00.000Z",
      "text": "Маркиз Лафайет, надо компанию позвать в комментарии — у меня нет информации"
    },
    {
      "id": 18640033,
      "author": "Андрей К",
      "datetime": "2025-09-28T21:02:00.000Z",
      "text": "Маркиз Лафайет, тут же пиарят Викинги с Алором. Точнее Викинги на базе Алора сами себя пиарят.А они делают инфраструктуру для начинающих на РФ. Точнее сосредоточились на РФ.Раньше конечно, они пытались на разные рынки залезать своими услугами"
    },
    {
      "id": 18638428,
      "author": "Вазелин",
      "datetime": "2025-09-28T09:24:00.000Z",
      "text": "Понятно. Итог то какой? Дайте нам денег на алго под 6% от сча, мы его либо просрем на комиссиях либо просто просрем. Так?Сколько в сухом остатке эти гении наторговали на коинтах за последний год чистыми на карман, и какой суммой можно зайти в этот бизнес, так как с криптоговном всегда проблемы с большими суммами и выводом денег."
    },
    {
      "id": 18638450,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T09:28:00.000Z",
      "text": "Вазелин, опять вы? Вы в теме или как обычно всех поливаете?"
    },
    {
      "id": 18638471,
      "author": "Вазелин",
      "datetime": "2025-09-28T09:40:00.000Z",
      "text": "Михаил Шардин, я без дела не поливаю. Мы поняли что вы аля умные. Результат покажите! А то и я в поле умею хорошо яму копать а потом ее закапывать"
    },
    {
      "id": 18639372,
      "author": "dronrus",
      "datetime": "2025-09-28T15:43:00.000Z",
      "text": "Михаил Шардин, Голодранец вазелин пусть cвсю доходность покажет"
    },
    {
      "id": 18638455,
      "author": "cerberus",
      "datetime": "2025-09-28T09:42:00.000Z",
      "text": "Вазелин, теперь «викинги» занимаются сдачей своих роботов в аренду, обучением и прочей лабудой, что указывает на «эффективность» их продуктов. Если бы их роботы приносили хорошие деньги, они бы в околорынок не лезли."
    },
    {
      "id": 18638479,
      "author": "Вазелин",
      "datetime": "2025-09-28T09:44:00.000Z",
      "text": "cerberus, потом выяснится что торговать сухофруктами на базаре выгоднее, либо держать бапки на вкладе"
    },
    {
      "id": 18638523,
      "author": "Sawwa",
      "datetime": "2025-09-28T10:01:00.000Z",
      "text": "Вазелин, 6% в месяц если только, менее не интересно 🤣"
    },
    {
      "id": 18638448,
      "author": "Sawwa",
      "datetime": "2025-09-28T09:27:00.000Z",
      "text": "Мд-яяя 🤦"
    },
    {
      "id": 18638451,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T09:28:00.000Z",
      "text": "Sawwa, что вас печалит?"
    },
    {
      "id": 18638517,
      "author": "Sawwa",
      "datetime": "2025-09-28T09:59:00.000Z",
      "text": "Михаил Шардин, да куда то ни туда мир катится"
    },
    {
      "id": 18638459,
      "author": "cerberus",
      "datetime": "2025-09-28T09:35:00.000Z",
      "text": "А где фотография аудитории? Или вы друг перед другом выступали — все шесть человек?!Сколько человек хоть было?"
    },
    {
      "id": 18638473,
      "author": "Вазелин",
      "datetime": "2025-09-28T09:41:00.000Z",
      "text": "cerberus, ну. Собрались, роботов понаписали, запустили а результат отрицательный"
    },
    {
      "id": 18638484,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T09:46:00.000Z",
      "text": "cerberus, около 40, может чуть больше"
    },
    {
      "id": 18638497,
      "author": "SergeyJu",
      "datetime": "2025-09-28T09:50:00.000Z",
      "text": "cerberus, для плодотворной работы и 10 человек достаточно. А 2 000 нужны только устроителям конфы."
    },
    {
      "id": 18638489,
      "author": "SergeyJu",
      "datetime": "2025-09-28T09:48:00.000Z",
      "text": "Большие деньги — это только ДУ. ХФТ — это большие проценты, больших денег в наших условиях  там нет и быть не может.Просто для иллюстрации моей мысли.Алго на нашем рынке едва ли потянет 10 млрд. рублей, если мы хотим иметь плюс к индексам в дохе и несколько меньший риск. А один только фонд LQDT уже набрал более 250 млрд.Успех Вангарда на американском рынке тоже показателен. Индексы, низкие издержки и умелая реклама."
    },
    {
      "id": 18639691,
      "author": "ves2010",
      "datetime": "2025-09-28T18:33:00.000Z",
      "text": "SergeyJu, алго не может быть больше 2-5% от обьема свечи… иначе бот начнет влиять на рынок и сам двигать цену… в резалте будет торговать сам с собой… т.е для 5 ти минутки ри это контрактов...тоже правило действует и на количество сделок… т.е если в день в инструменте 2000 сделок то реально протащить без проскальзываения 50-100 сделок..."
    },
    {
      "id": 18638546,
      "author": "Sawwa",
      "datetime": "2025-09-28T10:07:00.000Z",
      "text": "Все пытаются сделать бизнес на том как надо торговать, это перекуры в сфере ЦБ.Зачем такие длинные связи и лишние цепочки не понимаю.Как всегда строиться какая махинация — да ещё и с такими деньгами 30-50 млн, да я бы как был сказано ни за что не понес такие деньги в «игру»На 30 млн надо построить под ключ 2 миниперкарни с прибылью до 5-7 млн в год каждая.Это бизнес!Это производство!Это трудоустройство людей, да это геморойно, да это сложно, но бизнес и не должен быть лёгким, иначе все были бы бизнесменами 🤣"
    },
    {
      "id": 18638563,
      "author": "SergeyJu",
      "datetime": "2025-09-28T10:13:00.000Z",
      "text": "Sawwa, это сказки про бизнес. Уж сколько таких минипекарен, пиццерий разорилось… мало кто успешен, но на виду только они. Ошибка выжившего."
    },
    {
      "id": 18638673,
      "author": "Sawwa",
      "datetime": "2025-09-28T10:54:00.000Z",
      "text": "SergeyJu, не согласен вообще!Разорились ленивые и не успевающие адаптироваться к рынку, кто хочет тот всегда находит выход!Бизнес это бесконечные вызовы — и если их не решать то бизнеса не станет!Бизнес всегда было сложно (если ты сам без аффилированных лиц)Но на то и есть бизнес когда ты рискуешь и работаешь 24/7"
    },
    {
      "id": 18638757,
      "author": "SergeyJu",
      "datetime": "2025-09-28T11:30:00.000Z",
      "text": "Sawwa, бизнес всегда сложно! Особенно если бизнес свой и с нуля. Ну так и на рынке тоже самое. Выживают или индексные инвесторы ( включая сюда сторонников всех вариантов всепогодных портфелей и ленивых инвесторов) или те же 5% от тех, кто пытается спекулировать."
    },
    {
      "id": 18638893,
      "author": "Sawwa",
      "datetime": "2025-09-28T12:23:00.000Z",
      "text": "SergeyJu, один умный человек сказал, что на биржу несут лишние деньги (с которым морально надо попрощаться), с 30-50 млн я не готов морально прощаться. 🤣"
    },
    {
      "id": 18638770,
      "author": "Gypsy",
      "datetime": "2025-09-28T11:33:00.000Z",
      "text": "Sawwa, каждому свое. Я бы ни за что не понес 30 млн в пекарни, им и на брокерском счете хорошо, спокойнее)"
    },
    {
      "id": 18638885,
      "author": "Sawwa",
      "datetime": "2025-09-28T12:30:00.000Z",
      "text": "Gypsy, и каковы результаты?Пекарня — недвижка, производство, и кушать все хотят.Акции сегоня есть завтра может и не статьКаждому свое не спорю, в акции закинуть можно что осталось после запуска производства, все таки несколько корзинок для 🪺 лучше будет"
    },
    {
      "id": 18640901,
      "author": "Маркиз Лафайет",
      "datetime": "Вчера в 09:18",
      "text": "Sawwa, такие бизнесы открываются на кредитные деньги, а не на свои. У чела есть огромное желание сделать бизнес, развивать итд. Есть понимание темы. Часть денег — свои, часть инвесторов, часть кредиты. С текущими ставками это бессмысленно. Если у чела есть 30+млн, зачем ему нырять в алый океан и  покупать себе рабочее место, зачем ему геморрой за свои деньги."
    },
    {
      "id": 18641344,
      "author": "Sawwa",
      "datetime": "Вчера в 10:54",
      "text": "Маркиз Лафайет, вы все такие умные, все такие смышлёные, знаете как распорядиться средствами правильно, но почему вы все бедные?У меня куча примеров когда люди брали и делали и делают, да работают!Но потом это приносит прибыль, и люди занимаются тем (пусть это сильно не нравится но это оплачивается очень хорошо)Почему я не бизнесмен — потому что у меня работа удаленка, я ее знаю как свои 5 пальчиков, и она хорошо оплачиваемая, смысла не вижу лезть в бизнес где я ничего не понимаю.Я буду доделать то в чем я докаНе понимаю вас совсем 😅"
    },
    {
      "id": 18641359,
      "author": "Маркиз Лафайет",
      "datetime": "Вчера в 10:55",
      "text": "Sawwa, рад за них. Все хорошо!)"
    },
    {
      "id": 18638558,
      "author": "22022022",
      "datetime": "2025-09-28T10:10:00.000Z",
      "text": "Тема не классического арбитража очень интересная и большая, главное не запутаться))По опыту: Любой не связанный арбитраж, на 1 инструменте или на нескольких, это по сути одноногий арбитраж, или просто направленная торговля со всеми вытекающими."
    },
    {
      "id": 18638628,
      "author": "Главком Главком",
      "datetime": "2025-09-28T10:41:00.000Z",
      "text": "Надеюсь хоть за вход деньги не брали как на некоторых конфах)?"
    },
    {
      "id": 18638639,
      "author": "Михаил Шардин",
      "datetime": "2025-09-28T10:43:00.000Z",
      "text": "Главком Главком, не было платы"
    },
    {
      "id": 18638648,
      "author": "Главком Главком",
      "datetime": "2025-09-28T10:47:00.000Z",
      "text": "Михаил Шардин, хоть это хорошо, пообщались, обменялись мнениями, развеялись)"
    },
    {
      "id": 18638657,
      "author": "cerberus",
      "datetime": "2025-09-28T10:50:00.000Z",
      "text": "Главком Главком, москвичам удобно, а дядь Мише пришлось лететь, за булочку с индейкой, и всё за свой счёт."
    },
    {
      "id": 18638652,
      "author": "Федор Подпольный",
      "datetime": "2025-09-28T10:48:00.000Z",
      "text": "Цыгане со стажем, особенно Власов"
    },
    {
      "id": 18638666,
      "author": "cerberus",
      "datetime": "2025-09-28T10:51:00.000Z",
      "text": "Федор Подпольный, Усанов из той же серии. В общем, состав спикеров выдающийся!"
    },
    {
      "id": 18638767,
      "author": "SergeyJu",
      "datetime": "2025-09-28T11:33:00.000Z",
      "text": "cerberus, тем не менее, люди обсуждали вполне понятные и имеющие прикладное значение вещи. А не успешный успех. Думаю, что автор свою поездку окупил свежими впечатлениями и дополнительной мотивацией к работе.В алго нет торной дороги, и это хорошо."
    },
    {
      "id": 18638772,
      "author": "Gypsy",
      "datetime": "2025-09-28T11:35:00.000Z",
      "text": "Федор Подпольный, а зачем нецыгану вещать что-то с трибуны? Особенно, что-то полезное? Чтобы наплодить себе конкурентов и разделить с ними поляну?"
    },
    {
      "id": 18638981,
      "author": "Vkt",
      "datetime": "2025-09-28T12:46:00.000Z",
      "text": "Gypsy, вот это у меня самый главный вопрос, ответа на который мы не услышим"
    },
    {
      "id": 18639176,
      "author": "Федор Подпольный",
      "datetime": "2025-09-28T14:03:00.000Z",
      "text": "Gypsy,а зачем нецыгану вещать что-то с трибуны? Особенно, что-то полезное? Чтобы наплодить себе конкурентов и разделить с ними поляну?Обычно они отвечают — чтобы принести пользу обществу :)"
    },
    {
      "id": 18638692,
      "author": "Sawwa",
      "datetime": "2025-09-28T11:04:00.000Z",
      "text": "цЫганята ещё собираются кучкуются и обсуждают правдоподобную и рабочую прокладку которую можно всунуть лошку на серьезных щах 🤣"
    },
    {
      "id": 18638694,
      "author": "igor12",
      "datetime": "2025-09-28T11:19:00.000Z",
      "text": "Что то дизайн  сайта викинга  уж очень напоминает сайт  Алго капитала…         Тож алго трейдуны и собирали деньги  в ДУ с доверчивых клиентов…             и который в итоге плохо кончил…У Аэрофлота (очевидно)- не лучшие времена...-кормит клиентов плюшками с полным набором ЕХХХ."
    },
    {
      "id": 18638702,
      "author": "Илья I",
      "datetime": "2025-09-28T11:08:00.000Z",
      "text": "Кто-то носит «умные часы». А кому-то нравиться классика. Отличная механика или десятилетиями работающий кварц.IMXO по мне ближе второе."
    },
    {
      "id": 18638725,
      "author": "Сиделец",
      "datetime": "2025-09-28T11:17:00.000Z",
      "text": "если эти условные 30 лямов занести «для начала», отстроить всё, и больше не заносить — сколько примерно (ну совсем совсем примерно) будет выходить в год выхлопа? И сколько от него останется за вычетом аренды, оплаты доступа, зарплаты текущей разработчикам?"
    },
    {
      "id": 18638775,
      "author": "SergeyJu",
      "datetime": "2025-09-28T11:37:00.000Z",
      "text": "Сиделец, на 30 лямов можно вполне торговать среднесрочные системы, имея +10%+20% к инфляции  и не напрягаясь особо."
    },
    {
      "id": 18638793,
      "author": "Сиделец",
      "datetime": "2025-09-28T11:46:00.000Z",
      "text": "SergeyJu, +10%+20% к инфляции считая какую сумму? изначальные 30 лямов, или то что останется после расходов на создание инфраструктуру и разработку системы? Если второе — то сколько останется то? (чтобы примерно прикинуть к какой сумме доходность считать).Ну и второй вопрос остаётся — это «грязными», или после расходов текущих на инфтраструктуру и текущих зарплат разработчикам и прочим? (а то может быть оно вообще не сможет прожить дольше пары лет без непрерывного подпитывания свежим капиталом новоокученных)."
    },
    {
      "id": 18645668,
      "author": "zhorzh",
      "datetime": "Сегодня в 09:07",
      "text": "Сиделец, на среднесрочные не нужно ничего разрабатывать, их руками торгуют"
    },
    {
      "id": 18646545,
      "author": "Сиделец",
      "datetime": "Сегодня в 11:57",
      "text": "zhorzh, я же имел ввиду не стиль торговли, а длительность занятия этим делом."
    },
    {
      "id": 18638829,
      "author": "Сиделец",
      "datetime": "2025-09-28T12:01:00.000Z",
      "text": "SergeyJu, и мне кажется измерять нужно не «к инфляции», а к безрисковой прибыли на ОФЗ, или к индексу, например. Заработки ведь будут проходить не на инфляционых движениях, а на стоимости добра на бирже? А если там пила/боковик на год, а «за бортом» — нормальная такая инфляция по 50%, 100%. А «рынок» тупо топчется, ибо в моменте дураков и денег нет — всё идёт в реальные активы, разгоняемые инфляцией."
    },
    {
      "id": 18642293,
      "author": "Sawwa",
      "datetime": "Вчера в 14:12",
      "text": "SergeyJu, и засесть в минусах, ни кого тут не видел торгующего в + стабильноЛибо повезло пару раз и все на этом"
    },
    {
      "id": 18639058,
      "author": "nnnd",
      "datetime": "2025-09-28T13:09:00.000Z",
      "text": "Сиделец,Лично знаю HFT были самыми быстрыми (с их слов) у нас на бирже пару лет назад (после СВО)Счет 15 млн рублей, зарабатывали в месяц 7.5 млн рублей, из которых 2.5 млн рублей в месяц тратили на косты. Потом на их место пришли ребята, которые еще быстрее.Так же знаю арбитражеров с суммой под управлением порядка 8 ярдов на нашей бирже, так у них доходность не более 20%-25% в год в рублях."
    },
    {
      "id": 18639078,
      "author": "Сиделец",
      "datetime": "2025-09-28T13:16:00.000Z",
      "text": "nnnd, c 15 лямов 60 в год чистыми? выводят всё? (ну иначе там давно не 15 было бы уже)."
    },
    {
      "id": 18639099,
      "author": "Vkt",
      "datetime": "2025-09-28T13:22:00.000Z",
      "text": "Сиделец, да уж, с трудом верится в эти цифры"
    },
    {
      "id": 18639121,
      "author": "nnnd",
      "datetime": "2025-09-28T13:35:00.000Z",
      "text": "Сиделец,c 15 лямов 60 в год чистыми? выводят всё? (ну иначе там давно не 15 было бы уже).Вы наверно не понимаете суть HFT.Люди нашли неэффективность, это неэффективность по деньгам не масштабируема от слова Совсем. Они ее (эту неэффективность) использовали условно 6-9 месяцев, зарабатывали как я написал выше, затем пришли более быстрые ребята и данную неэффективность «скушали» (условно неэффективность ушла).К примеру, что сам торговал до СВО (но это не HFT, просто неэффективность) — фьюч на ETF эсенпи на утренней сессии — была утром неэффективность, так как не было маркетоса, задергивали рынок вверх или вниз, затем в 9 часов приходил маркетос и схлопывал разницу, ты об маркетоса крыл свой набранный с 7 до 9 лонг (или шорт). Аналогично было на золоте (конракт в рублях)"
    },
    {
      "id": 18639147,
      "author": "Сиделец",
      "datetime": "2025-09-28T13:48:00.000Z",
      "text": "nnnd, я понимаю что и по времени неэффективности долго не живут, и ёмкость ограничена. потому и спрашиваю."
    },
    {
      "id": 18639144,
      "author": "nnnd",
      "datetime": "2025-09-28T13:45:00.000Z",
      "text": "Сиделец,c 15 лямов 60 в год чистыми? выводят всё? (ну иначе там давно не 15 было бы уже).А что Вас так сильно удивляет, есть ребята в пропах, которые руками зарабатывают аналогичные суммы. К примеру директор одного пропа в Москве (парень 30 лет) с 3 млн рублей с февраля этого года заработал 40 млн рублей.Да, проп это огромные плечи, покупательская способность условно на 10 млн рублей — 150 млн на фонде, 100 на срочке и 100 на валютке и это одновременно, а не суммарно по секциям.  Причем на срочке еще и пониженное ГО в 2 раза (грубо чтобы Вы понимали на 10 млн рублей КПУР может купить грубо 300 контрактов большого микса, в пропе можно открыть позу на 6000 контрактов, в 20 раз больше)"
    },
    {
      "id": 18639152,
      "author": "Сиделец",
      "datetime": "2025-09-28T13:51:00.000Z",
      "text": "nnnd, всяко это не для всех. и тех, кто тянет — не много, и тянут они не одинаково с года в год — пару раз сработает и достаточно, кто-то другой станет главным.Если бы всё было просто смартлаб был бы забит богатенькими."
    },
    {
      "id": 18639163,
      "author": "nnnd",
      "datetime": "2025-09-28T13:58:00.000Z",
      "text": "Сиделец,всяко это не для всехКонечно не для всех. Это единицы из миллионов. Но такие люди есть и они обычно совершенно не публичны."
    },
    {
      "id": 18640944,
      "author": "Ratio_",
      "datetime": "Вчера в 09:41",
      "text": "nnnd, зачем после СВО пару лет назад нужен был HFT, когда неэффективности были примерно везде, долго, очень долго и по несколько процентов, в некоторых случаях до 5-8% на круг?Простой пример с RSX, которым торговал до упора, зачем в то время нужен был HFT? Или газ с нефтью — вот тебе целый день, а то и два стоит раздвижка в 3%, загружаешься обеими ногами и через день выгружаешься и так года два продолжалось. Сизифов труд это называется или как изгаляться так, чтобы толкать в гору камень. Найти вариант толкать с горы, видимо, не судьба."
    },
    {
      "id": 18642932,
      "author": "Андрей К",
      "datetime": "Вчера в 16:02",
      "text": "Ratio_,зачем после СВО пару лет назад нужен был HFT, когда неэффективности были примерно везде, долго, очень долго и по несколько процентов, в некоторых случаях до 5-8% на круг?ответ же очевиден ) чтобы многократно забирать раздвижки свыше вами обозначенных  5-8%, которых не видно на свечах M1"
    },
    {
      "id": 18643064,
      "author": "Ratio_",
      "datetime": "Вчера в 16:53",
      "text": "Андрей К, высокочастотно неэффективно, так как делишь потенциал возможного расхождения на планируемый максимальный объем позы соответствующей разумным риск-параметрам для счета, и на каждом этапе добираешь объемы не выходящие за параметры риска. Уменьшение дискретности доходность не повышает, когда можно грузить крупными партиями.Когда большие раздвижки и неэффективности(как было в 2009м, 10м, 11м, в 2014-15м на валюте, в 22м, 23м на всем), HTF не нужен. Сейчас он актуален, он актуален на эффективном рынке. Как говорится, с паршивой овцы хоть hft клок"
    },
    {
      "id": 18638726,
      "author": "Вазелин",
      "datetime": "2025-09-28T11:17:00.000Z",
      "text": "Меня зовут Михаил ШардинУ тебя если че тоже самое написано в твоем нике"
    },
    {
      "id": 18638831,
      "author": "Дмитрий Овчинников",
      "datetime": "2025-09-28T12:02:00.000Z",
      "text": "спикер1Он готов «сидеть на шпагате», если ноги разъехались, но не дольше определенного лимита (в его примере —полчаса).спикер3тест на минутных свечах всегда будет излишне оптимистичным, так как цена закрытия свечи — это не реальные бид/аск в стакане. Чтобы приблизить тест к реальности, он берет в качестве сигналов на вход не пиковые отклонения, а среднее арифметическое всех отклонений за вычетом комиссии.спикер6никакая полная автоматизация не сможет повторить то, что делает трейдер, который видит и интерпретирует действия конкретного крупного игрока. Робот может быть лишь исполнителем — он поможет войти в сделку по лучшей цене и без проскальзывания, но решение о входе и выходе принимает человек.Ребята, а вы точно HFT? ;)"
    },
    {
      "id": 18638852,
      "author": "⧸_⎠ Виктор Громов ⎝_⧹",
      "datetime": "2025-09-28T12:09:00.000Z",
      "text": "Дмитрий Овчинников,"
    },
    {
      "id": 18638863,
      "author": "cerberus",
      "datetime": "2025-09-28T12:15:00.000Z",
      "text": "Дмитрий Овчинников, зато название какое — сердце российского HFT и мастер-класс для «квантов»!"
    },
    {
      "id": 18645277,
      "author": "Михаил Шардин",
      "datetime": "Сегодня в 04:48",
      "text": "cerberus, это всего лишь заголовок статьи который я сам придумал"
    },
    {
      "id": 18639139,
      "author": "Ilya Kosarev (kimkarus)",
      "datetime": "2025-09-28T13:40:00.000Z",
      "text": "Я там был, чай и кофе пил, диву давался и пошел дальше свои бонды торговать ))"
    },
    {
      "id": 18639143,
      "author": "myaucha",
      "datetime": "2025-09-28T13:45:00.000Z",
      "text": "__rtx, Если бы мне дали 30-50 млн, я бы перестал отвечать на звонки"
    },
    {
      "id": 18639217,
      "author": "Constantine Gr.",
      "datetime": "2025-09-28T14:24:00.000Z",
      "text": "«Аномальное количество сделок: если число сделок превышает расчетный максимум (зависящий от размера позиции), торговля блокируется.»Спасибо! У себя тоже на всякий случай реализую такую фичу."
    },
    {
      "id": 18639670,
      "author": "MatrixLis",
      "datetime": "2025-09-28T18:22:00.000Z",
      "text": "В эпицентр российского HFT‑трейдинга, где прибыль измеряют в миллисекундах,HFT давно на микросекунды перешёл. Нет?"
    },
    {
      "id": 18639780,
      "author": "Алекс Бергманн",
      "datetime": "2025-09-28T19:04:00.000Z",
      "text": "прекрасная статья! как приятно изредка встречать на смартлабе заметки людей, реально имеющих отношение к торговле."
    },
    {
      "id": 18640017,
      "author": "Андрей К",
      "datetime": "2025-09-28T20:57:00.000Z",
      "text": "да не. Сердце hft все таки не там я думаю"
    },
    {
      "id": 18640053,
      "author": "Андрей К",
      "datetime": "2025-09-28T21:13:00.000Z",
      "text": "__rtx, привет. в профиле стата ручной торговли до 2014г вроде. Насколько помню.hft же так не должен выглядеть. Там должно быть все уверено зеленое )"
    },
    {
      "id": 18640094,
      "author": "Synthetic",
      "datetime": "2025-09-28T21:32:00.000Z",
      "text": "Викинги мне нравятся хотя бы тем, что иногда приглашают на свои тусовки людей сильно умнее себя. А для тех, кто думает что они мало зарабатывают и излишне инфоцыганят, есть контр пример. Что-то типа Renassanse Technologies. Как начнут зарабатывать как они, так больше ничего от Викингов  и не услышите. Оно Вам  надо?"
    },
    {
      "id": 18640449,
      "author": "Просто трейдер",
      "datetime": "Вчера в 00:29",
      "text": "__rtx, опять продвигаешь своего Golder Rider робота в самом популярном посте недели?"
    },
    {
      "id": 18640457,
      "author": "__rtx",
      "datetime": "Вчера в 00:31",
      "text": "Просто трейдер, тебе не надоело бегать за мной?) У тебя вообще нет самоуважения Вась?"
    },
    {
      "id": 18640466,
      "author": "Просто трейдер",
      "datetime": "Вчера в 00:40",
      "text": "__rtx, расценивай это как хобби — охота на мошенников как ты )"
    },
    {
      "id": 18641530,
      "author": "__rtx",
      "datetime": "Вчера в 11:32",
      "text": "Просто трейдер, ну нравится тебе позориться продолжай кто ж против.)))"
    },
    {
      "id": 18640573,
      "author": "Петрович",
      "datetime": "Вчера в 06:19",
      "text": "Верная дорога к сливу, 100%В ЧС"
    },
    {
      "id": 18640596,
      "author": "Михаил Шардин",
      "datetime": "Вчера в 06:53",
      "text": "__rtx, мне кажется наоборот дискуссия только приветствуется. Я увидел это. Думаю вам бы понравилось, если бы присутствовали лично"
    },
    {
      "id": 18640605,
      "author": "Михаил Шардин",
      "datetime": "Вчера в 06:59",
      "text": "__rtx, спасибо"
    },
    {
      "id": 18640729,
      "author": "Gypsy",
      "datetime": "Вчера в 08:07",
      "text": "__rtx, речь идет о паре десятков тысяч рублей в день, судя по графикам? Или я ошибаюсь?"
    },
    {
      "id": 18640747,
      "author": "Андрей Столяров",
      "datetime": "Вчера в 08:15",
      "text": "Интересное чтиво, спасибо за труд)"
    },
    {
      "id": 18640750,
      "author": "Михаил Шардин",
      "datetime": "Вчера в 08:17",
      "text": "Андрей Столяров, 🙏"
    },
    {
      "id": 18641679,
      "author": "Gypsy",
      "datetime": "Вчера в 12:03",
      "text": "__rtx, а на сколько можно его масштабировать? Скажем торговать не 30 т.р., а 300 или 3 млн?"
    },
    {
      "id": 18643148,
      "author": "Ratio_",
      "datetime": "Вчера в 16:51",
      "text": "Gypsy, ничего там нельзя сильно масштабировать на нашем рынке, потому что ты не можешь открывать значимые крупные позы на маленьких таймфреймах ввиду частых черных лебедей. Всегда должен быть резерв на 30-40% падения, его можно и на едином пуле обеспечения разместить, но он все же сильно сокращает возможности"
    },
    {
      "id": 18643253,
      "author": "Gypsy",
      "datetime": "Вчера в 17:06",
      "text": "Ratio_, что вы понимаете под черными лебедями?"
    },
    {
      "id": 18643327,
      "author": "Ratio_",
      "datetime": "Вчера в 17:23",
      "text": "Gypsy, изменение котировок на десятки процентов, инфраструктурные риски как с Finex или блокировки активов"
    },
    {
      "id": 18643691,
      "author": "Gypsy",
      "datetime": "Вчера в 18:38",
      "text": "Ratio_, хфт — это день отработал и забрал деньги. Изменение на десятки процентов — это же круто, не? Прибыль больше. Блокировки активов не делается сиюсекундно, обычно начинают в воздухе витать слухи задолго. Инфраструктурные риски можно предусмотреть, с 2010 года на мосбирже, вот именно на таких рисках было потеряно совсем немного, и то в самом начале."
    },
    {
      "id": 18645659,
      "author": "zhorzh",
      "datetime": "Сегодня в 09:05",
      "text": "Хороший обзор"
    }
  ]
}