{
  "url": "https://t-j.ru/guide/local-smart-home/",
  "article_id": "382e7206-04ed-4174-ade8-614445a58f8c",
  "article_uuid": "382e7206-04ed-4174-ade8-614445a58f8c",
  "title": "Локальный умный дом: как подключить контроллер и настроить систему, сколько он стоит и какие устройства включает",
  "comments": [
    {
      "id": 1797864,
      "author": "MajiNaguri",
      "datetime": "2024-02-01T22:38:33.895167+03:00",
      "text": "Спасибо за прекрасную подробную статью.\nА электричества расходуется ощутимо больше за счёт постоянно включенных хабов, компьютеров, и устройств в вечном режиме ожидания? \nПод оборудованием для умного дома вы ведь не имеете в виду саму бытовую технику, а только розетки, выключатели, реле, умные колонки, лампочки и моторчики для штор? Впрочем, понятно, что да, ибо за 150к наверное только одну умную стиралку и купишь."
    },
    {
      "id": 1798016,
      "author": "Даниил Новиков",
      "datetime": "2024-02-01T23:44:53.796063+03:00",
      "text": "Автору спасибо за довольно подробный разбор. \nРискну показаться снобом, но 2/3 ваших \"умных устройств\" совершенно не нужны: к примеру, свет, шторы, датчики освещения и т.д. Если открыть шторы или включить свет стало тяжко или напряжно, то, скорее, нужен психолог/психотерапевт, а не датчики.\nНе сочтите за грубость-обидеть цели не преследую!"
    },
    {
      "id": 1798247,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T04:45:50.460902+03:00",
      "text": "Даниил, в основном это удобство: когда датчики и устройства действуют по каким-то заранее определённым сценариям"
    },
    {
      "id": 1798249,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T04:47:10.032666+03:00",
      "text": "MajiNaguri, примерно на 0,2А больше мне кажется расход больше по сравнению если бы умного оборудования не было"
    },
    {
      "id": 1798250,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T04:47:47.501553+03:00",
      "text": "MajiNaguri, да, под умным оборудованием имею в виду в основном реле, приводы штор, без бытовой техники"
    },
    {
      "id": 1798412,
      "author": "Герман Чернышёв",
      "datetime": "2024-02-02T08:33:58.883946+03:00",
      "text": "Нужен ли белый айпи для доступа к Хоум ассистент через интернет? Какую версию распберри взять? На Озоне нашёл Микрокомпьютер Raspberry Pi 4 Model B 2GB RAM за 5800 р.\nСейчас все устройства работают через smart life, так как они tuya. \nПерепривяжутся ли они все?\nЕсть как wifi, так и zigbee со своим tuya шлюзом.\nХочется отвязаться от их облака.\nСпасибо."
    },
    {
      "id": 1798427,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T08:45:25.559649+03:00",
      "text": "Герман, белый айпи у меня есть, доступ через интернет к Home Assistant настроен через обратный прокси.\n\nМодель 4 с двумя ГБ памяти подойдёт, но лучше взять памяти побольше.\n\nК home assistant можно привязать сами аккаунты tuya, но тогда не уверен что это будет полностью локальная конструкция. Или можно зигби заново привязать к стику который подключен к Хоум ассистант - тогда все локально будет."
    },
    {
      "id": 1798443,
      "author": "Герман Чернышёв",
      "datetime": "2024-02-02T08:55:35.883132+03:00",
      "text": "Михаил, да, лучше перепривязать весь дом. Есть ли трудности с привязкой tuya устройств?\nСкажем, к Яндексу не все устройства прилепились через smart life.\nЕсть же ещё Bluetooth устройства, работающие через тот же шлюз zigbee: умные весы, замок двери...\nИ айпи, значит, придётся покупать белый, да."
    },
    {
      "id": 1798448,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T08:58:42.597501+03:00",
      "text": "Герман, tuya вайфай на ESP8266?\nЯ их все на esphome перепрошил - полностью локальные стали"
    },
    {
      "id": 1798452,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T08:59:30.182156+03:00",
      "text": "Герман, Bluetooth устройства сами определяются Home Assistant - у меня тоже raspberry pi 4."
    },
    {
      "id": 1798454,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T09:00:52.229109+03:00",
      "text": "Герман, для зигби нужен шлюз. Я попробовал несколько и остановился на стике Sonoff и Open Source Zigbee2MQTT"
    },
    {
      "id": 1798465,
      "author": "Елисей Костомаров",
      "datetime": "2024-02-02T09:10:19.841677+03:00",
      "text": "Рассказ очень интересный и деловой, без лишней лирики, спасибо! Абсолютно правильно, что в таком деле не стоит полагаться на облачные решения, надежность их оказывается ниже всякой критики. У меня из \"умного дома\" стоит только считыватель счетчиков на воду. Все эти включатели света, звука, штор... думаю, и так мало двигаюсь, пусть будет хоть какая-то физическая активность ))\n\nА насчет датчиков протечки знаю трагикомическую историю. Один коллега с работы поствил себе такие, должны были автоматически перекрывать воду в случае аварии. И что же? именно один из этих датчиков в итоге дал течь и стал причиной затопления квартиры :("
    },
    {
      "id": 1798468,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T09:12:57.670152+03:00",
      "text": "Елисей, да, именно по автоматическим кранам на воду не стоит выбирать самые недорогие..."
    },
    {
      "id": 1798662,
      "author": "Ник Завадски",
      "datetime": "2024-02-02T10:37:31.179523+03:00",
      "text": "Даниил, все правильно, умный дом нужен, когда у тебя буквально ДОМ (200-300 плюс  м2) и там надо управлять отоплением, кондиционированием, а то и электричеством (солнечные батареи). \n\nА включать голосом чайник на кухне (который еще надо налить и из которого потом тоже надо будет налить, гы-гы) - это нишевое удовольствие."
    },
    {
      "id": 1798669,
      "author": "Ник Завадски",
      "datetime": "2024-02-02T10:38:54.481144+03:00",
      "text": "&gt; Некоторые компании заблокировали свои устройства для пользователей из России\n\nЕще ковид должен был научить народ, что ты владеешь только тем, чем владеешь, тем, что находится внутри контролируемого тобой периметра. \n\nВолосы шевелятся от осознания, что у тебя дома отключается какая-то система потому, что, эээ, да потому что нахрен пошел, вот почему."
    },
    {
      "id": 1798670,
      "author": "Олег Панчин",
      "datetime": "2024-02-02T10:39:02.236855+03:00",
      "text": "Герман, у HA есть собственное облако для доступа извне через интернет, но оно платное, 5 usd в месяц и оплатить можно только иностранной картой.\nЯ настроил доступ при помощи роутера Keenetic (в руководстве есть специальный раздел про доступ к HA), он может бесплатно создать домен третьего уровня даже для серого ip, через который HA прекрасно работает в браузере.\nПонятно что эти решения завязаны на внешних провайдеров, но всегда остаётся вариант с белым ip"
    },
    {
      "id": 1798683,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T10:43:34.582986+03:00",
      "text": "Ник, в первую очередь я считаю что умный дом - это система"
    },
    {
      "id": 1798685,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T10:44:04.078556+03:00",
      "text": "Ник, многие даже не задумываются как и что работает и просто не знают"
    },
    {
      "id": 1798782,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T11:14:46.952914+03:00",
      "text": "Андрей877, человек против использования умного дома но предлагает использовать arduino. Как-то странно, не находите?"
    },
    {
      "id": 1799422,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T14:55:10.667813+03:00",
      "text": "Роман, можно будет легко перейти на другой проект - системы ведь не закрытые"
    },
    {
      "id": 1799514,
      "author": "Роман",
      "datetime": "2024-02-02T15:29:58.621749+03:00",
      "text": "Ник, включать голосом чайник это ни разу не умный дом, это то что проталкивает большинство производителей,под видом умного дома, который может запустить любая домохозяйка.\nУмный дом должен самостоятельно выполнять заданные сценарии работы тех или иных приборов и датчиков, при наступлении разных внешних условий."
    },
    {
      "id": 1799518,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T15:31:58.830582+03:00",
      "text": "Роман, так и есть"
    },
    {
      "id": 1799641,
      "author": "Герман Чернышёв",
      "datetime": "2024-02-02T16:20:35.839976+03:00",
      "text": "Олег, вариант с облаком от ha отпадает. Зачем мне уходить из одного облака в другое?\nСама идея как раз в отказе от облака.\nЕщё вопрос.\nШлюз блютус и зигби от tuya будет работать с ha?\nСложность в электронных замках. Они Bluetooth. И подключаются через зигби шлюз tuya."
    },
    {
      "id": 1799651,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T16:26:27.373374+03:00",
      "text": "Герман, у home assistant нет облака. Это просто доступ к твоему локальному дому. Они продают возможность не заморачиваться с обратными прокси и всем таким прочим."
    },
    {
      "id": 1799654,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T16:27:03.674337+03:00",
      "text": "Герман, надо просто посмотреть дополнение, для home assistant полно всяких дополнений надо разбираться"
    },
    {
      "id": 1799680,
      "author": "Герман Чернышёв",
      "datetime": "2024-02-02T16:37:24.579641+03:00",
      "text": "Михаил, понял. Белый айпи мне больше нравится). Спасибо. Будем ковырять."
    },
    {
      "id": 1799707,
      "author": "Сергей Шиловский",
      "datetime": "2024-02-02T16:44:54.329621+03:00",
      "text": "А я сразу заказал умные выключатели со встроенным реле и не надо думать схему для ручного управления. \nЧто касается задержки, она, как ни странно, только на стороне Яндекса, если использовать оригинальное приложение типа smart life, то реакция на переключение мгновенная. \n150 тысяч мне кажется многовато, я сделал в своей девушке свет, полы, шторы, часть розеток и обошлось это ну тысяч в 30 максимум."
    },
    {
      "id": 1799715,
      "author": "Михаил Шардин",
      "datetime": "2024-02-02T16:47:41.984921+03:00",
      "text": "Сергей, 150 тысяч на четырёхкомнатную квартиру"
    },
    {
      "id": 1800369,
      "author": "Denis Z.",
      "datetime": "2024-02-02T22:37:17.142479+03:00",
      "text": "Примерно год назад собрал умный дом на базе aqara, а именно - заменил выключатели на умные, поставил датчики движения в гостевом сан узле и в коридоре и установил умный замок на входную дверь. Из плюсов - акара имеет свои приложения и на андроид и на айфон, прекрасно интегрируется в умный дом эпла, гугла и яндекса. Управляем светом при помощи колонок Алисы, это реально очень удобно для большой квартиры - не ходить везде и выключать свет вручную, а \"Алиса выключи везде свет\" и все) про умный замок вообще отдельная история, насколько это удобно. Еще поставил ик пульт яндекса, отлично управляет тв, кондером. Нужды перехода в автономность вообще не ощутил, все отлично и без сбоев работает и так, зато все собирается намного проще. Гидрозатворы и шторы тоже у акары есть"
    },
    {
      "id": 1803104,
      "author": "А",
      "datetime": "2024-02-04T12:20:38.112396+03:00",
      "text": "Я бы упомянул ещё SLS - это полностью российская разработка, небольшая плата, которая поддерживает множество устройств разных производителей и полностью берёт управление на себя, без необходимости использования RPi и других ПК. Помимо простоты и универсальности, главное преимущество(а для кого-то недостаток) - это низкоуровневый доступ к устройствам, который позволяет писать скрипты управления на языке LUA, то есть доступны не только примитивные сценарии, но и реально сложные системы управления чем угодно и как угодно.\nВ целом, в России достаточно развитое zigbee-сообщество, где умельцами активно разрабатываются собственные, уникальные устройства вроде датчика импульсов(для счётчиков воды и др.), радиоактивности, станции полива, открывашки домофона, кучи разнообразных многоканальных реле и т.д. Как правило, исходный код и схемы открыты, потому любой может приобрести комплектующие, после чего самостоятельно спаять их и залить прошивку, либо купить готовые устройства в Телеграм-барахолке @zigberu."
    },
    {
      "id": 1805267,
      "author": "Али Тугуз",
      "datetime": "2024-02-05T13:36:32.630354+03:00",
      "text": "Даниил, отдельно сами по себе устройства бесполезны. Нужны они в совместном взаимодействии в определенном сценарии. Например, когда я подъезжаю к дому, то говорю Гугл ассистенту: \"Ок, гугл, я подъезжаю\". И включается сценарий при котором открываются ворота, включается свет над воротами, включается свет в прихожей и гирлянда на кухонном окне (окно в пол и гирлянда на все окно, когда заезжаешь во двор красиво выглядит). Очень удобно. Вот для таких случаев и делают умный дом, а не для того чтобы включать чайник. И подобных сценариев у меня много, под разные нужны."
    },
    {
      "id": 1805270,
      "author": "Михаил Шардин",
      "datetime": "2024-02-05T13:37:36.590741+03:00",
      "text": "Али, так и есть 👍"
    },
    {
      "id": 1808436,
      "author": "Vladimir Noskov",
      "datetime": "2024-02-06T18:24:38.184024+03:00",
      "text": "Роман, ну так если все устройства уже настроены и работают, как надо, то и что такого, если разработка прекратится? Это будет проблемой только для каких-но новых устройств, возможно. Я настроил домашний сервер на убунте 2018 года, и с тех пор так ее и не обновлял - все работает, бекапы бекапятся, торренты качаются, медиатека в телевизорах проигрывается, домашнее облако синхронизируется. Ну в 2028, возможно, пообновляю все - исключительно от безделья, еще и новых проблем поди нахватаю :))"
    },
    {
      "id": 1813509,
      "author": "Брат Музон",
      "datetime": "2024-02-09T02:58:34.115977+03:00",
      "text": "Denis, А какой у вас умный замок?"
    },
    {
      "id": 1813637,
      "author": "Denis Z.",
      "datetime": "2024-02-09T08:32:13.198727+03:00",
      "text": "Брат, Aqara d100 zigbee"
    },
    {
      "id": 1818922,
      "author": "Брат Музон",
      "datetime": "2024-02-12T03:04:49.610532+03:00",
      "text": "Михаил, Что скажете про Synology DS923+?\nИнформации о NAS и детальных обзоров очень мало, а отзывы противоречивые"
    },
    {
      "id": 1832441,
      "author": "Дмитрий Никитин",
      "datetime": "2024-02-18T13:31:45.089568+03:00",
      "text": "Одобряю. Но для себя большим удовольствием я нашел перезд всего зоопарка устройств на SprutHub. Там и для неискушенного пользователя настройка занимает минуты. И покопаться можно при желании. Ну и комьюнити с поддержкой это приятная вишенка."
    },
    {
      "id": 1832443,
      "author": "Михаил Шардин",
      "datetime": "2024-02-18T13:33:49.548834+03:00",
      "text": "Дмитрий, спасибо. \nОтмечу только всё же, что статья всё-таки посвящена Home Assistant - именно эта тема была согласована"
    },
    {
      "id": 1861257,
      "author": "Сергей Красноштанов",
      "datetime": "2024-03-03T05:43:37.228339+03:00",
      "text": "Спасибо, хорошо разложены основы умного дома. Можно давать почитать знакомым, что сэкономить время на объяснение:)) \nСам тоже использую HAss, но у меня два сервера, в доме и в квартире. Хотелось бы почитать об опыте синхронизации или стыковки двух серверов."
    },
    {
      "id": 1999946,
      "author": "Брат Музон",
      "datetime": "2024-05-11T04:06:26.286880+03:00",
      "text": "Хотелось бы видеть еще статей на эту тему, да и про NAS тоже"
    },
    {
      "id": 2421313,
      "author": "Юлия Григорьева",
      "datetime": "2024-11-24T09:19:33.237860+03:00",
      "text": "Я благодарю вас за такое подробнейше описание, это супер статья"
    },
    {
      "id": 2421323,
      "author": "Михаил Шардин",
      "datetime": "2024-11-24T09:31:37.587000+03:00",
      "text": "Юлия, 🙏"
    },
    {
      "id": 2571956,
      "author": "Михаил Шардин",
      "datetime": "2025-01-16T12:15:51.318343+03:00",
      "text": "Георгий, приведите пожалуйста публичный пример, где описана модель подобного умного дома"
    },
    {
      "id": 2596256,
      "author": "Андрей Тест",
      "datetime": "2025-01-23T22:01:06.888437+03:00",
      "text": "Владимир, отнюдь. Вот определение \"некоторые\" - подойдёт лучше.  \nНекоторые строители умных домов - искушённые. Это в общем то логично - искушённых всегда меньше чем обычных людей, иначе не было бы такого выделения. Коли все -таковы  зачем вообще это упоминать?\nКстати именно на неискушённых пользователей ориентируются всякие облака типа ЯУД. И продажи у них идут неплохо.\nИ вот я, вроде бы вполне профессиональный айтишник, ещё на ассемблере x86 даже учился программировать и прерывания перехватывал, но при мысли продираться через конфиги, логи, изучения новых для меня ОС, загрузчиков, проксей и прочей шелухи сводит скулы. \nХочется именно чтобы без особых напрягов всё соединить, а при желании наличии желания и времени чтоб покопаться можно было."
    },
    {
      "id": 2701986,
      "author": "Анатолий Соколов",
      "datetime": "2025-03-12T07:33:10.258015+03:00",
      "text": "за озвученную сумму можно было сделать не колхозный щиток, рукалицо"
    },
    {
      "id": 2718506,
      "author": "Михаил",
      "datetime": "2025-03-19T17:57:11.607457+03:00",
      "text": "Так как все-таки настроить умный дом?"
    },
    {
      "id": 2718517,
      "author": "Михаил Шардин",
      "datetime": "2025-03-19T18:03:12.298478+03:00",
      "text": "Михаил, легко и непринуждённо"
    },
    {
      "id": 2718549,
      "author": "Михаил",
      "datetime": "2025-03-19T18:16:26.876615+03:00",
      "text": "Михаил, а где в статье это описано? Никак не найду.:)"
    },
    {
      "id": 2780470,
      "author": "Василий Шурыгин",
      "datetime": "2025-04-21T17:01:36.225675+03:00",
      "text": "Сергей, существуют, через HACS ставятся"
    },
    {
      "id": 2780487,
      "author": "Василий Шурыгин",
      "datetime": "2025-04-21T17:09:33.735002+03:00",
      "text": "Андрей877, отпираю замок на входной двери отпечатком пальца: нет ключей - нет проблем!)"
    }
  ]
}