{
  "url": "https://t-j.ru/moex-bond-2/",
  "article_id": "3dec851c-8579-4ed6-ab58-e6baf1b35c62",
  "article_uuid": "3dec851c-8579-4ed6-ab58-e6baf1b35c62",
  "title": "Как искать ликвидные облигации на Московской бирже с учетом налоговых изменений",
  "comments": [
    {
      "id": 438289,
      "author": "Sergey Arzumanov",
      "datetime": "2021-05-18T11:13:46.022523+03:00",
      "text": "Касательно налога с купонов встречал мнение, что теперь можно быть наказанным при покупке облигации прямо перед выплатой. Мы отдаём НКД продавцу, а наш купон облагается налогом в полной мере. При этом излишне уплаченный налог не вернуть.\n\nМожет есть смысл ещё дату ближайшего купона в таблицу добавить или отношение НКД к купону на текущий момент?"
    },
    {
      "id": 438320,
      "author": "Михаил Шардин",
      "datetime": "2021-05-18T11:34:39.224972+03:00",
      "text": "Sergey, в этой статье я больше сосредоточился на технических аспектах поиска."
    },
    {
      "id": 438365,
      "author": "Алексей Малахов 🦣",
      "datetime": "2021-05-18T11:56:41.686423+03:00",
      "text": "Ого, монументальная работа, спасибо за таблицу!"
    },
    {
      "id": 438450,
      "author": "Михаил Шардин",
      "datetime": "2021-05-18T12:53:10.714528+03:00",
      "text": "Алексей, 🙏"
    },
    {
      "id": 438554,
      "author": "Karl Hungus",
      "datetime": "2021-05-18T14:02:11.489533+03:00",
      "text": "Sergey, по брокерским счетам в конце года (по ИИС - при закрытии) осуществляется подсчет прибыли/убытков и сумм уплаченных/неоплаченных налогов. Поэтому уплата НДФЛ за весь купон будет учтена"
    },
    {
      "id": 438629,
      "author": "тьфунатебя ¯\\_(ツ)_/¯",
      "datetime": "2021-05-18T15:21:59.897822+03:00",
      "text": "Главное обходить Дядю Донера :)"
    },
    {
      "id": 438637,
      "author": "Михаил Шардин",
      "datetime": "2021-05-18T15:27:25.344130+03:00",
      "text": "тьфунатебя, ¯\\_(ツ)_/¯"
    },
    {
      "id": 439323,
      "author": "Egor Erohin",
      "datetime": "2021-05-19T10:31:58.588917+03:00",
      "text": "Когда уже Т–Ж выкатит виджет на основе вашей таблицы?"
    },
    {
      "id": 439330,
      "author": "Михаил Шардин",
      "datetime": "2021-05-19T10:37:01.585180+03:00",
      "text": "Egor, Когда вы пользуетесь сами для себя это один подход, а когда организация - мне кажется могут возникнуть юридические вопросы."
    },
    {
      "id": 439393,
      "author": "Траблшутер",
      "datetime": "2021-05-19T11:21:34.169884+03:00",
      "text": "Ничего не понял, но в закладки добавил!\nСпасибо!"
    },
    {
      "id": 439394,
      "author": "Михаил Шардин",
      "datetime": "2021-05-19T11:22:01.978980+03:00",
      "text": "Игорь, 🙏"
    },
    {
      "id": 439395,
      "author": "Денис Суховерхов",
      "datetime": "2021-05-19T11:22:14.615227+03:00",
      "text": "Спасибо большое за приложение. Неплохо бы еще показывать кредитный ретинг ато так можно накупить мусорных облигаций, имхо"
    },
    {
      "id": 439396,
      "author": "Михаил Шардин",
      "datetime": "2021-05-19T11:23:00.604339+03:00",
      "text": "Денис, биржа не передает этих данных, их нет в API."
    },
    {
      "id": 439457,
      "author": "Mr Zombie",
      "datetime": "2021-05-19T12:05:32.789809+03:00",
      "text": "Большое спасибо. В основном ориентировался на звездочки рейтинга и узнаваемость крупной компании, теперь станет интереснее и доходнее. \nДобавьте, пожалуйста, ссылку на эту статью в вашу таблицу. Пройдет время, и уже не вспомнить, откуда эта таблица, как ее обновить"
    },
    {
      "id": 439505,
      "author": "Юрий Фролов",
      "datetime": "2021-05-19T12:37:55.961378+03:00",
      "text": "Доходность просто берется с биржи или как-то рассчитывается? Много раз сталкивался, что на бирже и в квике доходность отображается некорректно."
    },
    {
      "id": 440261,
      "author": "Aleksey Panteleev",
      "datetime": "2021-05-20T06:08:16.359234+03:00",
      "text": "Спасибо, интересно. Я тоже самое (поиск) делаю в квике. Фильтры +- те же самые выставляются."
    },
    {
      "id": 440264,
      "author": "Михаил Шардин",
      "datetime": "2021-05-20T06:10:55.893860+03:00",
      "text": "Aleksey, разве суммарные обороты через Квик можно посчитать на периоде?"
    },
    {
      "id": 440274,
      "author": "Aleksey Panteleev",
      "datetime": "2021-05-20T06:53:14.005679+03:00",
      "text": "Михаил, думаю нет, но это особо не имеет смысла, если мне налили на проколе какого- нибудь неликвидного безрискового субфедерала с купоном 14% годовых типа Оренбурга (есть у меня такая) мне не важно ничего. Купилась - будет до погашения лежать, хоть там 1 сделка в месяц на рубль будет и в стакане никого , я не продаю такое. Часть высокодоходного облигационного портфеля неприкосновенна и генерирует денежный поток и не продается. \nА для всего остального есть короткие 26е офз, короткие корпоративы типа Сбера , альфы, итд. Там мне важно чтобы когда мамба будет 2000 чтобы я мог продать их пусть с небольшим даже убытком, или чтобы на тот момент погашение подошло каких нибудь выпусков. У меня довольно широкий портфель облигационный около 40 эмитентов(выпусков) , сейчас большая часть это короткие 1-2.5 летки ликвидные крупных эмитентов. \nВ общем суть какая, если я лезу куда-то за доходностью, ну допустим: самолёт, брусника, русаква все это будет 2-3 года лежать до погашения и мне не важен оборот по ним за период, взял , забыл, на замесе процентов на 10 сходят вниз и ладно )\nВсе остальное в фильтрах Квик есть"
    },
    {
      "id": 440276,
      "author": "Михаил Шардин",
      "datetime": "2021-05-20T06:57:36.131194+03:00",
      "text": "Aleksey, весь скрипт направлен на то, чтобы выбрать бумаги с оборотом и купить их прямо сейчас. Если нет оборота или он минимален даже на 50 т.р. войти не получится."
    },
    {
      "id": 440353,
      "author": "Aleksey Panteleev",
      "datetime": "2021-05-20T09:28:40.972621+03:00",
      "text": "Михаил, каждый день у меня выставлено(через карман на автомате по сути) в покупку около 70 заявок по бондам (на плечи) на небольшие объёмы (сколько позволяет статус КПУРа, УДС, портфель)итд. Все заявки стоят ниже рыночной цены (в зависимости от движения ставки, время приближения к погашению итд) уровни на которых я стою мной корректируются (обычно раз в 3-4мес). Там где неделями нет объёма, а вы стоите условно говоря на 5% ниже текущей среди заявок-ботов, в один прекрасный момент кому-то все равно нужно будет выйти, или за него это сделает брокер (типа маржина по какой-то другой бумаге). Именно там то и могут налить со скидками хорошую доходность. Так пару раз мне наливали РДЖ какие-то выпуски полу мертвые. Все зависит от стратегии. НО! если говорить просто про стандартные подходы и людей кому нужно что-то подкупить и он выбрал одну облигу среди высокодоходного неликвида, то да, ваш скрипт очень хороший. Я вообще не спорю ни как и отмечу еще раз что вы сделали классную штуку. Просто почти все в квике это делается) ну почти все"
    },
    {
      "id": 440354,
      "author": "Михаил Шардин",
      "datetime": "2021-05-20T09:30:07.363867+03:00",
      "text": "Aleksey, хорошая стратегия и спасибо за отзыв!"
    },
    {
      "id": 440364,
      "author": "Aleksey Panteleev",
      "datetime": "2021-05-20T09:41:13.376456+03:00",
      "text": "Михаил, спасибо и вам! кстати, если кто не сталкивался то в неликвидных облигах очень классно работают боты-алгоритмы, такая интересная  \"околорыночная-полууголовщина\". Стоишь ты на 5% ниже текущей в стакане допустим на покупку 100 бумаг перед тобой выставлено еще 10 заявок по разным ценам с объёмами в разы превышающими твой, то есть прям на миллионы рублей куча заявок стоит 1000шт 300шт итд и тут в какой-то момент происходит прокол вниз и у тебя исполняется покупка 1шт из 100шт) при этом все заявки стоящие перед тобой убираются на доли секунду, далее ползунком \"жирные\" (маркет мейкеры или хозяева - не знаю кто) видимо прощупывают стакан (не знаю зачем это в облигах делается) и при встрече с реальным встречным объёмом заявка на продажу в момент исполнения убирается. Ты смотришь в стакан, заявки перед тобой как стояли так и стоят, смотришь на график видишь соплю вниз до твоей цены, смотришь объём а там реально 1шт или типа того)  То есть ты понимаешь что ты сидишь там где нет людей)))"
    },
    {
      "id": 440367,
      "author": "Михаил Шардин",
      "datetime": "2021-05-20T09:43:23.519049+03:00",
      "text": "Aleksey, спасибо что делитесь опытом - это отлично, когда приходят люди по теме статьи и она обрастает новыми подробностями, про которых в статье нет ни слова."
    },
    {
      "id": 440371,
      "author": "Aleksey Panteleev",
      "datetime": "2021-05-20T09:48:50.761961+03:00",
      "text": "Михаил, как пример на тему покупок с дисконтом. В неликвидах бывают интересные движухи, хоть потом и можно не выйти"
    },
    {
      "id": 441078,
      "author": "Игорь Гречаный",
      "datetime": "2021-05-20T18:48:15.862599+03:00",
      "text": "спасибо большое, какое облегчение в поиске))))"
    },
    {
      "id": 441092,
      "author": "Михаил Шардин",
      "datetime": "2021-05-20T18:58:15.798216+03:00",
      "text": "Игорь, 🙏"
    },
    {
      "id": 442722,
      "author": "Вячеслав Горбатенко",
      "datetime": "2021-05-22T11:02:46.468645+03:00",
      "text": "Спасибо! Вы большой молодец 👍🏻"
    },
    {
      "id": 444336,
      "author": "Виктор Белов",
      "datetime": "2021-05-24T12:34:23.465518+03:00",
      "text": "Михаил, спасибо за таблицу, возможно дополнительную информацию получится (кредитный рейтинг и прочее полезные данные) взять например у сервиса Доход облигации или ему подобного"
    },
    {
      "id": 444339,
      "author": "Михаил Шардин",
      "datetime": "2021-05-24T12:34:59.246095+03:00",
      "text": "Виктор, есть ли у них открытое API?"
    },
    {
      "id": 444457,
      "author": "Александр Деревягин",
      "datetime": "2021-05-24T14:00:34.894443+03:00",
      "text": "Спасибо за таблицу. А как можно Еврооблигации только найти ?"
    },
    {
      "id": 444471,
      "author": "Aleksey Panteleev",
      "datetime": "2021-05-24T14:06:12.554417+03:00",
      "text": "Andrew, это как раз обычные лимитные заявки, когда в случае прокола исполняется сразу если объёма хватает, а не выбрасывается с задержкой как это бывает с тейк профитами которые могут проскальзывать на этих полоуголовных кратковременных (0.0001сек) манипуляциях с проколами (толстые пальцы )"
    },
    {
      "id": 444843,
      "author": "Вадим Гуревич",
      "datetime": "2021-05-24T17:28:40.088139+03:00",
      "text": "Надо как-то учитывать близость выплаты купона к покупке облигаций. Чем ближе эти даты, тем меньше доходность (теряете на НДФЛ, т.к. увеличивается НКД)"
    },
    {
      "id": 445872,
      "author": "Кирилл Абрамов",
      "datetime": "2021-05-25T16:29:50.974519+03:00",
      "text": "Денис, уж это можно самому посмотреть перед покупкой)\nимхо, это меньшая из проблем, которая остаётся после работы скрипта)"
    },
    {
      "id": 446496,
      "author": "Михаил Шардин",
      "datetime": "2021-05-26T10:38:47.106767+03:00",
      "text": "Sergei, Гугл блокирует неавторизованные им самим скрипты, когда число пользователей одного скрипта переходит определенный порог. Как можно выйти из ситуации?\nБез копирования моего файла создайте файл с таблицей, скопируйте туда условия и зайдите в редактор скриптов. В редакторе скриптов скопируйте мой код в ваш файл. Все. Теперь ко мне скрипт не будет иметь отношения. И будет работать."
    },
    {
      "id": 452054,
      "author": "Кракатуков",
      "datetime": "2021-06-01T11:50:04.003966+03:00",
      "text": "Karl, имеете в виду, НКД будет учтен до продажи/погашения? Вот тут https://t-j.ru/ofz-nalog/ речь о том, что все не так однозначно, но интересна конкретика насчет того, как сейчас на самом деле дела обстоят."
    },
    {
      "id": 453248,
      "author": "Олег",
      "datetime": "2021-06-02T12:16:56.551491+03:00",
      "text": "Спасибо автору за обновления скрипта. Для удобства развернул скрипт на своем веб-сервере, чтобы можно было оперативно сформировать выборку с телефона и добавил пару фильтров - https://bonds.olegen.ru/"
    },
    {
      "id": 453741,
      "author": "Михаил Шардин",
      "datetime": "2021-06-02T19:41:19.630420+03:00",
      "text": "Олег, это хорошо, но я не поддерживаю идею сделать из этого публичный сервис с закрытым исходным кодом. \nВ первую очередь из-за того, что Мосбиржа берет плату за предоставление данных с публичных сервисов и это может привести к судебным разбирательствам.\nА когда каждый использует сам лично для себя он волен делать что хочет."
    },
    {
      "id": 456434,
      "author": "Denis K",
      "datetime": "2021-06-04T19:40:11.818107+03:00",
      "text": "Позвольте парочку пожеланий по полугодичному опыту использования вашей первой версии скрипта (во 2й как я погляжу до сих пор актуально):\n1. Добавить в критерий отбора и отображать в таблице ИНТЕРВАЛ выплат купонов и вовсе не текстом как ту описано, а натуральными числами (в месяцах) пригодными для сортировки.\n2. Добавить в итоговую таблицу текущий НКД по каждой бумажке.\nPS Спасибо за ваш труд!"
    },
    {
      "id": 459910,
      "author": "Михаил Шардин",
      "datetime": "2021-06-08T14:55:44.778562+03:00",
      "text": "Denis, 🙏"
    },
    {
      "id": 470314,
      "author": "Vladimir Vidavskiy",
      "datetime": "2021-06-19T09:17:58.796520+03:00",
      "text": "Михаил, добавите столбцы «Рейтинг эмитента» и «Дата выпуска»?"
    },
    {
      "id": 470321,
      "author": "Михаил Шардин",
      "datetime": "2021-06-19T09:24:47.305584+03:00",
      "text": "Vladimir, автор не может править уже вышедшую статью. Рейтинг эмитента биржа НЕ транслирует."
    },
    {
      "id": 574093,
      "author": "Валентин",
      "datetime": "2021-10-01T23:15:46.283572+03:00",
      "text": "Как добавить в скрипт дату до погашения?Очень нужно"
    },
    {
      "id": 606044,
      "author": "14 14",
      "datetime": "2021-10-30T19:20:19.837253+03:00",
      "text": "Олег, благодарю вас за сервис я как начинающий инвестор очень помогли."
    },
    {
      "id": 606045,
      "author": "14 14",
      "datetime": "2021-10-30T19:21:21.759640+03:00",
      "text": "Михаил, доброе время благодарю вас за прекрасную работу очень помогает для начинающих инвесторов"
    },
    {
      "id": 935715,
      "author": "Антон М.",
      "datetime": "2022-07-30T22:35:31.211613+03:00",
      "text": "Почему-то скрипт перестал выдавать результат, выводит только заголовок таблицы и дату обновления внизу"
    },
    {
      "id": 1023089,
      "author": "Роман Т",
      "datetime": "2022-09-28T14:04:41.595911+03:00",
      "text": "Александр, просто замените путь в bat файле на папку где лежит ваша папка со скриптом \npushd C:\\Portable\\SilverFir-Investment-Report-master\\Node.js Release\\bond_search_v2\ncmd /q /k node index.js &gt; C:\\Portable\\SilverFir-Investment-Report-master\\Node.js Release\\bond_search_v2\\log\\log_%ldt%.txt"
    },
    {
      "id": 1134473,
      "author": "Bad Santa",
      "datetime": "2022-12-17T14:56:42.685077+03:00",
      "text": "Здравствуйте Михаил!\nВаш скрипт, действительно, очень удобен и реализован отлично! Вот, что заметил - проблема с дюрацией, в параметрах поставил от 6 до 18 мес, в результате пишет 8, а когда просматриваю на rusbonds свойства облигации, у нее погашение через 2 года. И ещё, есть ли фильтр внутри, который отбрасывает облигации с офертой? У меня проскочила одна, ТатнхимР01, даже купил, а потом смотрю, у них оферта безотзывная в 2023 г., надо их продать от греха подальше...\nВот бы фильтр, чтобы весь этот шлак отбрасывал."
    },
    {
      "id": 1136650,
      "author": "Bad Santa",
      "datetime": "2022-12-19T18:54:12.134618+03:00",
      "text": "Михаил, только я отчаялся и... получилось!\nВот, что надо делать - архив bond_search_v2 распаковывается в папку, где установлен Node, в 64й версии это c:\\Program Files\\nodejs\\, в файле bond_search_v2_start_windows.bat изменить директории для команд pushd и cmd на данную папку. Тогда результата появился, лога нет, но он мне и не нужен. Все, спасибо."
    },
    {
      "id": 1242066,
      "author": "Олег Насреддинов",
      "datetime": "2023-02-26T19:49:32.027027+03:00",
      "text": "Доработка скрипта дает еще больше возможностей. Михаил, удачи Вам в совершенствовании скрипта, он действительно полезен и удобен. Супер!"
    },
    {
      "id": 1446677,
      "author": "gvg",
      "datetime": "2023-07-08T15:39:57.639992+03:00",
      "text": "Добрый день, спасибо за работу. Когда и где ждать продолжение?"
    }
  ]
}