{
  "url": "https://t-j.ru/sport-with-ai/",
  "article_id": "69b70d7e-e725-43b8-8e32-e5454d86aca2",
  "article_uuid": "69b70d7e-e725-43b8-8e32-e5454d86aca2",
  "title": "Может ли нейросеть создать план тренировок и заменить тренера по триатлону",
  "comments": [
    {
      "id": 1622857,
      "author": "Максим",
      "datetime": "2023-10-27T14:05:57.057368+03:00",
      "text": "Я не могу попасть в чат по VPN, которыми пользовался раньше. Подскажите, пожалуйста, рабочий вариант"
    },
    {
      "id": 1622869,
      "author": "Lexa Lexa",
      "datetime": "2023-10-27T14:14:31.577512+03:00",
      "text": "Как же резко может обесцениться все, что связано с выдачей информации (в любом виде), стоит только найти возможность автоматизации ее выдачи и получения. Вот реально, какой объективный плюс человеческого аналога (еще и на удаленке) из приведенной истории? \"Живое\" общение? Живое в кавычках, потому что деньги - главный мотиватор такого общения. Ну и в чем тогда смысл тратить на это средства? Зачем рисковать с характером, с больничными, загулами и т.п.? У ИИ всего этого нет (при нынешнем законодательстве)."
    },
    {
      "id": 1622892,
      "author": "Михаил Шардин",
      "datetime": "2023-10-27T14:25:26.811793+03:00",
      "text": "Максим, использую https://www.forefront.ai/ но подойдёт любой"
    },
    {
      "id": 1622897,
      "author": "Неизвестный пользователь",
      "datetime": "2023-10-27T14:28:04.070534+03:00",
      "text": "Я пробовал составлять тренировки с использованием этой нейросети. Среди прочего было: фулл боди 2 раза в неделю, только базовые упражнения со свободными весами на рост мышечной массы. + две тренировки на жиросжигание. Месяц... и я не смог. Здорово упали силовые. Втянуться так и не смог. Заметил, что ооочень трудно составить внятный запрос. Самому, я бы сказал, в лоб, нереально. Благо примеров в инете полно. Это облегчает. \nМой опыт кончился травмой - защемление седалищного нерва. Выпал из тренировочного процесса на 1.5 месяца. Возвращаться было трудно. И психологически и физически.\nВспоминая этот опыт, главной ошибкой было накидывать в план сразу 80%новых упражнений. Для которых нужно ставить технику, чтобы работать с хорошими весами безопасно.\nСейчас веду дневник по старинке на бумаге, а планы меняю раз в три месяца + периодизация. Всегда можно отмотать листочки хоть на год и посмотреть всю статистику. Мне ТАК проще.\nА вот ещё. Получая выдачу от ИИ, ты принимаешь ее на веру. Составляя план своими руками всегда есть аргументы и контраргументы, сомнения, которые толкают на эксперименты. Те параллельно перелопачивается куча инфы, параллельно что-то всегда берешь на заметку и потом пробуешь.\nВобщем-то итоги схожи с вашими) за статью плюсанул в карму, ну и за впечатляющие достижения! Молодец!"
    },
    {
      "id": 1622898,
      "author": "Михаил Шардин",
      "datetime": "2023-10-27T14:28:13.202986+03:00",
      "text": "Lexa, я немного не понял - вы ругаете тренеров?"
    },
    {
      "id": 1622900,
      "author": "Михаил Шардин",
      "datetime": "2023-10-27T14:29:52.198508+03:00",
      "text": "MaxBorunov, отличный опыт 🔥 спасибо!"
    },
    {
      "id": 1622912,
      "author": "Lexa Lexa",
      "datetime": "2023-10-27T14:35:30.804142+03:00",
      "text": "Михаил, не назвал бы это даже и критикой, но плюсы и минусы вырисовываются сами собой."
    },
    {
      "id": 1623040,
      "author": "Гипножаба",
      "datetime": "2023-10-27T15:27:07.514152+03:00",
      "text": "Lexa, разве что в анализе и учете индивидуальных особенностей и состояний клиента, но это больше про тренеров с медицинским образованием, которые тренируют людей, которым такая услуга необходима. \nИ еще это про мотивацию. Если у тебя назначено и оплачено с живым человеком, придумать себе причину для пропуска как будто сложнее. \nУчу сложный язык для профилактики деменции и занимаюсь с живым человеком как раз по причине необходимости поддержания не сиюминутной мотивации. Хотя можно уже вполне и с роботом заниматься практически бесплатно, но бросить легче."
    },
    {
      "id": 1623067,
      "author": "zea",
      "datetime": "2023-10-27T15:43:36.003143+03:00",
      "text": "Мой подход к организации беговых тренировок: Huawei watch gt runner + coospo h808s + ии-тренер в Huawei health. \nРезультаты постепенно улучшаются, начинал весной с 4:40 на 3 км, на прошлой неделе пробежал 4:34 на 10км. Правда, не уверен, что результат был бы другим, если бы я просто бегал без программы :) \nПлюсы такого подхода для меня заключаются в разнообразии тренировок - на следующую неделю они составляются исходя из количества и интенсивности по итогам текущей. Однотипные тренировки в готовых программах очень быстро надоедали раньше, в итоге бег забрасывался спустя пару месяцев. Сейчас уже полгода непрерывного стажа и цель пробежать десятку следующим летом на марафоне \"Белые ночи\""
    },
    {
      "id": 1623254,
      "author": "Неизвестный пользователь",
      "datetime": "2023-10-27T17:40:30.925702+03:00",
      "text": "zea, а у них в экосистеме есть умные весы? \nСейчас всю статистику собираю с ми бэнда и умных весов. Все параметры скидываются в приложение на телефоне. \nМного где уже попадалась инфа про тренировки с часами Huawei. Но одних часов маловато. Спасибо!"
    },
    {
      "id": 1623341,
      "author": "zea",
      "datetime": "2023-10-27T18:34:26.800498+03:00",
      "text": "MaxBorunov, не пользуюсь весами, так что не подскажу"
    },
    {
      "id": 1623870,
      "author": "Неизвестный пользователь",
      "datetime": "2023-10-28T10:01:26.634079+03:00",
      "text": "Lexa, не согласен. Хороший тренер, это гарантия результата и персональный подход, основанный на особенностях подопечного. \nЕсть тренера с купленной бумажкой о прохождении курсов, у которых нет ни знаний, ни достижений, ни заинтересованности, кроме финансовой.\nЕсть тренера, которые обладают не только хорошим профильным образованием, но и большим опытом, образованием в смежных областях: медицина, нутрициология, психология.\nХорошие тренера способны вести онлайн до 30-40 человек в месяц. \nУ нас был опыт работы с таким и спустя 1.5 года мы вновь с ним сотрудничаем. \nЧеловек за полгода сделал то, что другие не могли сделать за несколько лет: было 90+, стало 60кг и это реально красивая рельефная фигура девушки.\nЧто сможет человек, оставшись один на один с тем, что он не может принять и исправить, на сколько проб и ошибок хватит его мотивации в случае с ИИ?\nХорошие тренера будут всегда востребованы. А вся эта фитнес-шелупонь, которая умеет только языком, а под ретузами утянутый живот - ну так им и надо. Лучше уж к ИИ в таком случае."
    },
    {
      "id": 1624099,
      "author": "Михаил Шардин",
      "datetime": "2023-10-28T14:25:21.977924+03:00",
      "text": "Кстати, хорошее обсуждение этой статьи в чате Екатеринбургских триатлетов Uralman: https://t.me/uralman_chat/1"
    },
    {
      "id": 1629897,
      "author": "usershmuser",
      "datetime": "2023-11-01T11:52:37.275167+03:00",
      "text": "Судя по тому, как вы заморочились с шумкой, вас ни один тренер (живой) не выдержит"
    },
    {
      "id": 1630133,
      "author": "Михаил Шардин",
      "datetime": "2023-11-01T13:39:47.572950+03:00",
      "text": "usershmuser, как часто люди бывают закомплексованы и злы"
    },
    {
      "id": 1648429,
      "author": "Evgeniy Glavatskikh",
      "datetime": "2023-11-12T12:27:58.483004+03:00",
      "text": "Не очень понял проблему автора. С результатом за 25 мин за 5 км нет смысла мудрить с планами. Бегайте каждый день по 2-3 км \"на все деньги\", подтяните технику, питайтесь, спите - будет рост результата. Тренировочные планы нужны при остановке результатов, а из 20 минут 5-ку можно просто на дисциплине выбежать, без нейросетей."
    },
    {
      "id": 1648433,
      "author": "Михаил Шардин",
      "datetime": "2023-11-12T12:30:44.916543+03:00",
      "text": "Evgeniy, у автора нет проблемы. Просто хотелось посмотреть как это работает"
    },
    {
      "id": 1648633,
      "author": "Evgeniy Glavatskikh",
      "datetime": "2023-11-12T15:36:03.592412+03:00",
      "text": "Михаил, вы перемудрили. Если потратить время не на изучение промтов, а на бег, то результат был бы лучше."
    },
    {
      "id": 1648845,
      "author": "Михаил Шардин",
      "datetime": "2023-11-12T19:29:56.530116+03:00",
      "text": "Evgeniy, наверное вы спортсмен и мои результаты кажутся незначительными, но мне они дались нелегко. Мне было важно иметь какую-то систему"
    },
    {
      "id": 1683622,
      "author": "Инесса Шукан",
      "datetime": "2023-12-01T00:15:48.715863+03:00",
      "text": "Михаил , хочу совет ваш, необходимо ! Где и как найти вас?"
    },
    {
      "id": 1683798,
      "author": "Михаил Шардин",
      "datetime": "2023-12-01T05:38:14.732856+03:00",
      "text": "Инесса, в Гугле наберите Михаил Шардин - там в первой же ссылке есть контакт"
    },
    {
      "id": 1689205,
      "author": "Пеппи Длинныйчулок",
      "datetime": "2023-12-04T13:53:56.981776+03:00",
      "text": "MaxBorunov, а можно поделиться контактами тренера?"
    },
    {
      "id": 1691616,
      "author": "Неизвестный пользователь",
      "datetime": "2023-12-05T16:58:42.267694+03:00",
      "text": "Пеппи,\nhttps://www.avito.ru/ryazan/predlozheniya_uslug/fitnes_trener._ot_minus_5_do10kg_za_mes_onlayn_2274792889?utm_campaign=native&amp;utm_medium=item_page_android&amp;utm_source=soc_sharing\nЭто не реклама."
    },
    {
      "id": 2101409,
      "author": "Системный инженер",
      "datetime": "2024-06-30T16:38:15.197142+03:00",
      "text": "Evgeniy, 5 км из 20 мин не каждый выбежит"
    },
    {
      "id": 2563521,
      "author": "Bello",
      "datetime": "2025-01-14T00:21:14.577253+03:00",
      "text": "Статья нормик для 2023. В ответ на предыдущие комменты. Без базовых знаний о качалке или беге нормальный план себе составить сложно. Нужно знать свои максимумы, уровень гибкости, все болячки, в целом обладать терминологией, чтобы отличать хотя бы Скотта от Смита. Как самому себе что-то составить можно посмотреть на канале Йети на Ютубе.\nПо бегу то же самое. Для начала лучше самому попросить нейросетку составить анкету с параметрами, чтобы она понимала по ответам от роста и веса до целей и готовности. Обязательно сами узнайте все свои зоны чсс, немного по терминам типа лёгкий, длительный, интервальный, темповый бег и фартлек. Просите расписать заминку и разминку, добавляйте упражнения для стоп (они скорее всего слабые). Таблицы задание/темп/час в целом хватает. Сообщайте о результатах после каждой трени, чтобы получать постоянную коррекцию плана. В целом программы с длительным бегом, интервалами, темповым бегом получаются нескучные. За бег на грани травмы, перевыполнение проги нейронка не похвалит, в целом всегда настрой на безопасный бег, всегда тебя тыкнет, мол растягивайся, укрепляй ноги, отдыхай. Первую в жизни половинку из двух часов в целом получилось выбежать в Екб в августе, хотя до мая прошлого года больше десятки не бегал.\nОгромный плюс нейронки в бесконечной отточке плана, реально индивидуальном подходе и безграничных знаниях, хоть и без жизненного опыта.\nТак же можно сразу подобрать нормальные кроссовки, зная все свои параметры. Всем бег!"
    },
    {
      "id": 2772993,
      "author": "Roman",
      "datetime": "2025-04-17T09:13:53.318178+03:00",
      "text": "Evgeniy, это не корректный план. Увы. Бегать каждый день 2-3 км на все деньги - план так себе."
    },
    {
      "id": 2967709,
      "author": "Артур Османов",
      "datetime": "2025-08-13T14:11:13.893019+03:00",
      "text": "Артион в телеграм хорош"
    }
  ]
}