{
  "url": "https://t-j.ru/sound-fail/",
  "article_id": "6d67fedb-9560-4d04-8e6c-78f06ecf5e2e",
  "article_uuid": "6d67fedb-9560-4d04-8e6c-78f06ecf5e2e",
  "title": "Шумоизоляция потолка в квартире под натяжной потолок: отзыв, стоимость",
  "comments": [
    {
      "id": 1463355,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T09:47:09.607685+03:00",
      "text": "Подбибник, и как это повлияет на уровень шума?"
    },
    {
      "id": 1463391,
      "author": "Eka",
      "datetime": "2023-07-20T10:07:55.615210+03:00",
      "text": "Уже давно забила на соседей и просто сплю в берушах. С берушами 3М даже мобильный кондиционер не слышу, хотя он стоит в метре от меня и работает всю ночь на максимальной мощности."
    },
    {
      "id": 1463403,
      "author": "Far Away",
      "datetime": "2023-07-20T10:11:48.141762+03:00",
      "text": "Онли последний этаж - и никаких проблем подобного характера"
    },
    {
      "id": 1463410,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T10:14:44.586058+03:00",
      "text": "Far, да, жил на последнем, но эта квартира не на нём."
    },
    {
      "id": 1463427,
      "author": "Far Away",
      "datetime": "2023-07-20T10:20:14.266920+03:00",
      "text": "Михаил, по повествованию это очевидно. Как человек, съехавший с промежуточного этажа на последний исключительно по этим соображениям, не понимаю людей, которые осознанно исключают фактор невезения из своего уравнения, покупая квартиру на промежуточных этажах. Читать без обсуждения. Если для вас шум от соседей сверху важен и значителен, зачем вообще покупали квартиру НЕ на последнем?"
    },
    {
      "id": 1463431,
      "author": "Far Away",
      "datetime": "2023-07-20T10:21:28.993368+03:00",
      "text": "Petr, почему автор в своей квартире должен в угоду других жильцов пользоваться берушами? Метод рабочий одноразово, ну вечеринка там какая-то, но на постоянку - ради чего?"
    },
    {
      "id": 1463435,
      "author": "Karl Hungus",
      "datetime": "2023-07-20T10:24:33.561156+03:00",
      "text": "Far, отвечу за Михаила. На последнем чаще всего 1) жарче, 2) выше риск залива (особенно в новостроях), 3) далеко идти, если лифт сломался и пр."
    },
    {
      "id": 1463438,
      "author": "Far Away",
      "datetime": "2023-07-20T10:26:50.826671+03:00",
      "text": "Karl, все это весьма и весьма печально, но лично для меня не идет ни в какое сравнение с идиотами сверху, не умеющими в шумовой режим."
    },
    {
      "id": 1463442,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T10:27:13.285630+03:00",
      "text": "Karl, на последнем ещё пожарная лестница скорее всего тоже не достанет."
    },
    {
      "id": 1463461,
      "author": "Анатолий Бизяев",
      "datetime": "2023-07-20T10:34:15.080555+03:00",
      "text": "Увы и ах - от ударного шума соседей сверху поможет только шумоизоляция пола соседям сверху.\nИ высоту не ест и потенциально дешевле выходит и эффективнее, чем шумка потолка."
    },
    {
      "id": 1463470,
      "author": "НеОн",
      "datetime": "2023-07-20T10:38:58.381543+03:00",
      "text": "Far, соседей снизу тоже отлично слышно."
    },
    {
      "id": 1463475,
      "author": "Far Away",
      "datetime": "2023-07-20T10:40:51.893307+03:00",
      "text": "Не, и сбоку тоже. Но они не так раздражают, как соседи сверху - лично меня."
    },
    {
      "id": 1463476,
      "author": "Дмитрий Никонов",
      "datetime": "2023-07-20T10:40:58.367549+03:00",
      "text": "Far, у меня был сосед снизу диджей, бам-бам, каждый день не громко, но как пытка звуком."
    },
    {
      "id": 1463490,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T10:44:56.960859+03:00",
      "text": "Анатолий, остаётся только договориться с соседями и переделать у них пол. \n\nМне кажется это реальный вариант, но только если люди только что купили квартиру над вами и планируют ремонт, но если они там живут больше 10 лет, то это предложение вряд ли вызовет у них энтузиазм."
    },
    {
      "id": 1463503,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T10:48:53.705699+03:00",
      "text": "Дмитрий, для этого сейчас придумали виброколонки. Может быть не очень конечно, но звук точно донесёт."
    },
    {
      "id": 1463527,
      "author": "Иван",
      "datetime": "2023-07-20T11:03:13.132953+03:00",
      "text": "Far, я тоже так думал , прикупил квартиру на последнем этаже . Высокие потолки , прекрасный вид . Нет соседей сверху . Но я не учел , что надо мной технический этаж именно там расположены электродвигатели механизмов лифта , которые шумят и день и ночь .  Но звук другого характера , недели бег детей. Или шум от табуретки по ламината. Учитывайте это при покупке верхних этажей ."
    },
    {
      "id": 1463528,
      "author": "Far Away",
      "datetime": "2023-07-20T11:05:52.833801+03:00",
      "text": "Иван, у каждого свои триггеры. Мне главное, чтобы никакой музыки не было, даже на дрель внимания не обращаю совсем."
    },
    {
      "id": 1463536,
      "author": "Курочка Дрёма",
      "datetime": "2023-07-20T11:09:12.483123+03:00",
      "text": "Far, и здравствуй протечки, если что. У нас постоянно протекало окно на чердаке, раза 4 капало с потолка. Сейчас что-то сделали с ним и ок. А однажды прорвало трубу с водой на чердаке. Можно сказать, что не капало, а лилось. К тому же соседи есть и по бокам, так что тишина нынче дорого стоит."
    },
    {
      "id": 1463549,
      "author": "Курочка Дрёма",
      "datetime": "2023-07-20T11:15:20.537072+03:00",
      "text": "Подбибник, тогда шум стал бы еще сильнее и уже прямо в квартире автора, где логика? ))))))))))))))))"
    },
    {
      "id": 1463582,
      "author": "Котенок Чмоня",
      "datetime": "2023-07-20T11:34:51.096492+03:00",
      "text": "Far, снимала квартиру на последнем этаже - постоянно было слышно как сверху голуби воркуют"
    },
    {
      "id": 1463594,
      "author": "Елена Евстратова",
      "datetime": "2023-07-20T11:42:11.824899+03:00",
      "text": "Анатолий, к нам когда-то пришел сосед снизу с таким предложением. Нам очень хотелось ему помочь, но мы только сделали ремонт и опять затевать все это с маленьким ребенком на руках, пусть и за его счет, были не готовы. Решили отложить до лета, когда ребенок будет на даче. А пока купили ковер с толстым ворсом и положили в комнату. Когда наступило лето, сосед сказал, что на самом деле все не так и плохо, а вполне нормально. То ли он привык, то ли ковер помог, то ли ребенок подрос и стал тише ходить :-)"
    },
    {
      "id": 1463620,
      "author": "Far Away",
      "datetime": "2023-07-20T11:58:10.754700+03:00",
      "text": "Anna, знаю многих людей, которые пренебрегли шумоизоляцией при укладке пола. Кому-то высоты жалко было, кому-то денег, кто-то просто не подумал, что это на что-то повлияет, а кто-то из серии \"а это их проблемы, им шумно, пусть они и решают проблему\". При обычной среднестатистической жизни (когда ребенок не лупит кастрюлей по полу, когда не катает машинку с пластиковыми колесами, когда родители не танцуют джагу-джагу и не слушают музыку в 2 часа ночи) простая шумка пола на 90% спасает от всего этого. Для этого и придумана была. От перфа не защитит, да, но там и задачи такой не стоит. Во всех остальных случаях лично я не желаю быть жертвой идиотизма соседей сверху, а на меня за время проживания в 5 квартирах на разных этажах еще ни разу никто не жаловался."
    },
    {
      "id": 1463621,
      "author": "Flegmatic bear",
      "datetime": "2023-07-20T11:58:12.011879+03:00",
      "text": "Far, да, два года живу на последнем этаже, со звуками тут всё гораздо лучше, чем везде, где доводилось жить до этого. На чердаке иногда делают что-то в связи с обслуживанием дома, но это происходит далеко не каждый день. Слышнее звуки дождя, но в этом даже что-то есть. \nИз реально раздражающего — по металлической крыше голуби топают реально громко, но это всё же лучше голосов соседей."
    },
    {
      "id": 1463626,
      "author": "Far Away",
      "datetime": "2023-07-20T11:58:52.703752+03:00",
      "text": "Котенок, у всех свои триггеры. Я спокойно переношу любые звуки (шум машин, перфоратор, голубей) - не переношу только музыку и детские звуки. У вас могут быть другие триггеры."
    },
    {
      "id": 1463630,
      "author": "Flegmatic bear",
      "datetime": "2023-07-20T12:00:27.901243+03:00",
      "text": "Котенок, у вас крыша не металлическая была? Мои «соседи сверху» не только воркуют, но и ужасно топают ;)"
    },
    {
      "id": 1463655,
      "author": "Туманный туман",
      "datetime": "2023-07-20T12:12:22.406414+03:00",
      "text": "Far, мой сосед снизу любит разговаривать с Алисой, на каждый вызов которой она отвечает стандартным «пилип» и вот этот пилип очень хорошо слышно, за пять минут раз 15 может ее вызвать 🤦‍♂️"
    },
    {
      "id": 1463657,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T12:12:53.139938+03:00",
      "text": "Анастасия, во всяком случае я старался и что-то делал 🤷‍♂️"
    },
    {
      "id": 1463671,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T12:21:03.663071+03:00",
      "text": "Туман, у меня тоже Алиса есть, но ко мне никто не приходил."
    },
    {
      "id": 1463680,
      "author": "Дмитрий Никонов",
      "datetime": "2023-07-20T12:24:18.087181+03:00",
      "text": "Михаил, не хочется опускаться до уровня обезьяны.\n\nз.ы. обезьяны не обижайтесь."
    },
    {
      "id": 1463701,
      "author": "9i_d1ma",
      "datetime": "2023-07-20T12:33:30.173875+03:00",
      "text": "К нам 4 года назад в квартиру сверху заехали новые жильцы - молодая пара. В первую же ночь устроили тусу. На следующий день поднялся, поздравил соседа с новосельем и рассказал о \"замечательной\" звукоизоляции в хрущевке. Пожали руки, на взаимном респекте разошлись и тех пор их было слышно только, когда они делали ремонт и то в разрешенное  время"
    },
    {
      "id": 1463728,
      "author": "Туманный туман",
      "datetime": "2023-07-20T12:43:49.104673+03:00",
      "text": "Михаил, да я и не ходил, напрягает не пилип, а 5-10 пилип за минуту, он нормальный?)"
    },
    {
      "id": 1463730,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T12:44:05.570629+03:00",
      "text": "9i_d1ma, Вам повезло с адекватными соседями"
    },
    {
      "id": 1463948,
      "author": "Котенок Чмоня",
      "datetime": "2023-07-20T15:00:40.471172+03:00",
      "text": "Flegmatic, про крышу не отвечу :( У меня было именно воркование слышно - первое время боялась, что птица застряла где-нибудь в вентиляции"
    },
    {
      "id": 1463980,
      "author": "Алексей",
      "datetime": "2023-07-20T15:18:48.201746+03:00",
      "text": "Я себе тоже сделал шумку гипслоком (45 мм) Квартира новая, но очень хорошая слышимость была соседей (разговоры, звонок телефона, телек и тд). За два дня мне смонтировали все и теперь, пока не слышал соседей больше."
    },
    {
      "id": 1464013,
      "author": "Flegmatic bear",
      "datetime": "2023-07-20T15:42:39.289862+03:00",
      "text": "Котенок, если не вспоминаете вместе с воркованием цокот когтей по металлу, видимо, у вас там была какая-то другая конфигурация :)"
    },
    {
      "id": 1464232,
      "author": "Михаил Шардин",
      "datetime": "2023-07-20T18:06:49.341698+03:00",
      "text": "Ольга, а собаки которые лают по ночам и соседи которые громко слушают музыку на соседних участках?"
    },
    {
      "id": 1465139,
      "author": "Игорь Орлов",
      "datetime": "2023-07-21T10:29:43.964057+03:00",
      "text": "Добрый день, Михаил!\nУ меня получился идеальный вариант: угловая трёхкомнатная квартира в новостройке, сверху тех.этаж, с одной стороны квартиры лестничная площадка \n( по которой естественно никто не ходит\nт.к. последний этаж), с другой стороны у кухни общая стена с соседями, а у них там спальня.\nТакое чувство, что живём одни в двадцати этажном доме."
    },
    {
      "id": 1465160,
      "author": "Михаил Шардин",
      "datetime": "2023-07-21T10:40:12.125315+03:00",
      "text": "Игорь, ну у меня практически вся квартира без соседей сбоку, но вот сверху ошибся немного 😂"
    },
    {
      "id": 1465247,
      "author": "Ол Сен",
      "datetime": "2023-07-21T11:34:32.290467+03:00",
      "text": "Все просто. Задолбали соседи и квартиры. Купил участок и построил домъ. Небольшой. Да бывают соседи на улице музон слушают или техника работает. Слышно. Но это редко летом. Лето у нас короткие, и в этот день я обычно в отпуске. Так что этот вариант лучше"
    },
    {
      "id": 1466647,
      "author": "бак",
      "datetime": "2023-07-22T10:11:03.687782+03:00",
      "text": "Far, я на последнем и слышу как будто надо мной, но на самом деле орут через! этаж. как выяснилось и не подо мной а как бы Левее. монолит"
    },
    {
      "id": 1466693,
      "author": "Doctor",
      "datetime": "2023-07-22T10:57:40.054481+03:00",
      "text": "Живу в панельной хрущёвке на последнем этаже. \n\nУ соседей снизу был родной деревянный пол, он иногда поскрипывал при ходьбе (причём звук шёл как будто из моего потолка), но топота и мебели не было слышно.\n\nКвартиру купили новые соседи, сделали ремонт, уложив стяжку на плиты перекрытия без слоя виброизоляции (так делать нельзя!)\n\nИ началась пытка. Теперь постоянно слышен топот, какие-то деревянные удары, будто торцом палки ударили в стену, хррр звуки будто тащат что-то тяжёлое. Ещё к ним вроде внуки приезжают, бегают, прыгают с гимнастической стенки на пол.\n\nЗвукоизоляцию у меня смысла делать нет, во-первых безумно дорого, во вторых звукоизоляция на моей стороне против структурных шумов неэффективна. Изолировать надо с их стороны, делать виброизоляцию пола. Но это только через суд их обязывать. Проводится экспертиза по установлению уровня приведенного ударного шума - специальный прибор стучит по полу соседей 4 этажа, а на 3 вторая часть прибора с микрофоном дать ловит сколько децибел прошло. Но это надо договариваться с соседями 3, да и 4 чтобы пустили к себе.\n\nЕщё есть мысль собрать на каком-нибудь Ардуино прибор с сейсмодатчиком, прикрепленными к моему полу и виброколонкой. Чтобы прибор улавливал вибрации от соседей и через виброколонку отправлял бы их обратно, усиленными раза в 2. Это был бы идеальный вариант мести, причём справедливый.\n\nНо тут пока непонятно как решить проблему самозаведения прибора от своей же колонки (отключать датчик на время срабатывания колонки?) Ещё непонятно как отфильтровать вибрации, которые производят не соседи снизу - как мою ходьбу, так и хлопаете входными дверьми соседей по лестничной площадке - они с такой силой закрывают, что трясётся весь этаж.\n\nА пока размышляю что делать, спасаюсь наушниками с активным шумоподавлением (Sony wh-1000xm4). Дорого, но очень эффективно - устраняют топот в 0, но другие звуки, вроде \"ударов палкой\" тихонько слышны. Но с музыкой не слышны и они. Но приходится носить их не снимая с утра до вечера (работаю дома на удалёнке).\n\nПравда ещё есть проблема с вибрацией - от особо сильного топота я ногами на своём полу ощущаю вибрации, это тоже раздражает."
    },
    {
      "id": 1468698,
      "author": "Кабина Белаза",
      "datetime": "2023-07-24T11:21:46.644286+03:00",
      "text": "Не, согласен! И кстати почему-то в моем случае соседи снизу звучат громче чем соседи сверху"
    },
    {
      "id": 1472318,
      "author": "Михаил Шардин",
      "datetime": "2023-07-26T13:10:25.793026+03:00",
      "text": "rawboat, и как вы это представляете в реальном мире?"
    },
    {
      "id": 1472326,
      "author": "Михаил Шардин",
      "datetime": "2023-07-26T13:12:37.502100+03:00",
      "text": "rawboat, может быть поэтому статей rawbot здесь и нет?"
    },
    {
      "id": 1472977,
      "author": "Велена",
      "datetime": "2023-07-26T18:26:14.797626+03:00",
      "text": "Михаил, смотря на каком последнем. Одно дело - в Мурино и другое- в 5 или 9этажке."
    },
    {
      "id": 1473076,
      "author": "Светлана Мехедова",
      "datetime": "2023-07-26T19:28:57.400158+03:00",
      "text": "Михаил, ох, не слушайте его, статья интересная и полезная всё равно, спасибо 👍"
    },
    {
      "id": 1477859,
      "author": "Александр",
      "datetime": "2023-07-30T00:39:02.570591+03:00",
      "text": "Туман, Абсолютно, прям как я. Правда звукоизоляцией я озаботился заранее, т.к. не только нехочу слышать соседей, но также не хочу чтобы они меня слышали, хочу в любое время дня и ночи делать то что хочу. И да у меня это \"пилип\" 5-10 раз в минуту, но не более 2 минут за день)"
    },
    {
      "id": 1477861,
      "author": "Александр",
      "datetime": "2023-07-30T00:41:03.110386+03:00",
      "text": "Макс, Ну так монолит он только по перекрытиям как правило, стены то блочные"
    },
    {
      "id": 1480120,
      "author": "user575460",
      "datetime": "2023-07-31T22:08:06.967249+03:00",
      "text": "Александр, неа, чаще стены монолит и перекрытия панельными плитами"
    },
    {
      "id": 1511887,
      "author": "Андрей Ставрогин",
      "datetime": "2023-08-20T03:46:22.218403+03:00",
      "text": "Не, Лучше слышать только соседей снизу, чем соседей снизу и соседей сверху. По-моему, это очевидно."
    }
  ]
}