{
  "url": "https://t-j.ru/refurbished-amazon/",
  "article_id": "8f8e14c8-06c4-4fcf-8bf4-adcd0ac8ae4a",
  "article_uuid": "8f8e14c8-06c4-4fcf-8bf4-adcd0ac8ae4a",
  "title": "Я покупаю восстановленные ноутбуки, телефоны и умные часы в США",
  "comments": [
    {
      "id": 1753487,
      "author": "Мурнятор",
      "datetime": "2024-01-12T19:14:35.116102+03:00",
      "text": "&gt; Для работы я хотел купить себе неттоп — компактный и в то же время современный системный блок.\n\nИ поэтому покупаем неттоп с 7-летним (на момент покупки) процессором и DDR3 за 22000! Когда при этом даже с текущими ценами за ту же 20ку можно купить мини-ПК на АлиЭкспрессе с намного более актуальным железом."
    },
    {
      "id": 1753521,
      "author": "Антон Карманов",
      "datetime": "2024-01-12T19:34:49.299006+03:00",
      "text": "&gt;&gt; Я покупаю электронику в американских интернет-магазинах уже 10 лет\n&gt;&gt; сэкономил, по моим подсчетам, около 100 тысяч рублей\n\nЭкономия 10'000 рублей в год при учёте что покупается дорогая техника — звучит как получить скидку 5 рублей при покупке мерседеса"
    },
    {
      "id": 1753525,
      "author": "Михаил Шардин",
      "datetime": "2024-01-12T19:36:10.475878+03:00",
      "text": "Антон, это просто ещё один вариант покупок, мне кажется многие люди про него даже не знают"
    },
    {
      "id": 1753589,
      "author": "Л. Ильич",
      "datetime": "2024-01-12T20:16:22.615506+03:00",
      "text": "из Америки ради интереса можно заказать"
    },
    {
      "id": 1753651,
      "author": "Марат Захаров",
      "datetime": "2024-01-12T20:53:27.403206+03:00",
      "text": "Михаил, получается просто щекотать нервы, если всего лишь выигрыш 100 000  за 10 лет. я воспринял комментарий Антона - так. \nно почему бы и нет? \nтоже вариант.."
    },
    {
      "id": 1753674,
      "author": "Неудовлетворительно",
      "datetime": "2024-01-12T21:10:29.680084+03:00",
      "text": "Антон, это вы еще другие его статьи не читали))))))))"
    },
    {
      "id": 1753778,
      "author": "Boris Köln",
      "datetime": "2024-01-12T22:15:38.860442+03:00",
      "text": "\"бесплатный возврат у «Амазона» действует только на территории США\"\n\nТовары из большинства категорий (кроме продуктов и высокотехнологичных типа смартфона или компьютера) можно вернуть в течение 14 дней без указания причины.\n\nВозвращать надо не в США, а в ту страну, где купили.\n\nПлата за обратную доставку внутри этой страны зависит от конкретного продавца и иногда подписки Prime. Чаще всего сам для покупателя обратная доставка бесплатная (отдать в любой ПВЗ или показать специальный QR на почте), но иногда приходится оплачивать ее самостоятельно по тарифам почты."
    },
    {
      "id": 1753791,
      "author": "Артемий",
      "datetime": "2024-01-12T22:23:27.853286+03:00",
      "text": "Магазин выберу. Лучше дольше и дороже, чем дешевле и не понятно, когда это все может перестать работать"
    },
    {
      "id": 1753864,
      "author": "Александр Стурчак",
      "datetime": "2024-01-12T23:00:03.686081+03:00",
      "text": "А что по поводу санкций? Не нашел в статье информации. Можно по прежнему дорогие айфоны пересылать разве?"
    },
    {
      "id": 1753873,
      "author": "Обезя Прикольчикова",
      "datetime": "2024-01-12T23:05:19.929131+03:00",
      "text": "В марте 2013 года покупала 5 айфон на 16 гигов за 23 тысячи из безналогового штата США. На городском форуме парень, который переехал в Америку, создал тему и продавал технику. Покупатель ему скидывает деньги (вроде через пейпал, уже не помню точно), а он покупает и отравляет почтой со страховкой. Прошло все хорошо, только Почта России, как обычно, отличилась. Выгода была около 7 тысяч. Сейчас такое сложно представить)"
    },
    {
      "id": 1753954,
      "author": "Мария",
      "datetime": "2024-01-13T00:00:26.660751+03:00",
      "text": "А вы не знаете насчет техники Эпл, с ней не надо плясать танцев с бубнами, если заказывать из Америки? Перепрошивать или что там делают?\nИнтересуют apple watch"
    },
    {
      "id": 1754007,
      "author": "Неизвестный пользователь",
      "datetime": "2024-01-13T00:42:37.029404+03:00",
      "text": "Отвечая на вопрос из заголовка — с авито, если это категория, в которой я шарю\n\n\nА вот новенький гугл пиксель можно и с Америки пока привезти: горбушка за них много просит и не всегда у них есть американские, а шить японский не хочется\n\nА раньше ещё ведь был компьютерюниверс…"
    },
    {
      "id": 1754010,
      "author": "Неизвестный пользователь",
      "datetime": "2024-01-13T00:43:52.615357+03:00",
      "text": "Можно электронику до 2500 долларов с заполнением формы BIS-711"
    },
    {
      "id": 1754014,
      "author": "Неизвестный пользователь",
      "datetime": "2024-01-13T00:46:09.892253+03:00",
      "text": "У эппла сейчас все зависит от вставленной симки и выставленного региона, максимум в американском айфоне слота для сим-карты не будет\nЭто вы с андроидами для японского рынка и айфонами до 15 айос путаете, где можно попасть на неотключаемый звук камеры"
    },
    {
      "id": 1754057,
      "author": "Неизвестный пользователь",
      "datetime": "2024-01-13T01:26:42.138965+03:00",
      "text": "Раньше много чего можно было покупать за рубежом, дешевле чем в РФ. Покупал гитару в Германии - только почта РФ перестали их возить, DHL стоил дорого. Но все равно намного дешевле, чем в РФ."
    },
    {
      "id": 1754136,
      "author": "Петр Петров",
      "datetime": "2024-01-13T02:44:32.477656+03:00",
      "text": "Так восстанавливают технику в Китае, не дешевле было это заказать с алиэкспресса"
    },
    {
      "id": 1754156,
      "author": "Михаил Шардин",
      "datetime": "2024-01-13T04:30:55.369992+03:00",
      "text": "Boris, у вас был опыт?"
    },
    {
      "id": 1754158,
      "author": "Михаил Шардин",
      "datetime": "2024-01-13T04:32:37.291196+03:00",
      "text": "Петр, качество не то если сравнивать"
    },
    {
      "id": 1754196,
      "author": "Dmitry MG",
      "datetime": "2024-01-13T06:24:45.839356+03:00",
      "text": "Что такое \"омЕерике\"?"
    },
    {
      "id": 1754220,
      "author": "Мария",
      "datetime": "2024-01-13T07:08:35.969112+03:00",
      "text": "Andre, нет, я помню, что когда знакомые возили айфоны из Штатов, отдавали их в России частному мастеру для перепрошивки, иначе они не работали. Но эти айфоны были для местного пользования, к нему в тарифе шел почти пожизненный оператор, поэтому и айфон стоил условные $200 против $1200 за свободный смартфон.\nПро камеру я даже не знала"
    },
    {
      "id": 1754226,
      "author": "Михаил Шардин",
      "datetime": "2024-01-13T07:14:05.308987+03:00",
      "text": "Мария, не отключаемый звук камеры это для Японии вроде только"
    },
    {
      "id": 1754396,
      "author": "Системный инженер",
      "datetime": "2024-01-13T10:04:48.949987+03:00",
      "text": "Покупаю только новое. Никакого бу или восстановленого. Тем более, не из-за границы. Чтоб потом просто вещь не выбросить, если сломается."
    },
    {
      "id": 1754397,
      "author": "Михаил Шардин",
      "datetime": "2024-01-13T10:05:40.332000+03:00",
      "text": "Системный, 👍"
    },
    {
      "id": 1754404,
      "author": "Системный инженер",
      "datetime": "2024-01-13T10:11:25.357322+03:00",
      "text": "Михаил, кстати тоже давно подумывал о неттопе. Сейчас хочу заменить домашний ноутбук, начал смотреть. Но у нас нормальные неттопы не продаются, минимум, заказывать с Озона, а это такое, см. выше. Ну и я сообразил, что к неттопу надо акустика, у меня нету. Это значит, на стол её ставить, загромождать его... Ай. Проще ноутбук."
    },
    {
      "id": 1754409,
      "author": "Михаил Шардин",
      "datetime": "2024-01-13T10:17:31.930098+03:00",
      "text": "Системный, колонки часто в мониторе бывают"
    },
    {
      "id": 1754423,
      "author": "Системный инженер",
      "datetime": "2024-01-13T10:32:54.870309+03:00",
      "text": "Михаил, и таки они у моего есть! Но ужасные."
    },
    {
      "id": 1754470,
      "author": "Неизвестный пользователь",
      "datetime": "2024-01-13T11:03:04.250476+03:00",
      "text": "А, так это вы про айфон с контрактом, надо просто по покупке смотреть на ценник и на наличие Unlocked в названии позиции"
    },
    {
      "id": 1754652,
      "author": "DG",
      "datetime": "2024-01-13T12:49:53.291990+03:00",
      "text": "Заказ техники из США - рабочая и действительно очень выгодная схема, я таким образом покупаю большую часть гаджетов и часов. Так в свое время, будучи небогатым студентом, я ходил с актуальным Samsung Galaxy S4.\nК слову, для тех, кто не хочет иметь дело с восстановленнной техникой - новую технику зачастую тоже вполне выгодно возить)"
    },
    {
      "id": 1754823,
      "author": "Мария",
      "datetime": "2024-01-13T14:42:44.041462+03:00",
      "text": "Andre, а вы не знаете, apple watch одинаковые для всех рынков? Или тоже есть такие нюансы?"
    },
    {
      "id": 1754934,
      "author": "Неизвестный пользователь",
      "datetime": "2024-01-13T15:49:58.420098+03:00",
      "text": "Вотчи не продаются с контрактом, это ж аксессуар\nтам все отличия — это наличие/отсутствие поддержки eSIM и алюминиевый/стальной корпус"
    },
    {
      "id": 1755651,
      "author": "Сергей",
      "datetime": "2024-01-14T02:02:56.677990+03:00",
      "text": "...В США можно купить любой небольшой гаджет с хорошими характеристиками...\nВ Китае их на порядок больше ))\nИсключения - узкоспециализированные фирмы типа Гармина или продукция Эппл, которая по соотношению цена/функционал уже давно за гранью адекватности."
    },
    {
      "id": 1756173,
      "author": "дырка от бублика",
      "datetime": "2024-01-14T12:25:47.452793+03:00",
      "text": "Так и не поняла, чем отличается renewed от refurbished 🤷‍♀️\nНу и если покупать бу, то я бы лучше брала в волмарт или бестбай, чем на Амазоне"
    },
    {
      "id": 1756179,
      "author": "дырка от бублика",
      "datetime": "2024-01-14T12:28:51.693189+03:00",
      "text": "Boris, так автор вроде как раз в сша покупает"
    },
    {
      "id": 1756189,
      "author": "Boris Köln",
      "datetime": "2024-01-14T12:34:38.212268+03:00",
      "text": "дырка, речь про \"бесплатный возврат есть ТОЛЬКО в США\". Это некорректно."
    },
    {
      "id": 1756196,
      "author": "дырка от бублика",
      "datetime": "2024-01-14T12:39:52.187897+03:00",
      "text": "Boris, а, поняла вас. Но я думаю, автор именно имел в виду, что возврат там, где покупал"
    },
    {
      "id": 1756217,
      "author": "Михаил Шардин",
      "datetime": "2024-01-14T12:59:53.677204+03:00",
      "text": "дырка, вообще, да"
    },
    {
      "id": 1756255,
      "author": "Михаил Шардин",
      "datetime": "2024-01-14T13:43:04.278527+03:00",
      "text": "Сергей, я не использую и не люблю продукцию эпл"
    },
    {
      "id": 1756593,
      "author": "ЧёрноКотовый Коточёрнович",
      "datetime": "2024-01-14T18:00:20.615120+03:00",
      "text": "Не покупаю бу смартфоны, не вижу в этом смысла."
    },
    {
      "id": 1756595,
      "author": "Михаил Шардин",
      "datetime": "2024-01-14T18:01:26.420072+03:00",
      "text": "ЧёрноКотовый, Renewed это не б/у"
    },
    {
      "id": 1756602,
      "author": "ЧёрноКотовый Коточёрнович",
      "datetime": "2024-01-14T18:07:16.744268+03:00",
      "text": "Михаил, эппл может и взял бы, но симпатии с ним не случилось. Сижу в экосистеме самсунг 🤷‍♂️"
    },
    {
      "id": 1756678,
      "author": "KARIA",
      "datetime": "2024-01-14T19:08:47.576152+03:00",
      "text": "Не корректно сравнивать восстановленную технику из США и б/у с Авито, тогда нужно было бы сравнивать б/у с e.bay и Авито. \n\nЛично по моему мнению это серьезный риск и оно того не стоит. У нас существует огромный рынок серых товаров которые за частую продают просто по цене себестоимости закупки что бы вытащить деньги в оборот. Такое бывает и часто. Я как то покупал часы Gatmin Fenix 6 pro по цене 42000₽ это было ниже цены официального сайта производителя в США и на 26 000₽ ниже розничной цены у официальных дилеров в России. Но это конечно совсем другая история. Если что часы были новые."
    },
    {
      "id": 1757606,
      "author": "Кактус в иголках",
      "datetime": "2024-01-15T11:36:07.366781+03:00",
      "text": "Покупала восстановленный ноутбук Toshiba ещё в 2010 с Амазона. До сих пор работает отлично, хоть и сильно устаревший.\nДоллар был за 30, доставка значительно ниже, трава зеленее, я была тонкая и звонкая. В общем, сейчас, как мне кажется, гораздо больше выбор и по цене и по качеству в России/Китае."
    },
    {
      "id": 1757615,
      "author": "Михаил Шардин",
      "datetime": "2024-01-15T11:37:54.436621+03:00",
      "text": "Кактус, в Китае надо смотреть на качество, совсем нонейм я бы не стал брать, хотя иногда очень дёшево бывает"
    },
    {
      "id": 1758046,
      "author": "Кактус в иголках",
      "datetime": "2024-01-15T14:36:52.034781+03:00",
      "text": "Михаил, смотреть надо точно также, как на Амазоне. Весь Китай уже давно там)"
    }
  ]
}