{
  "url": "https://t-j.ru/investment-report/",
  "article_id": "9e99af64-c357-40f4-a32a-b8be12e0f9ea",
  "article_uuid": "9e99af64-c357-40f4-a32a-b8be12e0f9ea",
  "title": "Как вести учет инвестиций: шаблон гугл-таблицы, правила ее заполнения и проверка показателей",
  "comments": [
    {
      "id": 164556,
      "author": "тьфунатебя ¯\\_(ツ)_/¯",
      "datetime": "2020-04-16T10:24:47.907709+03:00",
      "text": "Тебе не придётся напрягаться с учётом инвестиций, если у тебя их нет!\n(картинка, с умным негром)"
    },
    {
      "id": 164639,
      "author": "Михаил Шардин",
      "datetime": "2020-04-16T12:50:05.202667+03:00",
      "text": "тьфунатебя, да, обычно так и пишут в комментариях. 🤷‍♂️ Недавно еще было популярный комментарий - инвестировал в пачку гречки."
    },
    {
      "id": 164646,
      "author": "Михаил Шардин",
      "datetime": "2020-04-16T12:53:21.897197+03:00",
      "text": "Алоизий, это вообще без разницы сколько у кого. Лично для меня и в самом начале учёт был полезен. \nКонечно это выглядело по другому, но таких отличных и бесплатных инструментов раньше просто не было."
    },
    {
      "id": 164674,
      "author": "Станислав Пушкарев",
      "datetime": "2020-04-16T13:24:21.474073+03:00",
      "text": "Немного замороченная таблица, но идею поддерживаю! У меня тоже есть подобная, чуть проще, но я в ней делаю акцент на вычисление ежемесячного пассивного дохода, анализирую его составные: «капитализирующая» часть (которая увеличивает общую стоимость капитала и защищает от инфляции) и часть, которую регулярно можно пускать на потребление (проценты по вкладам, арендные поступления, дивиденды и купоны по облигациям). Такая аналитика нужна мне потому что цель всего этого - однажды перестать работать вообще )))"
    },
    {
      "id": 164675,
      "author": "Sergei Maslovskiy",
      "datetime": "2020-04-16T13:27:15.608067+03:00",
      "text": "Так, а текущие цены акций и будущие дивиденды выкачиваются автоматически или нужно заполнять ручками как в случае с докупкой бумаг?"
    },
    {
      "id": 164680,
      "author": "Mishka Panda",
      "datetime": "2020-04-16T13:32:51.932672+03:00",
      "text": "Учёт - оч полезная штука. Я вообще любитель аналитики и цифр. Пару лет назад начал вести учёт расходов, недавно - накоплений. Проблема та же - сложно было оценить картину в разрезе всех активов. Интересно было ознакомиться с вашими методами, подумаю чем можно вооружиться! Кстати да, из инструментов также пришёл к выбору в пользу Excel, хотя изначально планировал накидать простое приложение для себя. Слишком велики оказались издержки в написании чего-то с нуля на данный момент."
    },
    {
      "id": 164691,
      "author": "Михаил Шардин",
      "datetime": "2020-04-16T13:42:43.214865+03:00",
      "text": "Алоизий, в статье видимо надо было сделать важное замечание:\n\n✋ Сейчас таблица заполнена тестовыми данными, не имеющими отношения к реальному портфелю. ✋ \n\nМой портфель - это не эта таблица, он другой.\nЭта таблица - пример, для тех, кто сам хочет вести учёт, но не знает с чего начать. Не хочет платить сторонним сервисам. Меня много раз благодарили за неё. Я писал про эту таблицу и раньше (только её редакция была другая). \n\nЕсли у вас есть интерес, то вот эти ссылки:\n\n📍 Обзорная статья и предыстория создания первой редакции таблицы на vc.ru (ноябрь 2019 г): https://vc.ru/finance/92990-upravlencheskiy-uchet-lichnyh-aktivov\n\n📍 Больше технических подробностей по предыстории создания в статье на Хабре (декабрь 2019 г): https://habr.com/ru/post/477920/"
    },
    {
      "id": 164704,
      "author": "Михаил Шардин",
      "datetime": "2020-04-16T13:58:25.072459+03:00",
      "text": "Evgeny, я тоже пробовал эксель, но гугл таблицы оказались более гибкие и эффективные для подобного учёта."
    },
    {
      "id": 164752,
      "author": "Михаил Шардин",
      "datetime": "2020-04-16T15:22:09.561100+03:00",
      "text": "тьфунатебя, настройте таблицу и узнаете :)"
    },
    {
      "id": 164762,
      "author": "Simon says",
      "datetime": "2020-04-16T15:46:05.727842+03:00",
      "text": "Ну слава богу, думал я один так упарываюсь по учёту активов через гуглотаблички)\nЛайк за деление по брокерам и посредникам, меня тут в соседней теме за такое обвинили в излишней паранойе)"
    },
    {
      "id": 164765,
      "author": "Саша Рубашенко",
      "datetime": "2020-04-16T16:00:42.722296+03:00",
      "text": "Спасибо за таблицу. Подскажите, как вы учитываете продажи ценных бумаг?"
    },
    {
      "id": 164808,
      "author": "Михаил Шардин",
      "datetime": "2020-04-16T17:53:04.718645+03:00",
      "text": "Семён, если реально используется несколько брокеров, то это очень удобно держать руку на пульсе и использовать одного брокера для одних активов например, другого для других, а общая картина в табличке."
    },
    {
      "id": 164883,
      "author": "Simon says",
      "datetime": "2020-04-16T20:55:11.264391+03:00",
      "text": "Михаил, так я знаю) У меня пять счетов на трёх брокеров и парсер отчётов, чтобы ручками не заполнять"
    },
    {
      "id": 165035,
      "author": "Руслан Закарьяев",
      "datetime": "2020-04-17T09:55:34.295452+03:00",
      "text": "Спасибо за материал, взял на заметку пару интересных моментов. \n\nДля себя тоже веду Excel-таблицу, сначала она была такая же сложная, потом постепенно приходил к выводу, что та или иная аналитика избыточна. В итоге пришел к варианту буквально с двумя страницами: на первой веду все операции с активами (покупка, продажа, купоны/дивиденды), на второй автоматически собирается вся необходимая мне сводная информация: \n\n1. Текущая доля каждого класса актива и отклонение от желаемой доли.\n2. Текущая доля распределения по валютам и по отраслям.\n3. Текущая доля каждого актива относительно всего портфеля.\n4. Текущая стоимость каждого актива в рублевом эквиваленте (тоже подтягивается автоматически из разных источников).\n5. Количество.\n6. Годовая доходность каждого актива.\n7. Общая стоимость и годовая доходность всего портфеля.\n8. Денежный поток по каждому активу (сколько купонов/дивидендов получено).\n9. Общая прибыль в рублевом выражении с учетом изменения цены актива и всех полученных по нему купонов/дивидендов.\n\nВ итоге, когда приходит момент докупить какой-то актив, я за 2 минуты понимаю какой именно это должен быть актив: смотрю сначала на текущую долю в классах (акции/облигации), потом смотрю на долю в валютах, а потом, сузив диапазон до \"Ага, понятно, нужно купить акции в $\", уже выбираю конкретную акцию в зависимости от отрасли, доли каждой акции в портфеле и текущей экономической ситуации. После этого добавляю строчку о сделке, а все остальное перерасчитывается автоматически.\n\nА, ну еще есть одна страница, на которой красивый график, показывающий прогнозную стоимость моего портфеля на 20 лет вперед, если я буду продолжать дисциплинированно инвестировать дальше. И на этом же графике вторая кривая, показывающая фактический результат. Очень мотивирует."
    },
    {
      "id": 165040,
      "author": "Михаил Шардин",
      "datetime": "2020-04-17T09:58:24.550560+03:00",
      "text": "Семён, на чём парсер написан?"
    },
    {
      "id": 165054,
      "author": "Михаил Шардин",
      "datetime": "2020-04-17T10:25:01.317524+03:00",
      "text": "Ruslan, спасибо за столь развернутый комментарий."
    },
    {
      "id": 165057,
      "author": "Михаил Шардин",
      "datetime": "2020-04-17T10:37:28.001572+03:00",
      "text": "Ruslan, я понимаю что Ваша таблица очень схожа с этой, которая описана в статье?"
    },
    {
      "id": 165058,
      "author": "Михаил Шардин",
      "datetime": "2020-04-17T10:38:12.471800+03:00",
      "text": "Ruslan, подскажите а в Excel вы котировки VBA-скриптом скачиваете?"
    },
    {
      "id": 165077,
      "author": "Руслан Закарьяев",
      "datetime": "2020-04-17T11:10:34.127959+03:00",
      "text": "Михаил, сама таблица сильно другая, но суть ее схожа: в ней считается доходность моих инвестиций, доли активов и т.д. - это помогает мне принимать решение и правильно корректировать инвестиционную стратегию."
    },
    {
      "id": 165082,
      "author": "Руслан Закарьяев",
      "datetime": "2020-04-17T11:14:00.029001+03:00",
      "text": "Михаил, нет, всё делается только формулами. Для некоторых источников использую формулы ВЕБСЛУЖБА() и ФИЛЬТР.XML(). В случае с MOEX подключил их API в качестве внешнего источника данных в формате CSV, а дальше с помощью формулы ВПР() нахожу нужный мне актив в этой выгрузке. Но сейчас планирую MOEX тоже с помощью ВЕБСЛУЖБА() подключить."
    },
    {
      "id": 165103,
      "author": "Руслан Закарьяев",
      "datetime": "2020-04-17T11:46:44.423706+03:00",
      "text": "Михаил, работает.\n\nВот так, например, можно получить стоимость еврооблигации RUS-28:\n\n=ФИЛЬТР.XML(ВЕБСЛУЖБА(\"http://iss.moex.com/iss/engines/stock/markets/bonds/boards/TQOD/securities/XS0088543193/securities.xml\");\"//document//data//rows//row/@PREVPRICE\")\n\n\nВот так НКД по ней:\n\n=ФИЛЬТР.XML(ВЕБСЛУЖБА(\"http://iss.moex.com/iss/engines/stock/markets/bonds/boards/TQOD/securities/XS0088543193/securities.xml\");\"//document//data//rows//row/@ACCRUEDINT\")"
    },
    {
      "id": 165112,
      "author": "Михаил Шардин",
      "datetime": "2020-04-17T11:56:04.189525+03:00",
      "text": "Ruslan, спасибо, в начале 2018 года, перед тем как начать делать эту гугл таблицу тоже делал эксель версию, но только на VBA - в целом мне нравилось, но в экселе всё завязано на человека - надо открыть, обновить. \nВ гугл таблицах можно сделать чтобы котировки и параметры обновлялись ночью например, а по понедельникам слали отчёт что происходит в портфеле, добавляли информацию о выплатах в календарь, слали уведомления в телеграм... Всё это выполняется на серверах гугла.\nВот моя предыстория создания этой таблицы: https://habr.com/ru/post/477920/"
    },
    {
      "id": 165225,
      "author": "Simon says",
      "datetime": "2020-04-17T13:51:32.635847+03:00",
      "text": "Михаил, парсер на scala\nУстроен просто:\n- скачиваю ручками отчёт брокера YTD в нужную папку\n- sbt run\n- git push\n\nВ гугловой табличке жмакаю кнопку обновления, за ней написанный макрос на gscript, который подтягивает результаты парсинга с гитхаба и котировки (moex api + yahoo finance)\n\nВсё остальное таблица сама сводит и считает\n\nКак бонус - парсер легко научить считать налоги для IB, ибо FIFO и раздельный учёт бумаг в нём уже есть =)"
    },
    {
      "id": 165228,
      "author": "Михаил Шардин",
      "datetime": "2020-04-17T13:53:03.839142+03:00",
      "text": "Саша, если Вам понравилась функция ImportXML, то скорее всего заинтересует и её использование вместе с Мосбиржей.\nВот таблица, где я разбирался с автоматически получением данных Московской биржи: \nhttps://docs.google.com/spreadsheets/d/1MI-FfjjOhPCYb0H2E9--bEWdsbu4HfOKly3ySySN-0k/edit?usp=sharing"
    },
    {
      "id": 165452,
      "author": "Simon says",
      "datetime": "2020-04-17T18:24:00.904332+03:00",
      "text": "Михаил, пойдём в телегу, чтоль?) @esemiko"
    },
    {
      "id": 165497,
      "author": "Mr Zombie",
      "datetime": "2020-04-17T19:23:06.342822+03:00",
      "text": "Очень сложно. У меня 1 брокер, но есть у него такая беда: купил в дату 1 актив, в дату 2 продал часть актива, и вот уже % дохода по бумаге показывается неверно. Я не знаю, как это побороть. К примеру, Татнефть продавал и докупал несколько раз, вроде заносил в свою таблицу, считал, но в итоге косячил и снимал свои же деньги, полагая, что снимаю наросшие %%.\nТак вот при такой продаже-докупке реальный прирост/убыль в таблице считается?\nСпасибо"
    },
    {
      "id": 165591,
      "author": "Oleg Zamiralov",
      "datetime": "2020-04-17T21:17:11.043739+03:00",
      "text": "Не понял, как предполагается учитывать ежемесячное  пополнение вклада или докупку бумаг/валюты?\nДоп строку каждый месяц?"
    },
    {
      "id": 166211,
      "author": "Михаил Шардин",
      "datetime": "2020-04-18T21:24:06.232547+03:00",
      "text": "Ruslan, а как Вы обходите ограничение на размер ВЕБСЛУЖБА()?\n\n&gt; Если аргументы приводят к недействительной строке или содержит больше, чем разрешено в 32767 символов, то функция WEBSERVICE возвращает #VALUE! ошибку #ЗНАЧ!."
    },
    {
      "id": 166217,
      "author": "Михаил Шардин",
      "datetime": "2020-04-18T21:34:08.841518+03:00",
      "text": "Руслан, я понял как."
    },
    {
      "id": 166369,
      "author": "Виталий Лукьянченко",
      "datetime": "2020-04-19T08:14:53.106769+03:00",
      "text": "Руслан, а Вы могли бы поделиться шаблоном такой таблицы для учёта? \nБыл бы очень благодарен."
    },
    {
      "id": 167683,
      "author": "Михаил Шардин",
      "datetime": "2020-04-21T12:36:36.805750+03:00",
      "text": "Виталий, я написал статью про API Мосбиржи + Microsoft Excel на Хабре: https://habr.com/ru/post/498268/"
    },
    {
      "id": 167684,
      "author": "Михаил Шардин",
      "datetime": "2020-04-21T12:36:50.725666+03:00",
      "text": "Виталий, там много примеров."
    },
    {
      "id": 172737,
      "author": "Михаил Шардин",
      "datetime": "2020-04-30T10:51:11.583060+03:00",
      "text": "Yury, хорошо что разобрались 👍"
    },
    {
      "id": 172739,
      "author": "Михаил Шардин",
      "datetime": "2020-04-30T10:55:10.123249+03:00",
      "text": "Yury, именно акциями я не особо увлекаюсь, в основном облигации, так что вопрос хороший, но лично мне это не было особо интересно. \nНо посмотрите - я дополнил таблицу-шаблон по Мосбирже: https://docs.google.com/spreadsheets/d/1MI-FfjjOhPCYb0H2E9--bEWdsbu4HfOKly3ySySN-0k/edit?usp=sharing\nЧерез index думаю можно и в конкретную ячейку запихнуть :) без развертывания всех дат."
    },
    {
      "id": 173209,
      "author": "Михаил Шардин",
      "datetime": "2020-05-01T14:02:17.636816+03:00",
      "text": "Алексей, последний штрих уже давно готов - пожалуйста посмотрите эту таблицу: https://docs.google.com/spreadsheets/d/1MI-FfjjOhPCYb0H2E9--bEWdsbu4HfOKly3ySySN-0k/edit?usp=sharing"
    },
    {
      "id": 175262,
      "author": "Саид Нуралиев",
      "datetime": "2020-05-05T23:33:26.298651+03:00",
      "text": "Михаил, Спасибо"
    },
    {
      "id": 204135,
      "author": "мария туркова",
      "datetime": "2020-07-03T09:20:38.522924+03:00",
      "text": "Ruslan, мне бы очень хотелось увидеть вашу таблицу. я начинаю только и ищу удобный способ вести учет. есть интел инвест но не нравится как они считают."
    },
    {
      "id": 267920,
      "author": "Александр",
      "datetime": "2020-10-18T17:24:56.631942+03:00",
      "text": "Руслан, как с Вами можно связаться во вопросу использования Excel-таблицы?"
    },
    {
      "id": 267990,
      "author": "Светлана",
      "datetime": "2020-10-18T19:08:46.566547+03:00",
      "text": "Руслан, здравствуйте. Мне бы тоже хотелось такую таблицу в пользование 🙏 можно попросить вас поделиться?"
    },
    {
      "id": 296921,
      "author": "Анастасия Захарова",
      "datetime": "2020-11-28T21:46:48.845273+03:00",
      "text": "Руслан, так красиво описали вашу таблицу) как раз ищу что-то достаточно простое и именно с таким функционалом) поделитесь, пожалуйста)"
    },
    {
      "id": 303959,
      "author": "Albert",
      "datetime": "2020-12-09T03:25:39.942538+03:00",
      "text": "Руслан, не могли бы вы пожалуйста поделиться вашей разработкой? Оставьте реквизиты карты - переведу на чай если понравится"
    },
    {
      "id": 339939,
      "author": "Кит Гайд",
      "datetime": "2021-01-29T17:10:26.624851+03:00",
      "text": "Руслан, вы могли бы поделиться вашей умной таблицей? 🙏"
    },
    {
      "id": 351760,
      "author": "Essa Sa",
      "datetime": "2021-02-11T10:37:46.471640+03:00",
      "text": "мария, если только начинаете- составьте свою,где будет только то что нужно именно вам. Со временем она будет расти и будет настроена только на вашу стратегию инвестирования. Вам не захочется пользоваться чужой :)"
    },
    {
      "id": 359906,
      "author": "Sergey Кукс",
      "datetime": "2021-02-19T17:25:46.280547+03:00",
      "text": "Руслан, могли бы поделиться вашей таблицей? Очень понравилась идея)"
    },
    {
      "id": 481887,
      "author": "Екатерина Гречина",
      "datetime": "2021-06-30T18:14:27.131102+03:00",
      "text": "Михаил, подскажите, плз, как подтягивать через api информацию по иностранным акциям? например, с boardId:FQBR? не ищет ни среди bonds, ни среди shares"
    },
    {
      "id": 482808,
      "author": "Михаил Шардин",
      "datetime": "2021-07-01T15:07:00.472434+03:00",
      "text": "Екатерина, проще использовать другие готовые сервисы. Вот писал: https://t-j.ru/list/spreadsheets-for-investor/"
    },
    {
      "id": 661995,
      "author": "Владимир",
      "datetime": "2021-12-14T22:11:40.761780+03:00",
      "text": "Руслан, не  могли бы поделиться вашей таблицей по учету инвестицей? Если можно, конечно)"
    },
    {
      "id": 827267,
      "author": "Nik Ko",
      "datetime": "2022-05-13T08:28:38.586682+03:00",
      "text": "Михаил, спасибо за вашу работу!"
    },
    {
      "id": 1993630,
      "author": "Анастасия",
      "datetime": "2024-05-07T15:42:21.022981+03:00",
      "text": "Благодарю за информацию и таблицу! Таблица чудесная, но нужен апгрейд. Как я ни пыталась обойтись своими силами, пока не получается, моих знаний явно не хватает. Михаил, очень хотелось бы обновления информации на 2024 год."
    },
    {
      "id": 2280048,
      "author": "Михаил Шардин",
      "datetime": "2024-10-01T03:58:39.444983+03:00",
      "text": "Фарид, статья старая уже.\nВот актуальные ссылки:\nhttps://t-j.ru/guide/excel-kotirovki/\nhttps://t-j.ru/moex-bond-search/\nhttps://t-j.ru/bond-cash-flow-calc/\nhttps://t-j.ru/moex-bond-3/"
    }
  ]
}