{
  "url": "https://t-j.ru/fund-transfer/",
  "article_id": "a3d05fbc-4233-46c6-9f66-1868ecf07e90",
  "article_uuid": "a3d05fbc-4233-46c6-9f66-1868ecf07e90",
  "title": "Как перевести бумаги к иностранному брокеру: когда это выгодно и как правильно сделать",
  "comments": [
    {
      "id": 225511,
      "author": "Andy Shax",
      "datetime": "2020-08-11T10:12:38.537882+03:00",
      "text": "Иностранных брокеров которые счет россиянам открывают осталось так мало что на пальцах одной руки можно пересчитать. Причем это давление на анти-свободу выбора идет с обоих сторон. Совершив все 3 притопа 2 прихлопа а потом через огненый обруч прыг, вполне можно оказаться в ситуации как с брокером TDAmeritrade который сказал что клиентов РФ больше не обслуживает. Все идет медленным но верным шагом к иранской модели - полный запрет движения денег через границу."
    },
    {
      "id": 225530,
      "author": "Михаил Шардин",
      "datetime": "2020-08-11T10:36:53.801386+03:00",
      "text": "Andy, вы предлагаете сразу накрыться простыней и ползти в сторону кладбища?\r\n\r\nНикто не знает что будет, но всегда можно найти варианты."
    },
    {
      "id": 225567,
      "author": "DT",
      "datetime": "2020-08-11T12:12:23.539839+03:00",
      "text": "Почему Тинькофф журнал не пишет о Тинькофф Брокере? А здесь всё, мягко говоря, ужасно.\nЧтобы перевести с тинькова зарубежному брокеру нужно:\n- письменное заявление по каждому активу\n- личное обращение в офис в Москве (либо нотариально заверенное заявление по почте)\n- стоимость перевода из депозитария BestEffortsBank в другой депозитарий -15% от суммы перевода\nно не менее 25000 рублей!\n\nПечаль-беда. Знал бы раньше - не связывался. Но выводы соответствующие сделаны"
    },
    {
      "id": 225568,
      "author": "Юлия Севрук",
      "datetime": "2020-08-11T12:12:33.933831+03:00",
      "text": "В документе \"Ставки налога на дивиденды REIT для неамериканцев (англ.)\" ставка для РФ 30% указана. Или не то смотрю?"
    },
    {
      "id": 225591,
      "author": "Andy Shax",
      "datetime": "2020-08-11T13:04:47.974359+03:00",
      "text": "Михаил, я понимаю что \"авось пронесет\" это наш принцип жизни но подумать о безопасности своих средств все таки бывает полезно. На прошлой неделе мой американский брокер осчастливил сообщением что в страны из списка AML вывод денег больше не выводит. РФ в этом списке состоит. Меня лично это не касается, но для клиента из РФ такой сюрприз будет неприятным."
    },
    {
      "id": 225597,
      "author": "Andy Shax",
      "datetime": "2020-08-11T13:11:51.352112+03:00",
      "text": "Юлия, это только для тех кто договора с сша по избежанию 2го налогооблажения не имеет. Такой договор у РФ и США есть (хоть за это Ельцину спасибо)"
    },
    {
      "id": 225607,
      "author": "Нина Донина",
      "datetime": "2020-08-11T13:32:07.093125+03:00",
      "text": "Andy, стоит почитать СОИДН и ссылку на протокол.\n\"К дивидендам, выплачиваемым американской компанией, рассматриваемой как доверительный фонд по инвестированию в недвижимость, применяется ставка налога, взимаемого \"у источника\", предусмотренная внутренним законодательством\".\nЕще ссыль https://www.irs.gov/pub/irs-utl/Tax_Treaty_Table_1_2019_Feb.pdf\nThe rate in column 6 applies to dividends paid by a regulated investment company (RIC). Dividends paid by a real estate investment trust (REIT) are subject to a 30% rate"
    },
    {
      "id": 225608,
      "author": "Михаил Шардин",
      "datetime": "2020-08-11T13:32:49.358422+03:00",
      "text": "Andy, уточните пожалуйста какого именно брокера вы имеете ввиду?"
    },
    {
      "id": 225609,
      "author": "Михаил Шардин",
      "datetime": "2020-08-11T13:33:47.143556+03:00",
      "text": "Dmitry, в статье описан перевод с ВТБ."
    },
    {
      "id": 225617,
      "author": "Михаил Шардин",
      "datetime": "2020-08-11T13:47:56.862317+03:00",
      "text": "Нина, спасибо за ваш комментарий, а если его расшифровать - то какая ставка получается?"
    },
    {
      "id": 225622,
      "author": "FIRE Comrade",
      "datetime": "2020-08-11T13:57:45.715244+03:00",
      "text": "Михаил, Ставка по американским REIT'ам для налоговых резидентов России — 30%"
    },
    {
      "id": 225626,
      "author": "Нина Донина",
      "datetime": "2020-08-11T14:05:42.260839+03:00",
      "text": "Михаил, по большинству REITs  30%. \nПочему некоторые фонды берут меньше - информации не нашла.\nно Вы в ФБ-группе можете поискать, там писали, какие REITs взяли 10%."
    },
    {
      "id": 225630,
      "author": "Andy Shax",
      "datetime": "2020-08-11T14:17:36.699687+03:00",
      "text": "Нина, пояснение в footnote ff повергло меня в недоумение, в самом договоре ничего такого не написано, и я не первый год как резидент РФ платил 10% по дистрибуциям американских REIT. 30% с меня брали только за дистрибуции MLP."
    },
    {
      "id": 225633,
      "author": "Нина Донина",
      "datetime": "2020-08-11T14:30:41.908183+03:00",
      "text": "Andy, \nhttp://www.consultant.ru/document/cons_doc_LAW_3575/2532ae686c1df879e3258826d1686745ccf39011/#dst100227\nвот протокол, неотъемлемая часть СОИДН с Штатами. По сути там - 30%\nПочему берут меньше - я не в курсе. Но не со всех REITs, с каких-то таки берут 30.\nПо партнерствам вроде 37%?"
    },
    {
      "id": 225642,
      "author": "Andy Shax",
      "datetime": "2020-08-11T15:00:47.115999+03:00",
      "text": "Нина, раз уж мы влезли в такие дебри, вообще то дистрибуции REIT не однородны. Читаем их отчет именуемый Tax Dividend Treatment for Year 20хх - там будут строчки Return of Capital, Ordinary Dividend, Section 1099a distribution, LTC gain, и другое. И этот отчет меняется с каждой выплатой. То есть у меня были дистрибуции REIT с которых $0 налога IRS снимала тк считались неналогооблагаемые"
    },
    {
      "id": 225645,
      "author": "Нина Донина",
      "datetime": "2020-08-11T15:06:18.864361+03:00",
      "text": "Andy, \nтаки это я тоже проверяла. Не бились цифры в нескольких трастах. Слишком малая доля была необлагаемой базы.\nВ общем, у меня тямы не хватает понять почему 10 вместо 30."
    },
    {
      "id": 225660,
      "author": "Andy Shax",
      "datetime": "2020-08-11T15:48:35.037428+03:00",
      "text": "Нина, как пример приведу из всего портфеля CyrusOne REIT (CONE). Отчет за 2019 - https://investor.cyrusone.com/static-files/67fbe0ef-3453-44c5-a97a-0feda6d4e1e1 пишут - 12% will be treated as taxable dividend 88% as return of capital under section 301c. Отсылается в IRS, с 88% они взяли ноль, с 12% взяли 10%. Чего в этом footnote ff имеется ввиду под REIT dividends я не знаю. Сами REITы их так не называют, суммарная выплата у них называется REIT distribution, а в деталях там много разных категорий ни по одной из которых с меня 30% не брали"
    },
    {
      "id": 225671,
      "author": "FIRE Comrade",
      "datetime": "2020-08-11T16:16:26.162144+03:00",
      "text": "Andy, Интересно. Тут они пишут, что 12% — это прирост капитала, а дивидендов не было:\r\nhttps://investor.cyrusone.com/news-releases/news-release-details/cyrusone-inc-announces-tax-allocations-2019-distributions"
    },
    {
      "id": 225859,
      "author": "Нина Донина",
      "datetime": "2020-08-11T23:55:42.593854+03:00",
      "text": "Andy, https://investor.cyrusone.com/static-files/00335156-2a0c-4728-b467-cd8455beffea\nмного чего интересного в плане налогов для нерезидента.\nНо разбираться, конечно, лень.\nБерут мало и хорошо."
    },
    {
      "id": 225965,
      "author": "FIRE Comrade",
      "datetime": "2020-08-12T10:38:27.182727+03:00",
      "text": "Если речь об Interactive Brokers, он некоторое время назад распространил вот такую информацию:\r\nhttps://ibkr.info/ru/article/3441\r\nКонечно, тут речь не идёт о том, что нельзя вывести свои деньги. Просто ограничивают сомнительные операции с сомнительными странами."
    },
    {
      "id": 226187,
      "author": "Anton Permogorov",
      "datetime": "2020-08-12T15:48:22.793912+03:00",
      "text": "Tema, при переводе указывается цена, дата и прочие реквизиты покупки"
    },
    {
      "id": 226452,
      "author": "Andy Shax",
      "datetime": "2020-08-12T23:35:12.840782+03:00",
      "text": "FIRE, мы и есть сомнительные операции в сомнительных странах :) то что россиянам еще что то позволяют открыть это вообще чудеса, беларусов отрезали еще в 2006 году указом Буша младшего за куда меньшие грехи. \n\nЕсть немаленький риск получить повестку что брокер резидентов РФ  больше не обслуживает, а вывести деньги некуда тк сомнительным личностям в сомнительных странах такое не разрешается."
    },
    {
      "id": 226542,
      "author": "FIRE Comrade",
      "datetime": "2020-08-13T09:10:07.596080+03:00",
      "text": "Andy, Мы сомнительная страна — да. Но переводить свои деньги на свой банковский счёт в своей стране — не сомнительная операция. Не далее как вчера проверял, всё работает. Так что не пугайте молодёжь :)\r\nКонечно, есть риск, что перестанут обслуживать. Но сомневаюсь, что не позволят вернуть свои деньги. Не слышал ни разу о таких случаях (если только вы не личный друг того, кого нельзя называть)."
    },
    {
      "id": 246131,
      "author": "Наталья",
      "datetime": "2020-09-14T16:25:33.925504+03:00",
      "text": "Agajan, \nЗарубежные брокеры, которые удаленно открывают счета россиянам:\nInteractive Brokers (США. Есть сайт на русском языке. Один из лучших и крупнейших брокеров с большой историей. Комиссия за бездействие — $10 в мес., сейчас мин. депозит — $10 000)\nCaptrader (мин. депозит — 2 000 EUR или USD, нет комиссии за бездействие)\nLightspeed (мин. депозит — $25 000)\nSchwab (мин. депозит — нет)\nPlace Trade (мин. депозит — $5 000)\nJust2Trade (мин. депозит — $2 500) — американская «дочка» «Финам-а»\nWhotrades Inc (США) (мин. депозит — $3 000) — Финам\nVenom by Cobra Trading (мин. депозит — $5 000)\n\nИз европейских брокеров проще всего открыть счет у трёх:\nSaxobank (Дания) — $600\nCapTrader (Германия) — 2 000 EUR или USD\nExante (Мальта) — 10 000 EUR"
    },
    {
      "id": 247652,
      "author": "Oleg Elizarov",
      "datetime": "2020-09-16T16:59:15.787428+03:00",
      "text": "Наталья, \r\nА вы про налоги не думали? Продать и купить. А если у меня акции куплены еще при курсе в 32 руб за доллар. При продаже будет валютная переоценка и эпический налог. Тут нужен именно перевод бумаг, если они вам еще нужны."
    },
    {
      "id": 261816,
      "author": "Alex",
      "datetime": "2020-10-08T23:47:25.915492+03:00",
      "text": "Dmitry, то есть у других брокеров комиссия не 15%?"
    },
    {
      "id": 335274,
      "author": "Лариса Никитина",
      "datetime": "2021-01-23T17:32:56.842349+03:00",
      "text": "Михаил, Вы можете ответить на предложенный мной вопрос?"
    },
    {
      "id": 337879,
      "author": "Михаил Шардин",
      "datetime": "2021-01-27T12:21:43.030897+03:00",
      "text": "Лариса, я уже ответил ниже"
    },
    {
      "id": 378910,
      "author": "Полиция Т—Ж",
      "datetime": "2021-03-14T19:19:46.301064+03:00",
      "text": "lord, пожалуйста, выбирайте выражения: https://t-j.ru/comments-rules/."
    },
    {
      "id": 447273,
      "author": "Dmitry Nikonian",
      "datetime": "2021-05-26T23:56:18.273720+03:00",
      "text": "Интересная статья, вроде бы меньше года прошло, должна быть актуальной. При этом у меня опыт апреля 2021 оказался иным и пока негативным. Реальность такова. Месяц назад я попытался перевести бумаги из \"Открытия\" в IB. В \"Открытии\" заявку отклонили и потребовали предоставить \"номер счета НРД\" и \"раздел счета депо\" от брокера, куда делается перевод. Сказали - без этих реквизитов перевод осуществлен не будет. IB в ответ на запрос в техподдержку ответил, что такие данные они клиентам не дают и \"Открытие\" должен сам с ними связаться по адресу assettransferservice@interactivebrokers.com и согласовать перевод. Поговорил с техподдержкой \"Открытия\" и убедил их связаться напрямую. В итоге якобы идет какая-то переписка между брокерами, уже месяц дело не двигается. В общем, идут недели, результат нулевой, информации мне не предоставляют, статус неизвестен. Самое неприятное, что это я решил сделать лишь пробный перевод пары позиций, на деле этих позиций сотни. Прожада - вывод - покупка чреваты серьезными налоговыми потерями. Если кто-то сталкивался с подобным, интересен ваш опыт. А так - в назидание тем, кто только собирается затевать подобную, вроде бы простую, операцию."
    },
    {
      "id": 587103,
      "author": "Вячеслав",
      "datetime": "2021-10-14T11:48:52.154616+03:00",
      "text": "Михаил, добрый день, можете подсказать иностранного/ых брокера, который без проблем принимает бумаги от российского брокера."
    },
    {
      "id": 587109,
      "author": "Вячеслав",
      "datetime": "2021-10-14T11:57:33.260527+03:00",
      "text": "Dmitry, добрый день!\nЧем закончилась ваша эпопея если не секрет. Удалось перевести ЦБ в IB или в итоге поменяли иностранного брокера? Думаю об аналогичной проблеме, спасибо."
    },
    {
      "id": 587195,
      "author": "Вячеслав",
      "datetime": "2021-10-14T12:58:00.363991+03:00",
      "text": "Михаил, ничего не получается открыть"
    },
    {
      "id": 587197,
      "author": "Вячеслав",
      "datetime": "2021-10-14T12:59:23.709300+03:00",
      "text": "Вячеслав, могу я написать вам в личку"
    },
    {
      "id": 587223,
      "author": "Dmitry Nikonian",
      "datetime": "2021-10-14T13:12:15.029058+03:00",
      "text": "Вячеслав, не удалось с IB это сделать, только через других брокеров"
    },
    {
      "id": 652854,
      "author": "Nikolay Bookoff",
      "datetime": "2021-12-07T16:57:43.496202+03:00",
      "text": "А если бумаги в ЦБ РФ хранятся что делать..."
    },
    {
      "id": 757577,
      "author": "Ирина Агейкина",
      "datetime": "2022-03-07T09:46:36.930181+03:00",
      "text": "Михаил, Яндекс вас не находит, а очень нужна ваша консультация. Нужно перевести активы от российского брокера американскому. В числе активов - российские облигации, я не очень понимаю, что с ними делать"
    },
    {
      "id": 757580,
      "author": "Ирина Агейкина",
      "datetime": "2022-03-07T09:48:31.261661+03:00",
      "text": "Михаил, к сожалению, Яндекс так не ищет. А очень нужна консультация - нужно перевести активы от российского брокера американскому. Не могу сообразить, что делать с российскими облигациями и акциями. Не переводить, не вариант - мы живем за границей. Сможете подсказать?"
    },
    {
      "id": 758222,
      "author": "Kate Lyapina",
      "datetime": "2022-03-08T13:21:37.230761+03:00",
      "text": "А если бумаги на биржах СПБ и ММВБ (иностранные), то можно их перевести зарубежному брокеру?"
    },
    {
      "id": 758297,
      "author": "Kate Lyapina",
      "datetime": "2022-03-08T16:29:09.782109+03:00",
      "text": "Михаил, Если проблему можно решить за деньги, это не проблема, это расходы. :)"
    },
    {
      "id": 762994,
      "author": "Timofey",
      "datetime": "2022-03-13T01:15:47.229482+03:00",
      "text": "Думаю, что игра стоит свеч. Спасибо, что предупредили о всех подводных камнях."
    },
    {
      "id": 773675,
      "author": "Evgeny Zak",
      "datetime": "2022-03-24T11:34:36.080835+03:00",
      "text": "Dmitry, а с каким брокером удалось?"
    },
    {
      "id": 773863,
      "author": "Evgeny Zak",
      "datetime": "2022-03-24T13:32:02.356304+03:00",
      "text": "Михаил, Какие российские брокеры могут отправить в IB? С адекватным сервисом."
    },
    {
      "id": 792588,
      "author": "Alex Turov",
      "datetime": "2022-04-10T09:37:02.867879+03:00",
      "text": "А где сейчас найти иностранного брокера"
    },
    {
      "id": 792641,
      "author": "Наталья Усатова",
      "datetime": "2022-04-10T10:54:08.529019+03:00",
      "text": "Михаил, здравствуйте,а как сейчас перевести американские акции из банков РФ,которые попали под санкции в IB?В России их невозможно продать,они заблокированы вышестоящим депозитарием."
    },
    {
      "id": 924211,
      "author": "Наталья Береза",
      "datetime": "2022-07-23T16:46:56.476454+03:00",
      "text": "Михаил, это поддержка IB вам писала про всех брокеров? Я пытаюсь сделать перевод из Сити, мне IB ничего такого не писал. Но и перевод не идёт , Сити не желает напрямую коммуницировать с брокером. Говорит, у них нет таких процедур, они просто двигают бумаги на основании поручения клиента в Евроклир, где те потом должны смэчиться с встречными  поручениями от принимающей стороны. Но так не работает("
    },
    {
      "id": 1757128,
      "author": "Александр Березкин",
      "datetime": "2024-01-15T04:03:28.243077+03:00",
      "text": "...а что в 2024? Особливо интересуюсь на счёт заблокированных активов. СПб, видимо, всё. Бумаги набраны. Ни продать, ни купить, ни вывести. Остались ещё какие-то варианты перевести к иностранному брокеру? Или забыть, как забыли о вкладах Сбербанка, Госстрахе и облигациях?"
    },
    {
      "id": 1757145,
      "author": "Михаил Шардин",
      "datetime": "2024-01-15T04:57:20.076330+03:00",
      "text": "Александр, статья написана в 2020 году"
    },
    {
      "id": 1759157,
      "author": "Александр Березкин",
      "datetime": "2024-01-16T02:19:49.253414+03:00",
      "text": "Михаил, а я не в упрёк за неактуальность. Просто, в качестве вопроса на злобу дня - возможно, Вы в курсе - в сложившихся условиях -  это реально?"
    },
    {
      "id": 2115177,
      "author": "Никита",
      "datetime": "2024-07-06T19:03:33.205185+03:00",
      "text": "Александр, Подскажите, узнавали ли о возможности это сделать? Или не углублялись в тему дальше с заблокированными инструментами?"
    }
  ]
}