{
  "url": "https://t-j.ru/ask/trading-robot/",
  "article_id": "c52f5f17-a615-4c8d-8d5a-cbd80186416b",
  "article_uuid": "c52f5f17-a615-4c8d-8d5a-cbd80186416b",
  "title": "Роботы на бирже: как работают и могут ли они увеличить доходность",
  "comments": [
    {
      "id": 247187,
      "author": "тьфунатебя ¯\\_(ツ)_/¯",
      "datetime": "2020-09-16T12:17:19.188823+03:00",
      "text": "простое доказательство, что роботы не сделают вас миллионером - их создателей не видно в списке форбс"
    },
    {
      "id": 247199,
      "author": "Антон Крутов",
      "datetime": "2020-09-16T12:39:13.287747+03:00",
      "text": "Роботы на Форексе это на самом деле весело, самое крутое это разнообразные приемчики, как добиться того, чтобы они на реальном счете показывали прибыль и как сделать чтобы лох, т.е. клиент не сразу понял, что он всё таки не станет миллиардером (а так хотелось)\n\nНа фондовом рынке другое дело, значительная часть сделок правда осуществляется роботами, но там как бы серьёзная аналитическая работа делается, такие штуки за 20$ не продают пока"
    },
    {
      "id": 247202,
      "author": "Eugeniy N",
      "datetime": "2020-09-16T12:42:25.190921+03:00",
      "text": "Ещё не прочёл статью - но отвечаю: конечно можно! Надо продавать торгового робота или услуги такого робота!"
    },
    {
      "id": 247207,
      "author": "Eugeniy N",
      "datetime": "2020-09-16T12:47:02.967118+03:00",
      "text": "А если серьёзно - ну кто вам продаст робота с доходом 20% в месяц? 100 тыс за 2 года превратятся в 8 миллионов."
    },
    {
      "id": 247322,
      "author": "Малина Вареньевна",
      "datetime": "2020-09-16T13:42:38.631091+03:00",
      "text": "Зашла почитать статью думая, что речь пойдет об автоматах с шоколадками :с"
    },
    {
      "id": 247510,
      "author": "Сергей Блинов",
      "datetime": "2020-09-16T15:09:04.307953+03:00",
      "text": "Мне кажется, одна из основнвх проблем этих \"высокочастотных\" роботов в том, что чем больше сделок ты делаешь, тем больше комиссий с тебя берут, и потому робот просто растрачивается депозит, делая тысячи сделок, даже если многие из них прибыльны сами по себе"
    },
    {
      "id": 247656,
      "author": "Andreas Bern",
      "datetime": "2020-09-16T17:01:43.422523+03:00",
      "text": "Terri, я тоже подумал о вендинговых аппаратах :D"
    },
    {
      "id": 247657,
      "author": "Малина Вареньевна",
      "datetime": "2020-09-16T17:02:13.687750+03:00",
      "text": "Andreas, так вот как они называются!"
    },
    {
      "id": 247663,
      "author": "Михаил Шардин",
      "datetime": "2020-09-16T17:05:23.384561+03:00",
      "text": "Terri, а кажется про 🤖 :)"
    },
    {
      "id": 247664,
      "author": "Михаил Шардин",
      "datetime": "2020-09-16T17:05:55.243891+03:00",
      "text": "Это точно, друг тьфунатебя ;)"
    },
    {
      "id": 247667,
      "author": "Михаил Шардин",
      "datetime": "2020-09-16T17:06:05.100688+03:00",
      "text": "Eugeniy, да."
    },
    {
      "id": 247672,
      "author": "Михаил Шардин",
      "datetime": "2020-09-16T17:07:45.534407+03:00",
      "text": "Антон, роботы всякие бывают - если создал сам нет вопросов, но вот именно продажа вызывает вопросы, в большинстве случаев это именно бизнес по продаже."
    },
    {
      "id": 247677,
      "author": "Михаил Шардин",
      "datetime": "2020-09-16T17:11:28.563874+03:00",
      "text": "Сергей, обычно это удел компаний. \r\nТе же нейтральные к рынку хедж-фонды. Арбитраж. Инфраструктурная нагрузка для них гораздо дешевле обходиться, чем для частного лица в силу их размера."
    },
    {
      "id": 247685,
      "author": "Михаил Шардин",
      "datetime": "2020-09-16T17:16:40.756040+03:00",
      "text": "ILya, это точно такой же робот как из вопроса. Суть именно продажи роботов в бытовом понимании всегда одна."
    },
    {
      "id": 247687,
      "author": "Антон Крутов",
      "datetime": "2020-09-16T17:16:51.420455+03:00",
      "text": "Михаил, а зачем это уточнение \"в большинстве случаев\"? Оно даёт обывателям ложную надежду, опасную надежду, до сих пор перед глазами обезумевшие от жадности заводские рабочие на семинарах Форекс клуба ))"
    },
    {
      "id": 247691,
      "author": "Михаил Шардин",
      "datetime": "2020-09-16T17:19:03.929615+03:00",
      "text": "Антон, вы правы. Для обывателя это опасно потерей денег."
    },
    {
      "id": 250991,
      "author": "Иван Коваль-Зайцев",
      "datetime": "2020-09-21T16:55:59.554736+03:00",
      "text": "Вброшу-ка я свои 5 копеек на вентилятор. Много мнений существует о том, чем именно я занимаюсь - но на самом деле я торгую на бирже с 2005 года, и более половины времени - с помощью четких алгоритмов. Суть робота - как правильно сказано в статье - в алгоритме. Робот - это всего лишь автоматизация идеи. Но сам факт продажи не делает робота плохим, а продавца мошенником. Продажа робота - это получение мгновенной прибыли без биржевого риска. Мы не знаем будущего, и наличие робота не гарантирует нам 100% годовых. Для продавца без стартового капитала гораздо выгоднее продать 10 копий по 100 тысяч - и получить свой честный миллион, заработанный своими знаниями и трудом - чем пытаться заработать этот миллион непосредственно на бирже... но в целом - как и в случае доверительного управления - 95% предложения на рынке - это обман, следует относиться к трейдингу как к бизнесу и максимально досконально изучать контрагентов. В целом - нормальная статья. Но не забывайте еще и тот факт, что нельзя бесконечно увеличивать капитал в управлении - у каждого алгоритма своя капиталоемкость. Так что волшебные сложные проценты не работают чаще всего..."
    },
    {
      "id": 251046,
      "author": "Иван Петров",
      "datetime": "2020-09-21T18:10:54.965288+03:00",
      "text": "Eugeniy, угу, Робот не бит, не крашен, без пробега по российским акциям ;)"
    },
    {
      "id": 251072,
      "author": "Михаил Шардин",
      "datetime": "2020-09-21T19:16:28.970061+03:00",
      "text": "Иван, да на счет алгоритмов 👍"
    },
    {
      "id": 252642,
      "author": "Ильдар Мирзаянов",
      "datetime": "2020-09-24T06:19:01.191621+03:00",
      "text": "я сам такой написал когда-то. На истории я был богат, в реальности доход был копеечный."
    },
    {
      "id": 252643,
      "author": "Олег Кужилин",
      "datetime": "2020-09-24T06:38:40.135314+03:00",
      "text": "Халявы не будет ."
    },
    {
      "id": 252676,
      "author": "Михаил Шардин",
      "datetime": "2020-09-24T08:51:06.804122+03:00",
      "text": "Олег, 👍"
    },
    {
      "id": 277654,
      "author": "Александр Полторацкий",
      "datetime": "2020-11-02T04:25:55.378520+03:00",
      "text": "Со сложными процентами вы к сожалению ошиблись... HFT системы ограничены мгновенной ликвидностью, т. е. зарабатывая 50% на 100 к. р. вы не сможете долить на счет миллион и зарабатывать столько же в процентах. Увеличение доходности ведется горизонтальным покрытием большего числа алгоритмов на большее количество инструментов."
    },
    {
      "id": 282453,
      "author": "Михаил Шардин",
      "datetime": "2020-11-08T14:40:16.484056+03:00",
      "text": "Александр, это понятно. Разве в статье пишу про это?"
    },
    {
      "id": 371097,
      "author": "Antin Ukrainec",
      "datetime": "2021-03-05T01:31:51.572495+03:00",
      "text": "Уважаемый автор, как вам Nitrex?  Я нуб в вопросах трейдинга валютами и в том числе роботов и на секунду было подумал, что НИтрекс норм штукенция, но также задавался вопросом - зачем продавать инструмент, который приносит от 60% от первоначального депозита менее чем за 3 мес? В общем , прочитав вашу статью убедился, что Nitrex развод, просто интересно и ваше мнение по этому поводу."
    },
    {
      "id": 372890,
      "author": "Руслан Гуменюк",
      "datetime": "2021-03-07T09:40:15.404199+03:00",
      "text": "не ведитесь имел опыт"
    },
    {
      "id": 387877,
      "author": "Евгений Иванов",
      "datetime": "2021-03-24T09:50:12.444084+03:00",
      "text": "робот будет хорош только тогда когда он сможет сам определять настроение рынка, читать все новости, твитеры, и на основании этого строить стратегии. иначе все сольет. сегодня цена растет, все красиво, робот закупается, завтра кто ни будь пишет твит и цены летят вниз, но не плавно а сразу, скачком, хоп и упала, крупный инвестор вышел из акций. и робот на таком падении слился в минус, депозит потерян. а должен был сам успеть прочитать новость и слиться вперед этого инвестора. но за этим инвестором сидит команда из 100 человек и куча алгоритмов торгующих. вот и поборись с этим."
    },
    {
      "id": 399872,
      "author": "Михаил Шардин",
      "datetime": "2021-04-07T10:35:17.847279+03:00",
      "text": "Руслан, в статье вроде так и написано :)"
    },
    {
      "id": 399874,
      "author": "Михаил Шардин",
      "datetime": "2021-04-07T10:36:00.504409+03:00",
      "text": "Евгений, да!"
    },
    {
      "id": 676199,
      "author": "Виктор Гусельников",
      "datetime": "2021-12-25T13:49:36.242617+03:00",
      "text": "Я вот не согласен с партнерской программой, я написал торгового робота, который торгует только в плюс! Риском является время, которое он ждет до выхода. На данный момент это 10 % в месяц за 4 месяца тестов, и я как бедный программист у которого всего 300 000 тысяч рублей, заинтересован  в увеличении капитала. Мне выгоднее поделиться программой и брать 30% от профита пользователей, которые ею пользуются. Таким образам легко увеличить объем не своими деньгами. Да все зависит от риск - прибыль, если в алгоритме прописаны риски то и прибыль можно соответствующую но так-же можно и слить депозит. Если рассчитывать на 10% по моим меркам это оптимально, то риск снижается во много раз."
    },
    {
      "id": 1181204,
      "author": "Sedov Anton",
      "datetime": "2023-01-20T13:49:24.946909+03:00",
      "text": "Владимир, вы лучше спросите у автора статьи про его опыт использования торговых роботов. Потом спросите знает он что-то про маржинальную торговлю и спотовую. Думаю знает, но смешал всё в кучу в тексте. Я с роботами с 2019 года. Всё прекрасно."
    },
    {
      "id": 1181206,
      "author": "Sedov Anton",
      "datetime": "2023-01-20T13:50:27.547052+03:00",
      "text": "Ptizza, спред закладывать в тест нужно обязательно."
    },
    {
      "id": 1181209,
      "author": "Михаил Шардин",
      "datetime": "2023-01-20T13:51:19.072428+03:00",
      "text": "Sedov, лично я не против торговых роботов для себя, но на продажу почти всегда обман."
    },
    {
      "id": 1181211,
      "author": "Михаил Шардин",
      "datetime": "2023-01-20T13:51:35.005347+03:00",
      "text": "Sedov, это понятно"
    },
    {
      "id": 1181231,
      "author": "Sedov Anton",
      "datetime": "2023-01-20T13:57:39.231149+03:00",
      "text": "максим, вы когда покупаете антивирус вам дают весь расклад по алгоритмам и библиотекам? Нет. Вам дают гарантии что вы не поймаете вирус? Нет. Но при покупке у вас таких вопросов не возникает. Робот, это алгоритм и давать гарантию на алгоритм нет смысла так как он написан и любые изменения, это уже изменение алгоритма. Залезли руками в алгоритм? Тогда у вас уже другой алгоритм) Даже если разработчик расскажет вам всю логику алгоритма и т.п. вы наверняка ничего не поймёте. А если вы разбираетесь в алгоритмах, то почему свои не пишите? Или вы конкурент, который хочет своровать бесплатно алгоритм? Чтобы принять решение о покупке робота, можно встать на копирование (автоследование)."
    },
    {
      "id": 1181234,
      "author": "Михаил Шардин",
      "datetime": "2023-01-20T13:59:08.574492+03:00",
      "text": "Sedov, 👍"
    },
    {
      "id": 1181235,
      "author": "Sedov Anton",
      "datetime": "2023-01-20T13:59:21.113548+03:00",
      "text": "Виктор, вы молодец, поэтому автор вам и не ответил 😉👌"
    },
    {
      "id": 1603290,
      "author": "Елена Землянская",
      "datetime": "2023-10-16T23:47:35.456893+03:00",
      "text": "тьфунатебя, а зачем это афишировать?"
    },
    {
      "id": 1694258,
      "author": "Анатолий Прокопенко",
      "datetime": "2023-12-06T21:34:38.669573+03:00",
      "text": "Михаил, во первых все отзывы носят предположительный характер, ни один из выше давших лиц свои комментарии, лично сам не торговал на роботах. Это значит, что таким отзывам грош цена, или как говорят \" казала мазала\". \nРоботы это то что надо сегодня для инвестиций, и они зарабатывают реальные деньги. Ни о какой пирамиде речь идти не может, иак как денежные средства для торговли роботом находятся на своем личном счете, и не в чьем то управлениии, что очень важно. Расопстранение роботов ни как не говорит о чем то отрицательном , ведь сейчас любой банк говорит, приведи друга получи 500 рублей.\nЯ лично торгую уже два года, все прекрасно получается, никаких сбоев и неприятностей робот не приносит, депозит не сливает. \nТак что , роботы на бирже это вещь отличная от 10 до 20 % в месяц дают, и это проверено лично."
    },
    {
      "id": 1788541,
      "author": "Алексей Шувалов",
      "datetime": "2024-01-29T11:47:51.684091+03:00",
      "text": "Добрый день, очень интересная статья, торговые систем на рынке великое множество, обратившись на сервисы фриланса, вы можете без проблем заказать алгоритм, который напишут под ваши запросы, возможно он принесет вам в первые дни, недели и даже месяцы хорошие деньги, но дальше алгоритм устареет и система пойдет в минус. По мне роботы отличный инструмент, который позволяет заработать, но имея следующие показатели:\n1. Торговая стратегия должна регулярно обновляться (командная работа \"практикующие трейдеры-программисты\")\n2. Не гнаться за доходом, 5-10% в месяц, это реальные цифры с разумным риском\n3. Торговая система имеет ограничения в максимальном количестве сделок и  контролируется человеком имеющим знания в трейдинге.\nТогда можно говорить о уверенном доходе с помощью торговых систем."
    },
    {
      "id": 1832156,
      "author": "Евгений Давлетшин",
      "datetime": "2024-02-18T10:20:38.102664+03:00",
      "text": "Руслан, имею положительный опыт. Если вы слили ваш депозит - это не вина робота. Это ваша ответственность."
    },
    {
      "id": 1832166,
      "author": "Михаил Шардин",
      "datetime": "2024-02-18T10:28:05.223145+03:00",
      "text": "Евгений, не надо здесь заливать. Сам по себе робот это не хорошо и не плохо.\n\nОсобенно хорошо если ты самого разработал. \n\nНо если купил то просто поддержал разработчика. \n\nТем более вы пишите комментарии с аккаунта который только что зарегистрирован и только про роботов."
    },
    {
      "id": 1832172,
      "author": "Евгений Давлетшин",
      "datetime": "2024-02-18T10:31:00.137091+03:00",
      "text": "Sedov, я тоже про это же думал, когда читал) Но у автора, скорее всего,  профессиональная деформация, так как он сам разрабатывал роботов. И следовательно, он понимает все тонкости."
    },
    {
      "id": 1832203,
      "author": "Евгений Давлетшин",
      "datetime": "2024-02-18T10:47:39.931434+03:00",
      "text": "Анатолий, поддерживаю)) Робот на Форексе - норм тема)"
    },
    {
      "id": 1832212,
      "author": "Евгений Давлетшин",
      "datetime": "2024-02-18T10:51:48.053846+03:00",
      "text": "ILya, не совсем понимаю, почему и кто ставит дизлайк просто за вопрос. Поставил лайк для поддержки. А вообще хочу сказать, что любой подобный вопрос - это типа способ предложить ответственность за принятие решения на кого-то. Илья, без обид, в финансах только вы сами можете решить, готовы ли вы к каким-то рискам и потерям или нет."
    },
    {
      "id": 2011454,
      "author": "Ivan Dobrodey",
      "datetime": "2024-05-16T21:56:33.771897+03:00",
      "text": "Eugeniy, с ростом объёма одной сделки начинается проскальзывание. То есть, на бирже просто нельзя будет купить например акций Сбербанка на 1 млн рублей по цене строго 100₽. Цена будет сдвигаться вверх. Из-за этого вход будет уже не такой выгодный. И нельзя будет бесконечно масштабировать, нужно разделять по разным акциям например."
    },
    {
      "id": 2011465,
      "author": "Ivan Dobrodey",
      "datetime": "2024-05-16T22:05:34.914691+03:00",
      "text": "Интересная статья. Я изучаю эту тему с 2015 года. Сначала были памм-счета, потом форекс с мартингейлом, потерял несколько сотен тысяч, набирался опыта :) понимание было на нуле. Перешёл на крипту, начал разбираться в теханализе, в теории нормального «стратегистроения» – это когда у каждой сделки есть стоп-лосс и тейк-профит, и когда стратегия оптимизируется и тестируется на walk forward тесте, а затем запускается в торговлю на какое-то время, затем снова оптимизируется, потому что стратегии перестают работать. В общем, сейчас я пришёл к тому, что я пишу свою собственную программу на Python (по сути стал программистом) со своим набором стратегий и чёткими правилами бэктеста, оптимизации и тд, сейчас как раз в процессе запуска в реальные торги, сегодня только что заработал на пробном объёме первые 50 рублей 😁 Мне это просто дико нравится, потому что иначе я бы уже давно бросил это дело :)"
    },
    {
      "id": 2091016,
      "author": "Валера",
      "datetime": "2024-06-25T19:07:18.445129+03:00",
      "text": "Иван, это лучшие пять копеек, которые я когда-либо читала)"
    },
    {
      "id": 2955116,
      "author": "Павел Сериков",
      "datetime": "2025-08-06T07:34:18.861709+03:00",
      "text": "Александр, подскажите с какого робота можно начать мне? очень интересна эта тема.."
    },
    {
      "id": 2955119,
      "author": "Михаил Шардин",
      "datetime": "2025-08-06T07:35:08.556427+03:00",
      "text": "Павел, на Хабре поищите"
    }
  ]
}