{
  "url": "https://t-j.ru/prepayment-offer/",
  "article_id": "cac773dd-20d7-4974-bc14-596e6154bb31",
  "article_uuid": "cac773dd-20d7-4974-bc14-596e6154bb31",
  "title": "Оферта по облигациям: как устроена и стоит ли участвовать",
  "comments": [
    {
      "id": 1008281,
      "author": "Работник Колцентра",
      "datetime": "2022-09-15T15:27:26.420498+03:00",
      "text": "Отличная статья, читаем всем отделом Тинькофф \"Инвестиции\". Спасибо"
    },
    {
      "id": 1008283,
      "author": "Михаил Шардин",
      "datetime": "2022-09-15T15:27:55.469475+03:00",
      "text": "Работник, и помогает?"
    },
    {
      "id": 1009644,
      "author": "Работник Колцентра",
      "datetime": "2022-09-16T12:56:33.728844+03:00",
      "text": "Михаил, да, четко. Спасибо! Все понятно и доступно, текст отличный."
    },
    {
      "id": 1044391,
      "author": "user1007261",
      "datetime": "2022-10-17T14:01:12.836291+03:00",
      "text": "я не нашел данных по колл-оферте селл сервиса,где брать такую информацию на каких источниках?"
    },
    {
      "id": 1097899,
      "author": "Алексей Свирин",
      "datetime": "2022-11-24T10:54:18.640833+03:00",
      "text": "Спасибо автору за понятную статью!"
    },
    {
      "id": 1181716,
      "author": "Татьяна К.",
      "datetime": "2023-01-20T17:28:50.802126+03:00",
      "text": "Благодарю за четкость раскрытия темы. И наконец-то есть примеры с датами!"
    },
    {
      "id": 1182396,
      "author": "Михаил Шардин",
      "datetime": "2023-01-21T08:23:43.883684+03:00",
      "text": "Алексей, 🙏"
    },
    {
      "id": 1295956,
      "author": "Андраник Агаджанов",
      "datetime": "2023-03-30T11:31:52.237679+03:00",
      "text": "А как такое может быть, чтобы эмитент выкупал облигацию по цене ниже номинала?"
    },
    {
      "id": 1539072,
      "author": "Андрей С.",
      "datetime": "2023-09-06T20:52:15.852751+03:00",
      "text": "Михаил! прошу пояснить следующие вопросы, нигде ранее я не видел подобной информации\n1. ГДЕ БРАТЬ ИНФОРМАЦИЮ о ТИПЕ ОФЕРТЫ?\nдаже та ссылка на СЕЛЛ-Сервис на MOEX не содержит ни слова про тип оферты, право выкупа на усмотрение эмитента...\n2. КАК ЭМИТЕНТ ВЫКУПАЕТ по ЗАНИЖЕННОЙ ЦЕНЕ? да еще и ниже рыночной?\nразве это вообще возможно? хочешь погасить гаси по номиналу раз выдавал номинал в начале, разница с текущей ценой вообще не должна его волновать - это дело инвесторов"
    },
    {
      "id": 1657435,
      "author": "Артур Иноземцев",
      "datetime": "2023-11-16T13:35:23.435701+03:00",
      "text": "Правильно ли я понял, что эмитент сам решает по какой стоимости выкупать облигации при пут- оферте? Если да, то существуют ли какие-то ограничения при установлении цен?"
    },
    {
      "id": 1710948,
      "author": "Людмила",
      "datetime": "2023-12-16T14:10:48.842642+03:00",
      "text": "Я - новичок по офертам. Хочу разобраться, стоит ли участвовать в оферте по облигациям РусАл в юанях в августе 2024 г."
    },
    {
      "id": 1788047,
      "author": "Виктор Абрамов",
      "datetime": "2024-01-29T09:28:04.535189+03:00",
      "text": "Михаил отвечает только на благодарности, не выходя за рамки своего конспекта за 3 курс:)"
    },
    {
      "id": 1789487,
      "author": "Виктор Абрамов",
      "datetime": "2024-01-29T16:54:37.098236+03:00",
      "text": "Михаил, я не увидел ответа Андрею Стариченко на вопрос, заданный конкретно и ПО-СУЩЕСТВУ. А \"путами и коллами\" википедия и так наводнена выше макушки. Ну хорошо..Вот Вам мой вопрос. Ряд брокеров сегодня(29.01.2024) анонсирует оферту по бумаге RU000A102UZ5 19 марта 2024 г. Другие источники - отрицают .Эмитент на запрос инвестора не отвечает. У брокера Тинькофф в календаре событий оферта есть, поддержка-отрицает ;) Ну, не может клиент проверять каждую цифру, предоставляемую ему брокером, он ПЛАТИТ брокеру за КАЧЕСТВЕННЫЙ сервис и ДОСТОВЕРНУЮ информацию.  Вопрос: как определить меру ответственности каждого из недостоверных источников, поскольку Инвестор принимает решение о сделке по информации, ОПУБЛИКОВАННОЙ посредством электронных сервисов своих контрагентов? Ссылки на нормативно-правовые акты по факту публикации \"фейков\", примеры досудебного урегулирования подобных ситуаций, и наконец, судебная практика  по таким спорам-вот что всем интересно. Может быть знаете как наказать недобросовестного брокера. Вот что нам нужно, а не прописные истины из учебника 90-х годов. В трейдинге сегодня уже нет новичков, мы здорово поумнели за последние 2 года...("
    },
    {
      "id": 1789658,
      "author": "Виктор Абрамов",
      "datetime": "2024-01-29T18:10:13.229630+03:00",
      "text": "Михаил, я и не расчитывал получить от  Вас ответ на свой скорее риторический в данной ситуации вопрос, это слишком сложно и не имеет описания в Википедии.) Ответьте хотя-бы на вопрос Стариченко спустя 4 месяца. Каким концом ставится соска все и так знают. С уважением и без обид:)"
    },
    {
      "id": 1789691,
      "author": "Виктор Абрамов",
      "datetime": "2024-01-29T18:25:49.248846+03:00",
      "text": "Работник, читайте как можно больше. Судя по ответам в чате Тинькофф - Вам ещё читать и читать! Хотя, когда начитаетесь, ваш отдел уже может стать подразделением совсем другого банка, ИМХО, и ск'юзми плизз..)"
    },
    {
      "id": 1812168,
      "author": "Sergey Isakov",
      "datetime": "2024-02-08T13:09:51.422455+03:00",
      "text": "Михаил, Смысл есть. Меня тоже интересует, где брать информацию о типе оферты.  На каком сайте... \n\nНапример облигации М-Видео, вып. 4 - оферта 23.04.2025. А какого она типа - нигде информации нет, включая программу выпуска облигаций, решение.."
    },
    {
      "id": 2268878,
      "author": "Юрий Попов",
      "datetime": "2024-09-25T15:11:30.774075+03:00",
      "text": "брокеры путаются в этом вопросе.\nнапример была (в обзоре) оферта *колл*, а через некоторое время стала *пут*.\nили вообще не сообщают тип оферты.\nможет просто ошибка, а может и квалификация-с ?"
    },
    {
      "id": 2356969,
      "author": "София Духовная",
      "datetime": "2024-11-01T16:31:09.023208+03:00",
      "text": "Здравствуйте! А где посмотреть сроки предъявления к оферте по облигациям? И если это смотрят на сайте Мосбиржи, то сразу спрошу, есть ли информация на другом сайте, т.к. этот у меня не открывается?)"
    },
    {
      "id": 2392063,
      "author": "Андрей Путилов",
      "datetime": "2024-11-14T10:33:20.474747+03:00",
      "text": "Михаил, Ладно, спустя nnn месяцев, всё равно ответить на вопросы по существу можно? Вам несколько раз напомнили, вопрос, вроде, нормальный."
    },
    {
      "id": 2581116,
      "author": "Дмитрий",
      "datetime": "2025-01-19T13:39:25.313555+03:00",
      "text": "А вы тот Шадрин со Смартлаба или другой?"
    },
    {
      "id": 2581117,
      "author": "Михаил Шардин",
      "datetime": "2025-01-19T13:39:55.619182+03:00",
      "text": "Дмитрий, другой"
    },
    {
      "id": 2581159,
      "author": "Джамиль Исмаилов",
      "datetime": "2025-01-19T13:52:23.145279+03:00",
      "text": "София, сайт русбондс(rusbonds.ru)Вам в помощь,регистрируетесь,вводите isin нужной Вам бумаги,смотрите---(выбираете нужную Вам подписку для получения информации(для меня хватает free,т.к.для себя принял решение не покупать бумаги с офертой,много заморочек,а выгоды так себе."
    },
    {
      "id": 2603764,
      "author": "Ирина Хисамутдинова",
      "datetime": "2025-01-26T12:37:23.276400+03:00",
      "text": "Здравствуйте. Я тоже нашла статью по поиску, и тоже интересно знать ответ на вопросы которые вам задал Андрей. Пусть  даже спустя столько времени статью читают другие пользователи и просматривают комментарии. А автор на вопросы не ответил. Это говорит о том, что он похоже  не знает ответа."
    },
    {
      "id": 2603769,
      "author": "Михаил Шардин",
      "datetime": "2025-01-26T12:38:23.062074+03:00",
      "text": "Ирина, а что за вопросы?"
    },
    {
      "id": 2628603,
      "author": "Маргарита Кузнецова",
      "datetime": "2025-02-03T14:29:57.217645+03:00",
      "text": "Статья очень понравилась. Я новичок в этой теме. Все понятно, доступно. Спасибо!"
    },
    {
      "id": 2634464,
      "author": "Александр",
      "datetime": "2025-02-05T16:12:47.003248+03:00",
      "text": "Михаил, \nНу давайте я воспользуюсь поиском по комментарием и напишу вопросы озвученные Андреем, которые интересуют многих и на которые вы никак почему-то не можете ответить:\n\n\"Михаил! прошу пояснить следующие вопросы, нигде ранее я не видел подобной информации\n1. ГДЕ БРАТЬ ИНФОРМАЦИЮ о ТИПЕ ОФЕРТЫ?\nдаже та ссылка на СЕЛЛ-Сервис на MOEX не содержит ни слова про тип оферты, право выкупа на усмотрение эмитента...\n2. КАК ЭМИТЕНТ ВЫКУПАЕТ по ЗАНИЖЕННОЙ ЦЕНЕ? да еще и ниже рыночной?\nразве это вообще возможно? хочешь погасить гаси по номиналу раз выдавал номинал в начале, разница с текущей ценой вообще не должна его волновать - это дело инвесторов\""
    },
    {
      "id": 2634759,
      "author": "Михаил Шардин",
      "datetime": "2025-02-05T18:21:56.098708+03:00",
      "text": "Александр, \n\n1. Мне кажется Вам стоит искать информацию в проспекте эмиссии и решении о выпуске облигаций. Их можно найти в раскрытии информации на сайте e-disclosure.ru (по ИНН или названию эмитента).\nИли на сайтах облигационных аналитиков:\nCbonds - показывает детали оферт, но иногда не бесплатно.\nRusBonds - содержит оферты, но тоже иногда урезанную информацию.\nSmart-Lab - могут обсуждать нюансы оферт в комментариях.\n\n2. Думаю да, это возможно. Некоторые оферты прописаны так, что эмитент может не выкупать облигации по оферте, если ему это невыгодно. Или выкупать по цене, которая ниже номинала."
    },
    {
      "id": 2669447,
      "author": "Дмитрий Шведов",
      "datetime": "2025-02-23T22:16:08.357840+03:00",
      "text": "Михаил, здравствуйте!\nСтатьи люди читают не только спустя 3 дня после публикации. Меня тоже интересует этот вопрос."
    },
    {
      "id": 2669452,
      "author": "Дмитрий Шведов",
      "datetime": "2025-02-23T22:18:47.658003+03:00",
      "text": "Виктор, вопрос действительно актуальный. \nВот пример - облигация \"Окей\" RU000A106AH6. В каких-то источниках сообщается об оферте 25.05.26, а где-то о ней ничего не говорится. Как понять достоверно, будет ли эта оферта или нет, - неизвестно."
    },
    {
      "id": 2669665,
      "author": "Михаил Шардин",
      "datetime": "2025-02-24T04:23:34.674044+03:00",
      "text": "Дмитрий, https://t-j.ru/prepayment-offer/?utm_source=telegram&amp;utm_medium=social&amp;utm_campaign=uvedomlyator#c2634759"
    }
  ]
}