{
  "url": "https://t-j.ru/maisonette/",
  "article_id": "e64ed0fb-bcac-4c0a-8b70-ed1d7916dad3",
  "article_uuid": "e64ed0fb-bcac-4c0a-8b70-ed1d7916dad3",
  "title": "Отзыв о двухуровневой квартире в Перми: особенности, плюсы и минусы",
  "comments": [
    {
      "id": 427978,
      "author": "Пфф",
      "datetime": "2021-05-05T15:49:58.393982+03:00",
      "text": ""
    },
    {
      "id": 427980,
      "author": "Михаил Шардин",
      "datetime": "2021-05-05T15:50:49.867263+03:00",
      "text": "Кокарбоксилаза, 🙏"
    },
    {
      "id": 427981,
      "author": "тьфунатебя ¯\\_(ツ)_/¯",
      "datetime": "2021-05-05T15:53:11.100067+03:00",
      "text": "Я думал, что сейчас будет рассказ про хату ценой в сотни лямов, а тут цена однушки на окрайне Москвы))\nКакая же у вас классная и светлая гостинная - окна в пол - это прям супер!!!"
    },
    {
      "id": 427982,
      "author": "Михаил Шардин",
      "datetime": "2021-05-05T15:54:47.409033+03:00",
      "text": "тьфунатебя, привет дружище, рад что не забываешь про меня 👍"
    },
    {
      "id": 427989,
      "author": "Dinara Yavorski",
      "datetime": "2021-05-05T15:58:21.502309+03:00",
      "text": "Двухэтажная квартира в Перми\n\nПлюсы: двухэтажная квартира.\nМинусы: в Перми."
    },
    {
      "id": 428002,
      "author": "Михаил Шардин",
      "datetime": "2021-05-05T16:07:49.001357+03:00",
      "text": "Dinara, кому как 😀"
    },
    {
      "id": 428032,
      "author": "really nice",
      "datetime": "2021-05-05T16:30:45.774312+03:00",
      "text": "Живем на трех в подмосковье. Плюсы есть, но минусов больше, и лестница это главная засада.\nПентхаус это очень хорошо, но лучше чтобы он был одноэтажный метров на 120-150 в тихом ~центре."
    },
    {
      "id": 428037,
      "author": "Михаил Шардин",
      "datetime": "2021-05-05T16:37:06.143964+03:00",
      "text": "really, а у вас какая площадь на трёх уровнях?"
    },
    {
      "id": 428042,
      "author": "Eva Shreiber",
      "datetime": "2021-05-05T16:39:49.714610+03:00",
      "text": "Мы выбрали двухуровневую квартиру, потому что меня бесят топающие соседи сверху и с двумя уровнями есть как минимум один этаж тишины. Против квартир на последних этажах решили из-за скошенных потолков. \nУ нас вообще мэзонет, такой дом в доме, мечта социофоба."
    },
    {
      "id": 428047,
      "author": "Sky-Dweller",
      "datetime": "2021-05-05T16:42:17.431763+03:00",
      "text": "Живу прямо сейчас в двухуровневой квартире a.k.a. \"мезонет.\" Площадь не знаю какая, метров 100 наверное. На втором уровне — кабинет, гардеробная и кладовка. Впечатлений особых нет, квартира как квартира — ну разве что лестница немного уюта придаёт."
    },
    {
      "id": 428085,
      "author": "Евгений Жигалов",
      "datetime": "2021-05-05T17:18:59.960824+03:00",
      "text": "Кокарбоксилаза, мы живём в маленьком городке (Нефтекамск, 110 тыс. жителей) - у нас двухуровневых квартир много.\nА тут - город с миллионом жителей..."
    },
    {
      "id": 428086,
      "author": "Михаил Шардин",
      "datetime": "2021-05-05T17:20:42.777742+03:00",
      "text": "Евгений, в Питере говорят много подобных квартир."
    },
    {
      "id": 428229,
      "author": "Lupus Est",
      "datetime": "2021-05-05T20:34:21.169087+03:00",
      "text": "Даже когда придёт в голову мысль строить свой дом, это будет строго 1 этаж. А уж двухэтажная квартира... нет уж, жили, хватит."
    },
    {
      "id": 428247,
      "author": "Anton Shershnev",
      "datetime": "2021-05-05T20:52:33.401376+03:00",
      "text": "У меня 2уровневая квартира в СПб, но с выходами на площадку с каждого этажа (7 и 8). На каждый этаж ездит грузовой лифт. Очень удобно в плане перемещения вещей.\nИз плюсов последних этажей - отсутствие шума от соседей сверху. Каждый этаж полноценный, поэтому и между этажами квартиры хорошая шумоизоляция.\nИз минусов - в таких квартирах редко встречается выход окон на разные стороны. Также с маленькими детьми перемещения между этажами представляют определенные неудобства."
    },
    {
      "id": 428253,
      "author": "Yuliya Syrova",
      "datetime": "2021-05-05T21:04:22.937778+03:00",
      "text": "Живем в двухэтажном доме. В квартире была уборщица, а в доме ее услуги стремятся к ипотечному платежу. Теперь я эксперт по швабрам конечно. Потому что робот пылесос либо будет халтурить, либо совершит публичный *Роскомнадзор* со второго этажа, либо ему надо покупать  лазерную завесу (ишь что!). Сквозная лестница генерирует постоянно витающую пыль, это, к сожалению, так. А у нас ещё и две собаки."
    },
    {
      "id": 428261,
      "author": "Aleksandr Demshin",
      "datetime": "2021-05-05T21:07:27.137787+03:00",
      "text": "Lupus, а я поддержу. Живу в двухэтажном доме, у друзей одноэтажный, часто бываем у них в гостях. Если нет проблем с площадью участка, то я бы выбрал одноэтажный. Его еще и проще сделать энергоэффективным."
    },
    {
      "id": 428263,
      "author": "Павел Басистов",
      "datetime": "2021-05-05T21:07:42.964911+03:00",
      "text": "Кокарбоксилаза, даже в Воркуте есть двухуровневые квартиры. Кстати, там не так дорого наверное сейчас. Тысяч за 500 можно взять будет."
    },
    {
      "id": 428277,
      "author": "Неизвестный пользователь",
      "datetime": "2021-05-05T21:13:36.400045+03:00",
      "text": "В Геленджике так вообще целый дворец, говорят"
    },
    {
      "id": 428278,
      "author": "Пфф",
      "datetime": "2021-05-05T21:13:56.702323+03:00",
      "text": ""
    },
    {
      "id": 428281,
      "author": "Вася Пупкин",
      "datetime": "2021-05-05T21:17:21.566560+03:00",
      "text": "Можно же было просто второй робот-пылесос завести чтоб не перетаскивать между этажами. Сам так собираюсь сделать в доме)"
    },
    {
      "id": 428307,
      "author": "Lupus Est",
      "datetime": "2021-05-05T22:02:49.988929+03:00",
      "text": "Aleksandr, однозначно. Да, одноэтажный выйдет, скорее всего, дороже сопоставимого по площади двухэтажного. И участок для него тоже, очевидно, нужен больше. Но прожив много лет в двухэтажном доме, и имея опыт проживания в двухэтажной квартире - нет уж. Себе - только в один этаж."
    },
    {
      "id": 428360,
      "author": "Ivan Petrov",
      "datetime": "2021-05-05T23:34:32.675619+03:00",
      "text": "Dinara, ожидание - токсичный комментарий от Бонда \nРеальность - токсичный комментарий от Динары"
    },
    {
      "id": 428363,
      "author": "Ivan Petrov",
      "datetime": "2021-05-05T23:38:37.367734+03:00",
      "text": "Eva, в Питере есть такое место - канонерский остров. На нем несколько типовых советских многоэтажек с трехуровневыми (внимание!!!) однушками ))\n\nСерьезно. 33м2 на трёх этажах - кухня на одном, прихожая-санузел на втором, жилая комната на третьем. Пока сам не увидел - не поверил бы!"
    },
    {
      "id": 428389,
      "author": "Lana",
      "datetime": "2021-05-06T01:45:03.207745+03:00",
      "text": "Снимаем двухуровневую квартиру-пентхаус в Роттердаме. Плюсы - красиво, прекрасный вид, огромное окно больше 5м в высоту от пола до потолка. Минусов больше)\n1) шумоизоляция. Вся квартира как один большой лофт без отдельных комнат, все слышно из одного конца квартиры в другом\n2) утомляет бегать по лестнице туда-сюда. Постепенно заводятся вещи в нескольких экземплярах для двух этажей: расчёски, кремы, средства для уборки. Обсуждается вопрос покупки робота-пылесоса для второго  этажа. В обиходе появляются фразы: «милый, туалетная бумага закончилась! Закинь мне ее, пожалуйста, наверх!» 😂\n3) есть риск навернуться на лестнице и получить серьёзную травму. Я один раз поскользнулась в неудачных тапочках и теперь опасаюсь ее\n4) мебель затаскивать наверх - отдельный квест, радует только то, что лестница не винтовая\n\nВ дальнейшем планируем найти обычную квартиру без лестниц-убийц"
    },
    {
      "id": 428424,
      "author": "Михаил Шардин",
      "datetime": "2021-05-06T05:07:21.518464+03:00",
      "text": "Кокарбоксилаза, 🚏🏁"
    },
    {
      "id": 428425,
      "author": "Михаил Шардин",
      "datetime": "2021-05-06T05:07:51.298759+03:00",
      "text": "Ivan, 🙏"
    },
    {
      "id": 428553,
      "author": "Evgeniya Mungalova",
      "datetime": "2021-05-06T10:11:31.462912+03:00",
      "text": "Когда пребываю в мечтах о своем доме, то хочу только одноэтажный, никаких лестниц. Меня как раз беспокоит проблема, как таскать пылесос на второй этаж. Или же покупать два - на каждый этаж. \nА подруга моя как раз о лестнице мечтает, хотя у нее одноэтажный дом. Ее муж смеется, говорит, давай просто поставим тебе лестницу, ходи по ней туда-сюда вверх-вниз :-)"
    },
    {
      "id": 428627,
      "author": "Елена Евстратова",
      "datetime": "2021-05-06T11:27:45.329393+03:00",
      "text": "Михаил, там немного другого плана квартиры, как мне кажется. В Петербурге очень много старого фонда с высокими потолками. И владельцы делают второй уровень со спальным местом. То есть это не полноценный второй этаж с кучей комнат."
    },
    {
      "id": 428632,
      "author": "Михаил Шардин",
      "datetime": "2021-05-06T11:30:41.003399+03:00",
      "text": "Елена, 🙏"
    },
    {
      "id": 428735,
      "author": "John Silver",
      "datetime": "2021-05-06T13:22:52.437291+03:00",
      "text": "Lupus, Aleksandr, расскажите, пожалуйста, какие недостатки видите в 2-этажном доме в сравнении с 1-этажным."
    },
    {
      "id": 428867,
      "author": "Сергей",
      "datetime": "2021-05-06T15:37:31.380756+03:00",
      "text": "Живу в 2х уровневой квартире 11 лет+. 180+ кв.м, близ МСК. (5-6 этаж).\n\nМансардная крыша, 2ой этаж полностью под ней, 1ый этаж частично. 5 комнат. Высокие потолки, от 2,8 до 6 метров. Три вторых света.\n1 этаж - зимний сад, спальня, гостиная + кухня, дровяной камин, гардероб, раздельный санузел.\n2 этаж - 1ая лестница - спальня, детская, санузел, 2ая лестница для кабинета.\n\nВ хате своя пылесосная система, с дырками под шланг в стенах, с выхлопом на улицу (бак на балконе), \"электросовок\" под раковиной на кухне. Удобно, втыкаешь в стену шланг и поехал. Также есть робот-пылесос, но пользуемся им редко. С шумоизоляцией внутри квартиры всё ОК.\nЗакрытый двор, мало машин, подземный паркинг. Это не все плюсы.\n\nМинусы - уборка, квартплата и не продуманная шумоизоляция от соседей сбоку. Иногда слышно как шумит душ соседей)"
    },
    {
      "id": 428930,
      "author": "Lana",
      "datetime": "2021-05-06T16:32:02.537352+03:00",
      "text": "Yuliya, современные роботы-пылесосы с лидаром распознают высоту и не падают ) У меня Xiaomi, он просто доезжает до края, где начинается лестница вниз, и дальше не едет"
    },
    {
      "id": 428957,
      "author": "Михаил Шардин",
      "datetime": "2021-05-06T16:59:43.895273+03:00",
      "text": "Светлана, у нас ещё старый лет 6 назад тоже распознавал конец площади."
    },
    {
      "id": 429202,
      "author": "Ivan Petrov",
      "datetime": "2021-05-07T02:08:29.940504+03:00",
      "text": "Елена, ну смотря какие потолки. Я встречал потолки по 7м - там полноценных три этажа можно сделать \n\nОбычно количество этажей завязано не столько на высоту потолков или площадь квартиры, сколько на наличие окон и естественного света - чердаки то никто не хочет делать"
    },
    {
      "id": 429882,
      "author": "Михаил Шардин",
      "datetime": "2021-05-07T20:40:37.409329+03:00",
      "text": "Алёшка, пентхаус — отдельное жилье на верхнем этаже многоэтажного дома, который имеет собственную террасу. Википедия.\nУ этой квартиры всё элементы есть."
    },
    {
      "id": 430073,
      "author": "Андрей Лесников",
      "datetime": "2021-05-08T06:04:39.066828+03:00",
      "text": "Делаем ремонт сейчас в своей двух уровневой квартире 180 кв.м. на последних 14 и 15 этажах (на \"первом\" этаже 40, на \"втором\" 140 метров) Сразу учли что лестница должна быть комфортной, поэтому расширили проем лестницы. Квест был ещё тот, когда пилили перекрытие в квартире. С одной стороны хотелось максимально широкую лестницу, но с другой - получается что сам у себя воруешь метры, а это деньги. Лестница вещь очень дорогая. Обходится примерно в миллион. Первый этаж такой же как у автора (кухня объединена с комнатой, есть прихожая и туалет с душевой). Второй этаж окнами выходит на разные стороны и их 6 (по 3 окна на каждую сторону) Т. Е. Можно построить 6 полноценных комнат,что мы и сделали. 1 - просторная ванна с окном на 14 кв.м., 2- комната сына, 3 - комната дочери, 4-наша спальня, 5- кабинет и 6- кинозал или скорее всего шумоизолированная комната для развлечений с барной стойкой. Во всех жилых ко натах 2,3 и 4 построили свои гардеробные. Купить такую квартиру получилось спонтанно. Застройщик долго (2 года) немог её продать и нам отдал её в рассрочку, да ещё и скидку сделал."
    },
    {
      "id": 430150,
      "author": "Александр Удавихин",
      "datetime": "2021-05-08T10:31:39.947754+03:00",
      "text": "Совет от профессионального кондиционерщика- ветер завывает и гудит не в наружных блоках кондиционеров, а через дренажные трубки для отвода конденсата. То есть эффект свистка.\nСамый простой, дешёвый и эффективный способ устранить эту проблему- на концы всех дренажных трубок надеть обычные воздушные шарики, на конце которых сделать надрез. Получится простой воздушный клапан.\nТолько сами не рискуйте, если трубки труднодоступны. Вызовите кондиционерщиков"
    },
    {
      "id": 430181,
      "author": "Валерия Райн",
      "datetime": "2021-05-08T11:20:02.961192+03:00",
      "text": "Ivan, если не хвалят, то сразу токсичный? Как интересно"
    },
    {
      "id": 430185,
      "author": "Михаил Шардин",
      "datetime": "2021-05-08T11:22:47.555725+03:00",
      "text": "Валерия, мне кажется любой человек может определить эмоциональный настрой текста."
    },
    {
      "id": 430187,
      "author": "Валерия Райн",
      "datetime": "2021-05-08T11:23:04.553547+03:00",
      "text": "Светлана, или стоит сменить неудачные тапочки"
    },
    {
      "id": 430193,
      "author": "Валерия Райн",
      "datetime": "2021-05-08T11:29:37.084411+03:00",
      "text": "Михаил, во-первых, вам кажется. Во-вторых, слово токсичный используют сейчас не к месту чаще, чем к месту."
    },
    {
      "id": 430200,
      "author": "Михаил Шардин",
      "datetime": "2021-05-08T11:40:28.326342+03:00",
      "text": "Валерия, вот вы в каком городе живёте?"
    },
    {
      "id": 430263,
      "author": "Андрей Чуриков",
      "datetime": "2021-05-08T13:18:58.349298+03:00",
      "text": "Михаил, ну вот Валерия и слилась. Достаточно было одного простого вопроса."
    },
    {
      "id": 430745,
      "author": "Рыбальченко Виталий",
      "datetime": "2021-05-09T08:38:40.619043+03:00",
      "text": "С годами задумываешься о  близости к земле.\nЛестницы утомляют"
    },
    {
      "id": 430800,
      "author": "Александр Удавихин",
      "datetime": "2021-05-09T11:38:03.510639+03:00",
      "text": "Angelina,  Ваш вариант, безусловно лучший. Но он реально возможен только на начальном этапе ремонта квартиры. То есть до чистовой отделки. То есть не в этом случае.\n  Впрочем, если Вам доведётся купить квартиру с ранее установленными кондиционерами, то конечно можете все стены раздербанить и провести дренаж в канализацию. Будет здорово!"
    },
    {
      "id": 431167,
      "author": "Даниил Смирнов",
      "datetime": "2021-05-10T03:04:55.948465+03:00",
      "text": "тьфунатебя, во-во! После одного мега-скандального дневника везде ловишь подвох, где хоть одно слово про роскошь есть.. А тут.. даже лёгкое разочарование получаешь (и в тоже время облегчение)"
    },
    {
      "id": 431960,
      "author": "Ruslan Allanazarov",
      "datetime": "2021-05-11T09:48:53.377431+03:00",
      "text": "Звучит и выглядит круто. Но по функционалу, второй этаж как игрушка, наиграешься и потом он уже вроде как и не нужен, но сам себе в этом не признаешься.\nСмотрел с родителями квартиру в 2 этажа, отказались.\nДом в два этажа та же самая история, с годами и старостью все реже будешь туда подниматься.\nНе говорю что так и должно быть, это лишь мое мнение."
    },
    {
      "id": 432376,
      "author": "Natalia Kopsov",
      "datetime": "2021-05-11T17:37:34.649423+03:00",
      "text": "Михаил, Вроде ранее Валерия где то писала, что она живёт в Москве в Медведково..."
    },
    {
      "id": 432912,
      "author": "Yuliya Syrova",
      "datetime": "2021-05-12T11:32:19.592142+03:00",
      "text": "Светлана, я рада за современные пылесосы, но у нас уже два несовременных) плюс старый танк и новый беспроводной вертикальный, который давится шерстью. Теперь я консерватор - метла и швабра)"
    },
    {
      "id": 446490,
      "author": "Павел Басистов",
      "datetime": "2021-05-26T10:11:22.600396+03:00",
      "text": "Алёшка, если у вас из квартиры видна крыша - надо срочно вызывать строителей. Что-то пошло не так."
    }
  ]
}