{
  "url": "https://t-j.ru/child-future/",
  "article_id": "e9ec7eab-1957-493f-a060-07deb18beb99",
  "article_uuid": "e9ec7eab-1957-493f-a060-07deb18beb99",
  "title": "Как инвестировать для ребенка",
  "comments": [
    {
      "id": 1249742,
      "author": "DG",
      "datetime": "2023-03-02T17:17:45.432437+03:00",
      "text": "Я передам своему сыну семейный бизнес так же, как когда-то мне его передала моя бабушка - мне кажется, что лучшее, что я смогу для него сделать."
    },
    {
      "id": 1250780,
      "author": "MiG",
      "datetime": "2023-03-03T09:36:19.905086+03:00",
      "text": "DG, в России? Семейный бизнес? Поколениями? Смело."
    },
    {
      "id": 1250781,
      "author": "MiG",
      "datetime": "2023-03-03T09:36:46.752427+03:00",
      "text": "Невеста, но образование нужно постараться дать (при необходимости оплатить)"
    },
    {
      "id": 1250853,
      "author": "Михаил Шардин",
      "datetime": "2023-03-03T09:58:58.912165+03:00",
      "text": "Alexander, не факт что ребенок захочет заниматься семейным делом"
    },
    {
      "id": 1250855,
      "author": "Михаил Шардин",
      "datetime": "2023-03-03T09:59:34.149402+03:00",
      "text": "Невеста, но с начальной базой проще"
    },
    {
      "id": 1251019,
      "author": "Невеста 2022",
      "datetime": "2023-03-03T10:41:41.821747+03:00",
      "text": "Alexander, я лично училась бесплатно, а второе высшее сама оплачивала из своей зарплаты. Но да, расходы на образование сейчас совсем другие."
    },
    {
      "id": 1251049,
      "author": "DG",
      "datetime": "2023-03-03T10:51:15.807226+03:00",
      "text": "Alexander, еще более смело - в Киеве)"
    },
    {
      "id": 1251053,
      "author": "DG",
      "datetime": "2023-03-03T10:52:22.107900+03:00",
      "text": "Михаил, возможно, но бизнес - сдача в аренду офисов. С некоторой потерей в доходности его можно перевести в категорию пассивного дохода и с минимумом усилий получать приятную прибавку к з/п)"
    },
    {
      "id": 1251111,
      "author": "ТиграБенгальская",
      "datetime": "2023-03-03T11:04:02.718974+03:00",
      "text": "DG, несколько историй знала такого перевода. Не очень удачно обычно,  Москва"
    },
    {
      "id": 1251128,
      "author": "ТиграБенгальская",
      "datetime": "2023-03-03T11:09:59.577740+03:00",
      "text": "Насмотрелась я на передачи капиталов, бизнесов активов наследничкам. И имела возможность отследить дальнейшую их( и детей и капиталов) судьбу.  В общем картина печальная- уход яркого пассионария( а создает капитал обычно он(а)) означает трагедию для близких начало спуска по социальной лестнице. Активы/пассивы храним записанными на себя,  по мере из поступления. Типа - открыли брокерский счёт- \"на секции\"- так он и будет висеть на муже,  в результате счета плодятся конечно,  как и однотипные активы"
    },
    {
      "id": 1257957,
      "author": "MiG",
      "datetime": "2023-03-07T12:27:00.051691+03:00",
      "text": "DG, про Киев ничего сказать не могу - не в курсе..."
    },
    {
      "id": 1257961,
      "author": "MiG",
      "datetime": "2023-03-07T12:28:16.134405+03:00",
      "text": "Михаил, и это тоже. Но вообще, я имел ввиду, что в России непросто сохранить бизнес и передавать его поколениями. В условном Лондоне - запросто. Такие уж у нас \"гибкие\" исторические реалии. Скучать не приходится."
    },
    {
      "id": 1264423,
      "author": "49-ый этаж",
      "datetime": "2023-03-10T22:27:34.674740+03:00",
      "text": "Я коплю внуку или внучке - их не зачали пока даже, так что время есть. Коплю на платное обучение в МГУ. Цель в идеале: накопить капитал в дивидендных акциях, чтобы одними дивидендами можно было закрывать оплату за год. Этот проект начал 1 января 2020 года. Начался он с того, что государство мне стало платить некую сумму - в 20-ом году это была сумма ~1700 руб. Мне она показалась малой, и была увеличена в 1,5 раза. Сейчас составляет 5 176,14 руб в месяц. Специально открыл брокерский счёт для этого на своё имя и регулярно покупаю на эти деньги ценные бумаги. В основном это акции Сбербанка, Норникеля, Газпрома, НЛМК и Мосбиржи. Тупо покупаю, без спекуляций. Дивиденды реинвестирую. Планирую так делать до смерти, а на сам счёт напишу завещание."
    }
  ]
}