{
  "url": "https://t-j.ru/apartment-mortgage-rent/",
  "article_id": "f4d4528f-6a15-4e55-999d-0c907a5c4434",
  "article_uuid": "f4d4528f-6a15-4e55-999d-0c907a5c4434",
  "title": "Сдача ипотечной квартиры в аренду: можно ли сдавать, плюсы и минусы, выгодно ли",
  "comments": [
    {
      "id": 1087709,
      "author": "Урфин Джюс",
      "datetime": "2022-11-17T15:22:25.878770+03:00",
      "text": "неплохо бы еще проверить кредитный договор - иногда бывает такой пункт запрещающий сдачу ипотечного имущества в аренду."
    },
    {
      "id": 1087730,
      "author": "Алексей Петров",
      "datetime": "2022-11-17T15:28:56.827006+03:00",
      "text": "Схема, как показали расчеты, нерентабельная. Причём не учтены такие факторы, как ремонт между сдачами (арендаторы могут так загадить квартиру, что весь доход уйдёт на ремонт), длительные простои, возможные неплатежи арендаторов, и прочие форс-мажоры. С другой стороны, в случае резкого роста стоимости жилья (и соответсвенно аренды) может и получиться отбить ипотеку."
    },
    {
      "id": 1087744,
      "author": "Михаил Шардин",
      "datetime": "2022-11-17T15:35:26.127213+03:00",
      "text": "Алексей, да, не особо рентабельно, но и круг вариантов для инвестиций в России за последние месяцы резко сократился."
    },
    {
      "id": 1087745,
      "author": "Михаил Шардин",
      "datetime": "2022-11-17T15:35:41.595285+03:00",
      "text": "Алексей, это как один из возможных вариантов, не более того"
    },
    {
      "id": 1087760,
      "author": "Алиса Селезнёва",
      "datetime": "2022-11-17T15:41:07.747731+03:00",
      "text": "Урфин, я сдавала ипотечную хату, всем плевать. Если договор не регистрируется в Росреестре - как это банк проверит, сдаёшь ты её или нет?"
    },
    {
      "id": 1087765,
      "author": "Михаил Шардин",
      "datetime": "2022-11-17T15:43:14.461077+03:00",
      "text": "Алиса, ну это только неофициально"
    },
    {
      "id": 1087769,
      "author": "Алиса Селезнёва",
      "datetime": "2022-11-17T15:44:16.204883+03:00",
      "text": "Купила однушку в Мурино в 2017 году за 2.5млн + переплата по ипотеке 1.7млн, суммарно 4.2млн получилось.\nПолучила ключи в середине 2019 года. За 2.5 года сдачи я получила с квартиры 450тыс + 250 тыс возврат НДФЛ.\nИ сама квартира подорожала до 4.5млн. На данный момент прибыли (с учётом задолженности по ипотеке) - 1.2 млн"
    },
    {
      "id": 1087799,
      "author": "a bit of work",
      "datetime": "2022-11-17T15:55:21.806744+03:00",
      "text": "главное не забыть сравнить результат с альтернативными вариантами. Может ли инвестор вложить 1,5 млн и 1700 рублей ежемесячно получше."
    },
    {
      "id": 1087839,
      "author": "Михаил Шардин",
      "datetime": "2022-11-17T16:09:59.954647+03:00",
      "text": "Алиса, спасибо что поделились"
    },
    {
      "id": 1087841,
      "author": "Дамир Палашов",
      "datetime": "2022-11-17T16:10:23.193847+03:00",
      "text": "На самом деле рабочая схема, но как и в любом бизнесе есть свои риски. Это простои, ремонты и прочее. Но итог остается приятным, спустя 25 лет тебе достается твоя личная квартира."
    },
    {
      "id": 1087849,
      "author": "Михаил Шардин",
      "datetime": "2022-11-17T16:12:39.549880+03:00",
      "text": "Дамир, но придется работать для этого"
    },
    {
      "id": 1087954,
      "author": "На лайте",
      "datetime": "2022-11-17T16:50:57.069926+03:00",
      "text": "Если не тянешь ипотеку, можно снять комнату/ жить в другом жильё, если оно есть, сдавать и гасить хоть так"
    },
    {
      "id": 1088211,
      "author": "Рыжая",
      "datetime": "2022-11-17T19:23:53.553748+03:00",
      "text": "Михаил, не самая пыльная работа, прямо скажем. При грамотном подходе и грамотно составленном договоре найма простои/амортизация/ущерб от жильцов не страшны. А помимо доходности, Вы правильно написали - после выплаты ипотеки в собственности квартира."
    },
    {
      "id": 1088243,
      "author": "Рыжая",
      "datetime": "2022-11-17T19:55:04.453660+03:00",
      "text": "На мой взгляд, один из самых надёжных способов если не приумножить, то по крайней мере сохранить то, что имеешь, при этом без значительных трудозатрат. Поделюсь своим опытом. \nИмеем, 4 года назад - однокомнатную квартиру 47 квадратов в черновой отделке в не самом хорошем районе Краснодара и 570 тысяч наличными. Стоимость квартиры на тот момент 970 тысяч, из них 700 - ипотека. Ежемесячный платёж 9 251. Ремонт делаю своими силами с привлечением профильных специалистов - электрик, сантехник, натяжные потолки. Тяжело, но это помогает сэкономить и в результате мы получаем не ремонт «под сдачу», а что-то уже более-менее интересное, что сдаётся буквально за полдня на 15-20% дороже рынка. Таким образом избегаем риска простоя и немного увеличиваем доход. Квартира изначально сдавалась за 13 000, к моменту продажи (через два года) уже за 15 000. \nДоговор найма составляем таким образом, что текущий ремонт/любой ущерб имуществу - ответственность арендатора. Кстати, это и по жилищному кодексу так. Арендаторов проверяем на наличие работы/отсутствие исполнительных производств, внешне оцениваем на благонадёжность. В основном срабатывает🤞\nЧерез два года квартира стоит 2 600 000, я продаю её и покупаю две студии по 22 метра в соседнем районе, также в черновой. Остаток по ипотеке перекрываю потребительским под 15,6%. 960 000 каждая студия, остальное на ремонт (пришлось добавить, каждая студия обошлась 450 тысяч, несмотря на то, что ремонт делала также сама). \nТеперь я сдаю каждую студию за 12 000, их цена на текущий момент 2300-2500, зависит от спешки. \nПлатёж по потребительскому кредиту 13 500, таким образом, я за два с половиной года (с учётом времени, потраченного на ремонт), вышла на чистый доход. \nВ этой ситуации мне повезло, потому что стоимость квартир не слишком высока, в цене квартиры сильно выросли за это время, ну и честно говоря, я прям пахала. \nСейчас скорее всего так быстро вложения не окупятся, но как правильно говорит Михаил, круг вариантов инвестиций сейчас резко сократился. \nЯ также не исключаю (точнее, скорее допускаю с большой долей вероятности) риск значительных потрясений ближайшие годы, который сильно отразится на рынке недвижимости. \nНо сесть сложа руки ведь тоже не вариант) \nИ что касается квартирантов. Было пару случаев, когда мне приходилось выселять людей буквально через пару недель после того, как они заселились. Плюс взыскивать через суд причиненный ущерб. Но ущерб был не слишком значительный, взыскала я в несколько раз больше. За хлопоты, так сказать) ну и залог дисциплинирует."
    },
    {
      "id": 1088326,
      "author": "Диман Лобынцев",
      "datetime": "2022-11-17T21:03:25.442209+03:00",
      "text": "Рыжая, а как вы проверяли работает ли квартиросъёмщик? Исп производство понятное дело легко. Есть сайт фссп. А вот по первому пункту пока не понимаю как)"
    },
    {
      "id": 1088352,
      "author": "Рыжая",
      "datetime": "2022-11-17T21:20:22.033968+03:00",
      "text": "Кстати, и  автор в статье, и я в своем комментарии расчеты делаем без учета инфляции и снижения реальных доходов. С первого взгляда картинка вроде норм, но по факту, продав квартиру 4 года назад за 970, я бы купила +/- за ту же цену. И сейчас, продам я за 2300 и куплю примерно за ту же цену. В моём случае увеличение стоимости достигнуто путем вложений сил и средств в ремонт плюс игра на незначительной разнице в стоимости недвижимости одного сегмента, анализ рынка. \nНу и 2300 сейчас и 4 года назад это уже сильно разные деньги. Что уж говорить про период 10 и более лет."
    },
    {
      "id": 1088401,
      "author": "ivan petrov",
      "datetime": "2022-11-17T21:58:40.802258+03:00",
      "text": "Рыжая, Рыжая, работа не самая пыльная, но все же работа\n\nа большинство планирующих сдавать квартиру - представляют процесс как пассивный доход, что в корне неправда"
    },
    {
      "id": 1088403,
      "author": "ivan petrov",
      "datetime": "2022-11-17T21:59:09.067673+03:00",
      "text": "Урфин, можно запросить у банка разрешение - как правило, денег это не стоит"
    },
    {
      "id": 1088404,
      "author": "ivan petrov",
      "datetime": "2022-11-17T22:00:16.046544+03:00",
      "text": "Алиса, секрет только в том что свой возврат 250к вы получили единожды в жизни, больше такого не будет. а он составил 36% от общего дохода\n\nсчитать доходом удорожание квартиры неверно потому что пока вы ее не продали это пассив - если будете продавать, например, прямо сейчас, то, по сравнению с февралем этого же года потеряете очень много."
    },
    {
      "id": 1088407,
      "author": "ivan petrov",
      "datetime": "2022-11-17T22:02:48.350285+03:00",
      "text": "Диман, лучше машиноместо или гараж чем комнату - геморроя и с продажей комнаты в будущем, и со сдачей в аренду будет в разы больше )"
    },
    {
      "id": 1088428,
      "author": "Kate",
      "datetime": "2022-11-17T22:21:28.429789+03:00",
      "text": "Ещё не помешает сравнить с жильем в кредит на курорте, например в Турции, там есть агенства для русскоязычных, квартира сдаётся от застройщика с чистовой+кухня, что очень удобно. Аренда конечно плавает в зависимости от сезонности."
    },
    {
      "id": 1088470,
      "author": "Доктор кно",
      "datetime": "2022-11-17T22:50:55.231600+03:00",
      "text": "Рыжая, сдаете? Поделитесь опытом, расскажите как это легко и просто."
    },
    {
      "id": 1088472,
      "author": "Доктор кно",
      "datetime": "2022-11-17T22:54:27.639947+03:00",
      "text": "ivan, согласен, если вообще получиться сейчас продать, так же другая недвижка тоже подорожала, значит со своей прибыли вы не купите больше недвижимости."
    },
    {
      "id": 1088556,
      "author": "Тимофей О",
      "datetime": "2022-11-18T00:47:13.516217+03:00",
      "text": "Квартиры это история сохранения денег, а не заработок. Кому везёт тот наверное зарабатывает, но точно не в текущих условиях. Роста как в 20 и 21 году на недвижимость мы вряд ли увидим в ближайшие 5 лет точно. Облигации по доходности обгоняют квартиры это однозначно, облигации сейчас приносят в районе 8% годовых и нет затрат на ремонт, налоги и все эти геморои с арендаторами, но есть риск дефолта хоть и небольшой. Чем меньше риск тем меньше доходность и наоборот все взаимосвязано"
    },
    {
      "id": 1088603,
      "author": "Рыжая",
      "datetime": "2022-11-18T02:52:32.248597+03:00",
      "text": "Диман, просто. Требую документы."
    },
    {
      "id": 1088625,
      "author": "Михаил Шардин",
      "datetime": "2022-11-18T04:40:56.557475+03:00",
      "text": "Петров, я писал про это: https://t-j.ru/guide/how-to-rent/"
    },
    {
      "id": 1088628,
      "author": "Михаил Шардин",
      "datetime": "2022-11-18T04:42:40.255314+03:00",
      "text": "Рыжая, спасибо что поделились"
    },
    {
      "id": 1088629,
      "author": "Михаил Шардин",
      "datetime": "2022-11-18T04:42:49.560675+03:00",
      "text": "Рыжая, да"
    },
    {
      "id": 1088630,
      "author": "Михаил Шардин",
      "datetime": "2022-11-18T04:44:10.357219+03:00",
      "text": "Диман, ой: https://t-j.ru/guide/checking-databases/"
    },
    {
      "id": 1088632,
      "author": "Михаил Шардин",
      "datetime": "2022-11-18T04:45:24.386765+03:00",
      "text": "Тимофей, согласен"
    },
    {
      "id": 1088634,
      "author": "Михаил Шардин",
      "datetime": "2022-11-18T04:46:39.864704+03:00",
      "text": "ivan, машиноместо в Перми например не продать - у меня был опыт - с трудом избавился."
    },
    {
      "id": 1088637,
      "author": "Рыжая",
      "datetime": "2022-11-18T04:52:45.410528+03:00",
      "text": "Петров, рассказывала уже как-то, можете в комментах посмотреть)"
    },
    {
      "id": 1089151,
      "author": "dimon676-vn",
      "datetime": "2022-11-18T11:06:03.746027+03:00",
      "text": "Вполне рабочая схема, в 17 году взял однокомнатную квартиру без первоначального взноса (под мат капитал), 9%, на 15 лет. С тех пор сдаётся, платеж за аренду чуть больше платежа по ипотеке, плюс все КУ оплачивает арендатор. Город Псков."
    },
    {
      "id": 1090150,
      "author": "ivan petrov",
      "datetime": "2022-11-18T18:36:56.203837+03:00",
      "text": "Михаил, я думаю очень зависит от цены. \n\nусловно если вы взяли машиноместо как в статье, в два раза дешевле, чем оно стоит сейчас, и продали с дисконтом к актуальной цене процентов в 15 - уйдёт быстро. скорость продажи завязана исключительно на размер дисконта. \n\nпо крайней мере, в СПб именно так"
    },
    {
      "id": 1090151,
      "author": "ivan petrov",
      "datetime": "2022-11-18T18:37:39.571352+03:00",
      "text": "Михаил, не факт, но мне ни разу не отказывали - 5 раз запрашивал"
    },
    {
      "id": 1090838,
      "author": "Виктор Пермяков",
      "datetime": "2022-11-19T12:33:54.953774+03:00",
      "text": "Живу в Иркутске. У нас сейчас неадекватные по меркам провинции цены на жилье (120-180 тыс. за кв. м), но и аренда за год выросла на 30-50%. С женою взяли вторую квартиру в центре с маленьким процентом по семейной ипотеке без первоночального взноса. Правда в новостройке, придется год ждать и еще делать ремонт не меньше чем в 1,5 млн. Однако рыночная стоимость аренды будет превышать платеж по ипотечному кредиту. Итого схема должна вывести в +. Правда в отдаленной перспективе."
    },
    {
      "id": 1091016,
      "author": "Мыяон",
      "datetime": "2022-11-19T16:26:58.689972+03:00",
      "text": "Схема будет работать лучше, если сдача посуточно. Тут важна локация."
    },
    {
      "id": 1091020,
      "author": "Михаил Шардин",
      "datetime": "2022-11-19T16:32:09.233383+03:00",
      "text": "Юлия, это прямо бизнес тогда"
    },
    {
      "id": 1091093,
      "author": "Рыжая",
      "datetime": "2022-11-19T18:00:46.130155+03:00",
      "text": "Джон, именно поэтому я и сказала, что текущий ремонт - это зона ответственности квартирантов, а  квартиру лучше через некоторое время продать. И купить новую, в черновом, и отремонтировать. А вообще, Вам не приходилось жить в съёмных квартирах? Что только не сдают. \nМне пять лет назад с такой гордостью собственница сдала квартиру «с обоями с шелкографией», которые отходили от стены, ремонта начала 90-х, и я согласилась, потому как альтернативные варианты ещё хуже были.\nДля понимания, за эту квартиру 30 квадратов в центре Сочи я платила 28 тысяч.  Я вообще сменила десятка два городов, и везде одна и та же история - или дешевый ремонт, или убитые квартиры, или ценник такой, который семья со средним доходом просто не потянет."
    },
    {
      "id": 1091455,
      "author": "Andrey Su",
      "datetime": "2022-11-20T01:19:13.233626+03:00",
      "text": "Тут не знаешь, что завтра будет, а люди ипотеку для квартиры за счет арендаторов планируют брать. Еще непонятно, где ваша квартира через 25 лет окажется, в какой стране"
    },
    {
      "id": 1092041,
      "author": "Рыжая",
      "datetime": "2022-11-20T19:53:33.043565+03:00",
      "text": "Руслан, а по Вашему, если квартирант год пользовался стиральной машиной, сломал её - я должна ремонтировать? Можно конечно и так, можно и уборку организовать, и завтрак в постель, но это немного другой уровень сервиса. \nДаже в силу закона ответственность за содержание имущества и поддержание надлежащего состояния возложена на арендатора."
    },
    {
      "id": 1092068,
      "author": "Михаил Шардин",
      "datetime": "2022-11-20T20:13:23.421936+03:00",
      "text": "Рыжая, стиралка-то ваша - кто её должен ремонтировать? Ему проще съехать да и всё"
    },
    {
      "id": 1092149,
      "author": "Рыжая",
      "datetime": "2022-11-20T22:04:41.173873+03:00",
      "text": "Михаил, почему должно быть такое потребительское отношение? Я обеспечила качественные ремонт,  технику и мебель. Та же стиралка не бирюса 20летней давности, а ARG, почти новая, после ТО. И при заключении договора ставлю условие, что предоставленное имущество должно содержаться в надлежащем состоянии. Как ни странно, желающие находятся, условия соблюдаются. Возможно, Вы не в теме, но и частная, и коммерческая аренда строится на таких условиях. Другой вопрос, если я через 10 лет эксплуатации сдам непроверенную технику и она сломается через неделю после заключения договора. Это будет моя вина, и я или отремонтирую, или заменю технику."
    },
    {
      "id": 1092255,
      "author": "SD",
      "datetime": "2022-11-21T04:53:36.997459+03:00",
      "text": "Мы в Москве взяли в 2016 году 1 комнату за 3.4, другую- за 3.8. в центре. Платежи на 15 лет были 32т и 35т в месяц+раз в год страховка=сумме платежей. При уменьшении ставки рефинансирования, платили разово по 5т за рассмотрение заявления в банке по каждой комнате с просьбой снизить платёж по кредиту. Платежи стали 27т и 31т. Потом немного погасили кредит по К2, сейчас он 29т. На первоначальный взнос по к2 и ремонт брали потребительский кредит в Сбере на 5лет по 20т.в месяц. Уже его выплатили. Сейчас аналогичные комнаты подорожали до 5-5.5млн. Сейчас арендаторы платят 17т и 20т. И это очень дёшево. Получается, своих денег мы платим сейчас 10т за одну комнату и 9т за другую. Итого 19т +коммуналка примерно 5т. Итого 24т. в месяц за две комнаты в центре Москвы, которые, надеюсь, через 10 лет будут в нашей собственности. И раз в год страховку по каждой комнате. Самое сложное было в самом начале. И ещё мы влипали с квартирантками-гр, которые после 4 лет более-менее нормального проживания начали вести себя неадекватно, устраивали скандалы и др, пришлось установить в коридоре видеонаблюдение, так как с ними стало небезопасно жить, их пришлось выселять досрочно, в соответствии с договором, а они решили затаскать нас за это  по судам, при этом врали постоянно, а, уехав, оставили клопов и обманули с ключами. Пришлось вскрывать дверь+оплачивать услуги юриста 100т за суды, а в комнате протравливать несколько раз насекомых, выкидывать всю мебель, делать капремонт с заменой полов и покупать новую мебель. Ремонт 150, мебель 150, замена подоконника 10т, вскрытие двери с заменой замков 15т. Дорогой ремонт и мебель, так как сначала рассчитывала, что в комнате будет жить дочка, а она поступила в ВУЗ в другом городе. Поэтому решили комнату, где никто не живёт, после года почти простоя опять сдавать. Забыла, ещё мы платили налоги 13 процентов в налоговую за арендаторов. Но если человек самозанятый, он платит, вроде 4 процента.\nДругие люди окупают ипотеку арендой. Нужно для этого ещё нормально разбираться в людях.\nСо временем, с учётом инфляции скорее всего платежи будет платить легче. А арендная плата может и увеличиваться.\nЧто будет с ценами на жильё в Москве не знаю, так как с одной стороны-мобилизация, но в Москве она была относительно скромной, много народу уехало из страны. Но скорее всего народ сейчас может потянуться в Москву в поисках работы при отсутствии таковой на местах."
    },
    {
      "id": 1095346,
      "author": "Влада Колесник",
      "datetime": "2022-11-22T21:52:48.635813+03:00",
      "text": "Купила в апреле 2018 студию вторичку именно под эти цели, правда за наличку + кредит на 7 лет (50/50). В начале лета 2022 закрыла кредит, квартиру продолжаю сдавать. Изначальная цена была 900тыс, сейчас ~2млн, вложения на старте 100к, дальше в среднем 20к в год. Сейчас хотелось бы продать и купить также студию под сдачу, но уже в ипотеку и в новом доме, но рынок на дне и никому моя кв не нужна. Кстати, со сдачей проблем 0, дольше половины дня не пустовала, ставлю на 1000 ниже рынка :)"
    },
    {
      "id": 1095354,
      "author": "Влада Колесник",
      "datetime": "2022-11-22T21:57:19.451728+03:00",
      "text": "Урфин, работаю в *синем банке* с ипотекой, сами предлагаем с радостью клиентам брать кв под сдачу, только За)"
    },
    {
      "id": 1241041,
      "author": "Юрий Рузавин",
      "datetime": "2023-02-25T19:05:23.608085+03:00",
      "text": "Схема рабочая, НО, возврат инвестиций произойдет на горизонте от 20 лет (чем крупнее город, тем дольше). Лично я не понимаю людей, которые извлекают из такого \"бизнеса\" 5-10к в месяц, а потом радуются квартире в 60+. Радоваться надо пока ты молод и полон сил, а не сидишь перед ТВ и смотришь дедушкины сказки или какой-нибудь треш по ОРТ. По сути, теряется смысл жизни, потому что каждое поколение не может насладиться плодами труда или делает это тогда, когда смысл этого теряется. \nЧтоб решить, готовы ли вы к ипотечно-арендной схеме, нужно провести расчеты, результаты могут вас не порадовать. И как уже было кем-то сказано, сильно интереснее инвестировать в облигации, не говоря уже об акциях (доходность примерно в 2 раза выше, нет привязки к земле, можно делать реинвест, нет простоя (почему-то многие думают, что у них будет загрузка 365 дней, ну да, ну да)). \nАвтор поста, как я понимаю, финансово не грамотен, поэтому хочет что-то попроще, без вложений. Но в жизни так не бывает, собственный бизнес - это намного сложнее, чем любая ацкая работа в офисе, при этом гарантий никто не даст. Про пассив вообще можете забыть, везде требуется участие и знания. Для начала я рекомендую вложить средства в себя, но, не у инфоцыган, у которых всегда все просто и радужно, а получить объективную картину рынка (не спрашивайте, гугл в помощь). Для примера: объективная рентабельность рентной квартиры в Москве 3-5%, при разного рода ухищрениях (часто незаконных) типа делений на студии можно получать и до 15%, но, на курсах вам расскажут про совсем другие цифры, типа \"ипотека под 0.1%, ежегодные перепродажи, космические аренды и т.д.\" под 70%, чего, конечно, или не бывает, или бывает крайне редко под форс-мажорное событие (типа ковида, военных действий и такого порядка). В общем сначала подумайте, посчитайте все (как Михаил) и только потом действуйте, иначе может быть мучительно жаль."
    },
    {
      "id": 1243534,
      "author": "Evgeniy",
      "datetime": "2023-02-27T17:35:26.137692+03:00",
      "text": "Тимофей, облигации ликвидны, удобны в случае необходимости забрать часть от суммы вложений. Но если инфляция выше купона, вы потеряете.\n\nДоходность квартиры конечно мизерная, но цена самой квартиры(в данном случае рассмотрим квартиру в роли основного капитала) растет."
    },
    {
      "id": 1243545,
      "author": "Evgeniy",
      "datetime": "2023-02-27T17:40:15.981471+03:00",
      "text": "Тимофей, а если инфляция выше купонов?"
    },
    {
      "id": 1531838,
      "author": "ЛюблюИзюм",
      "datetime": "2023-09-01T21:59:52.407698+03:00",
      "text": "Andrey, а то лучше хранить деньги на карте, через 15 лет это уже фантики, если повезет. А не повезет, так опять какой дефолт и отбор бабок у населения."
    }
  ]
}