{
  "url": "https://t-j.ru/kater-perm/",
  "article_id": "f54512a1-32af-4726-9e93-409292995e6e",
  "article_uuid": "f54512a1-32af-4726-9e93-409292995e6e",
  "title": "Сколько стоит катер и его содержание, как купить, как получить права, где его хранить зимой и летом, налоги",
  "comments": [
    {
      "id": 564523,
      "author": "Семен Скворцов",
      "datetime": "2021-09-23T10:54:02.199037+03:00",
      "text": "Шипшеринг рулит."
    },
    {
      "id": 564551,
      "author": "Михаил Шардин",
      "datetime": "2021-09-23T11:12:13.222316+03:00",
      "text": "Семен, эээ."
    },
    {
      "id": 565180,
      "author": "Fir",
      "datetime": "2021-09-23T16:39:42.762224+03:00",
      "text": "Все так, но с поломками - как повезет) Я брал старый финский катер 1990 года, но со свежим мотором 2011 года. Сделал обслуживание и хожу в свое удовольствие. Чтобы не сломать редуктор мотора о камень (стою в выборгском заливе, а там очень много камней), купил себе шведский наборный винт Propuls из пластика. За выход на +/- 100км уходит около 50 литров бензина. Стоянка в месяц 7 тыс руб с электричеством, также есть душ (200р), туалеты, сауна(1500р/час), мангальные зоны (500р), ресторан, номера и коттеджи.\nНу и добраться до лодки из Москвы до Спб по проездному РЖД  по 1200р в одну сторону (купе), ласточка до Выборга 500р, такси от Выборга до стоянки 1000р."
    },
    {
      "id": 565263,
      "author": "Михаил Шардин",
      "datetime": "2021-09-23T17:35:10.918231+03:00",
      "text": "Fir, спасибо что поделились."
    },
    {
      "id": 565614,
      "author": "Адвокат Бехметьев English",
      "datetime": "2021-09-23T22:17:13.903579+03:00",
      "text": "Интересная статья. Вы очень увлечены этим. А не было бы выгоднее летать в Турцию или Болгарию и арендовать яхточку на столько на сколько вам нужно? Не изучали этот вопрос?"
    },
    {
      "id": 565689,
      "author": "Владимир Морозов",
      "datetime": "2021-09-24T00:36:01.647091+03:00",
      "text": "За 400к можно снять на неделю неплохую яхту в Турции, включая все расходы."
    },
    {
      "id": 565735,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T04:32:41.972386+03:00",
      "text": "Адвокат, парусная яхта это ведь не моторный катер."
    },
    {
      "id": 565736,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T04:33:30.175286+03:00",
      "text": "Владимир, на неделю. А здесь ведь в любое время в сезоне. И всё же не 400 ежегодно."
    },
    {
      "id": 565738,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T05:28:46.811669+03:00",
      "text": "Fir, а вы в выборгский залив из Москвы ездите каждый раз?"
    },
    {
      "id": 565746,
      "author": "Алексей Шлыков",
      "datetime": "2021-09-24T06:49:01.476510+03:00",
      "text": "Подходил к покупке вплотную несколько раз, даже получил права, но так и не купил. Друзья владельцы отговорили. С учетом всех расходов проще и дешевле брать в аренду несколько раз за сезон на прогулку/покатушки, с капитаном, чтобы на борту себе не отказывать в мелких радостях ))"
    },
    {
      "id": 565747,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T06:50:12.896275+03:00",
      "text": "Алексей, в Перми подобный прокат тоже стал появляться, но цены там нереальные конечно - нерыночные."
    },
    {
      "id": 565753,
      "author": "Алексей Шлыков",
      "datetime": "2021-09-24T07:11:16.683857+03:00",
      "text": "Михаил, наверное с ростом количества ситуация должна поменяться"
    },
    {
      "id": 565755,
      "author": "ET C",
      "datetime": "2021-09-24T07:15:47.584285+03:00",
      "text": "Нет, слишком много проблем и ресурсов (временных и денежных) - по этой причине всегда стараюсь минимизировать имущество во владении и арендовать в случае необходимости."
    },
    {
      "id": 565758,
      "author": "ET C",
      "datetime": "2021-09-24T07:18:49.429922+03:00",
      "text": "Михаил, но вы привязаны к одной точке, а с арендой можно выбирать любую локацию в мире."
    },
    {
      "id": 565762,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T07:27:47.582771+03:00",
      "text": "ET, да, я это понимаю, но всё же пока есть возможность я бы выбрал владение."
    },
    {
      "id": 565764,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T07:29:14.539221+03:00",
      "text": "Алексей, возможно. Но я уже 20 лет с 18 лет в той или иной мере в теме и количество лодок особо не увеличивается. И на продаже лодки стоят годами."
    },
    {
      "id": 565766,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T07:29:50.071167+03:00",
      "text": "ET, каждый выбирает сам 👍"
    },
    {
      "id": 565815,
      "author": "Владимир Морозов",
      "datetime": "2021-09-24T08:40:09.270597+03:00",
      "text": "Михаил, на яхте помещается комфортно минимум 8 человек. Если подобрать хорошую компанию друзей и все скинутся, вообще копейки выходят."
    },
    {
      "id": 565821,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T08:42:37.282295+03:00",
      "text": "Владимир, это да 👍"
    },
    {
      "id": 565877,
      "author": "семен клевцов",
      "datetime": "2021-09-24T09:23:44.234312+03:00",
      "text": "Супер. Особенно нелегальные АЗС не порадовали. Особенности отечественного законодательства?"
    },
    {
      "id": 565893,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T09:35:33.238313+03:00",
      "text": "семен, в Перми есть вроде как только одна легальная АЗС, но меня попросили её не упоминать. У остальных просто бочка (размеры у всех разные) с топливом - подъезжаешь они через пистолет наливают, платишь и отчаливаешь. \nЕщё могут отказать в обслуживании, но если местный, то нет проблем."
    },
    {
      "id": 566105,
      "author": "Artem",
      "datetime": "2021-09-24T12:05:20.444383+03:00",
      "text": "Михаил, ахахаха."
    },
    {
      "id": 566213,
      "author": "Сергей Чичканов",
      "datetime": "2021-09-24T13:50:49.440344+03:00",
      "text": "Ух, собрался покупать гидроцикл с мотором от авто, а тут такие штрафы бешенные"
    },
    {
      "id": 566256,
      "author": "Михаил Шардин",
      "datetime": "2021-09-24T14:12:11.248514+03:00",
      "text": "Сергей, да, уже года два как."
    },
    {
      "id": 578313,
      "author": "Адвокат Бехметьев English",
      "datetime": "2021-10-06T11:42:13.846269+03:00",
      "text": "Михаил,"
    },
    {
      "id": 583110,
      "author": "Sonya Seneta",
      "datetime": "2021-10-11T10:45:51.516347+03:00",
      "text": "Подскажите, пожалуйста, мб сталкивались с подобным. Руководитель хочет перевозить свой гидроцикл, который не стоит на учете, из РФ в другие страны, например Кипр, Тайланд и т.п. Чтобы поучаствовать в местных гонках, а также просто покататься. Столкнулись с тем, что транспортные компании не хотят перевозить такой груз, так как это ТС, говорят, что обязательно, чтоб он стоял на учете. Либо нужно оформлять Карнет АТА, а это тоже заморочки с бумагами, не факт, что получится их все собрать. \nМб есть способ просто перевезти в другую страну (и обратно) гидроцикл просто как груз, а не как ТС?"
    },
    {
      "id": 583240,
      "author": "Михаил Шардин",
      "datetime": "2021-10-11T12:06:05.990725+03:00",
      "text": "Sonya, не знаю у меня не было опыта. Мне кажется дешевле на учёт поставить? При таких затратах на поездки налог совсем незначительной суммой будет?"
    },
    {
      "id": 628790,
      "author": "Эльдар",
      "datetime": "2021-11-18T18:33:17.575577+03:00",
      "text": "Определенно - да! Собственно чем сейчас и занимаюсь, а данная статья очень помогла в дополнении имеющихся знаний по содержанию водной техники! Спасибо!"
    },
    {
      "id": 628792,
      "author": "Михаил Шардин",
      "datetime": "2021-11-18T18:35:32.042266+03:00",
      "text": "Эльдар, Спасибо!"
    },
    {
      "id": 741751,
      "author": "Brian",
      "datetime": "2022-02-17T23:32:41.535609+03:00",
      "text": "В Перми права на управление парусным судно на ВВП выдает КамВодПуть. Все аналогично ГИМС, никуда для получения ехать не нужно. Являюсь обладателем таких прав. В Турции и других странах, как правило, выдают права IYT, для прибрежных морских районов плавания, они не имеют ничего общего с ВВП."
    },
    {
      "id": 741875,
      "author": "Михаил Шардин",
      "datetime": "2022-02-18T05:48:35.746857+03:00",
      "text": "Brian, и давно стали выдавать?"
    },
    {
      "id": 1001245,
      "author": "Денис Чумаков",
      "datetime": "2022-09-11T18:19:01.658313+03:00",
      "text": "Какая радиостанция установлена на Вашем катере ? Диапазон частот, скорее всего, речной, 5ый канал - 300,200 МГц. В Роскомнадзоре радиостанцию регистрировали ?"
    },
    {
      "id": 1001597,
      "author": "Михаил Шардин",
      "datetime": "2022-09-12T05:39:08.941208+03:00",
      "text": "Денис, лично у меня никакой нет"
    },
    {
      "id": 1001618,
      "author": "Денис Чумаков",
      "datetime": "2022-09-12T07:00:52.031710+03:00",
      "text": "Brian, в России, чтобы ходить по внутренним водным путям, необходимо иметь российское удостоверение на право управления маломерным судном, в котором открыт район плавания \"ВВП\". Никакие другие документы, в том числе и выданные в иностранных государствах, не дают такое право. \n\nЭто в автомобильном движении есть Конвенция, которая даёт право управлять автомобилем в странах-участницах по одному и тому же водительскому улостоверению. А на ВВП России такой возможности нет, нужен документ, выданный российской ГИМС."
    },
    {
      "id": 1002176,
      "author": "Сергей Даронин",
      "datetime": "2022-09-12T12:17:25.582532+03:00",
      "text": "Денис, вы правы, мой комментарий как раз об этом. Только в случае с парусными яхтами, права на ВВП РФ могут выдавать не ГИМС, а другие организации, например, \"КамВодПуть\" в Пермском крае."
    },
    {
      "id": 1002456,
      "author": "Денис Чумаков",
      "datetime": "2022-09-12T14:25:41.065006+03:00",
      "text": "Сергей, да, ещё я имел в виду, что ходить по внутренним водным путям России, независимо от вида маломерного судна, можно только с российским удостоверением. На морских путях возле российского побережья, возможно, разрешается ходить и с удостоверениями, выданными иностранными организациями.\nА КамВодПуть - это что за организация? Насколько мне известно, обучают судовождению частные организации, а принимает экзамены и выдаёт удостоверения на право управления маломерным судном только государственная организация - ГИМС. Принцип тот же, как и при подготовке водителей автомобилей."
    },
    {
      "id": 1722139,
      "author": "ситхолинсе",
      "datetime": "2023-12-23T13:14:37.398828+03:00",
      "text": "Интересная статья!\nЯ родом из перми, но проживаю сейчас в спб. Здесь супер развита водная культура..сама каталась на парусных яхтах и байдарках. И планирую получать права на парусную яхту. Здесь есть яхт школы, которые помогут с этим. Поэтому было тоже интересно узнать развита эта сфера в Перми или нет, потому что я думаю в нашем крае есть куда съездить...но как оказалось у нас даже права на парусную яхту нельзя получить:(( это печально.\nДумаю у региона есть потенциал, если государство будет стимулировать, то запрос от граждан будет...\nЧем меньше входной барьер, тем и больше спроса"
    },
    {
      "id": 1859154,
      "author": "Наталья Филиппова",
      "datetime": "2024-03-01T18:52:11.176499+03:00",
      "text": "мне бы себя содержать, а тут катер"
    },
    {
      "id": 1859440,
      "author": "Boris Köln",
      "datetime": "2024-03-01T21:18:29.940541+03:00",
      "text": "Если жить у реки и хотя бы раз в неделю \"ходить\" по воде, то иметь свой катер выгодно.\n\nЯ же предпочту арендовать. Причем, в разных странах. Например, в Польше можно арендовать лодку на 7 спальных мест от 400 злотых (9 тыс руб) в сутки и отправиться на ней в плавание по Жулавской петле. Для 30 л.с. даже права не нужны (\"Bez sternika, licencja nie jest wymagana\").\n\nПо рекам Германии, Нидерландов, Франции тоже интересно путешествовать компанией на лодке. От 130 €/сутки за всех."
    },
    {
      "id": 1875207,
      "author": "Роман",
      "datetime": "2024-03-10T00:16:59.101725+03:00",
      "text": "Михаил, это нормальная практика для Москвы, особенно если лодка большая,  \n— держать её в Питере. И близко, и простор есть.\n\nВ Подмосковье лодка — история на любителя: либо по выходным толкаться с соседями по водоёму, либо по полдня тратить на шлюзование, чтобы уйти подальше."
    }
  ]
}